类 编辑器_资源编辑器_自定义声音 : 窗口

	@布局配置([[根布局=真,宽度=-1,高度=-1]])
	变量 自适应布局1 : 自适应布局
	@布局配置([[父布局=自适应布局1,宽度=-1,高度=-1,@横坐标比例=-9.0E-4,@纵坐标比例=-4.0E-4,纵向布局=真]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=50,背景颜色=-1,纵向布局=假]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度DP=50,高度DP=50,对齐方式=17]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局3,宽度DP=25,高度DP=25,图片资源="../../../../资源库/图标/back/default_backicon.png",水波纹效果=真,可获取焦点=真]])
	变量 退出界面 : 图片框
	@布局配置([[父布局=线性布局2,宽度=-1,高度=-1]])
	变量 相对布局1 : 相对布局
	@布局配置([[父布局=相对布局1,高度DP=50,对齐方式=8388627,宽度=-1]])
	变量 线性布局6 : 线性布局
	@布局配置([[父布局=线性布局6,字体大小=20,粗体=假,@左外边距DP=10,字体颜色=-16777216,内容="自定义声音"]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=相对布局1,高度DP=50,对齐方式=8388629,宽度=-1]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,宽度DP=50,高度DP=50,对齐方式=17,纵向布局=真,水波纹效果=真]])
	变量 线性布局7 : 线性布局
	@布局配置([[父布局=线性布局7,宽度DP=25,高度DP=25,图片资源="../../../../资源库/图标/editor/resource_editor/menu.png"]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局1,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局5 : 线性布局
	@布局配置([[父布局=线性布局5,宽度=-1,高度=-2,纵向布局=真]])
	变量 线性布局8 : 线性布局
	@布局配置([[父布局=线性布局8,宽度=-1,高度DP=80,纵向布局=真,对齐方式=8388627,背景颜色=-1,@上外边距DP=1]])
	变量 线性布局10 : 线性布局
	@布局配置([[父布局=线性布局10,内容="ID:",粗体=真,@左外边距DP=10,字体颜色=-16777216]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=线性布局10,宽度=-1,高度DP=40,@上外边距DP=4,@左外边距DP=10,@右外边距DP=10,卡片阴影=0,圆角=15]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,对齐方式=17,背景颜色=-591879]])
	变量 线性布局11 : 线性布局
	@布局配置([[父布局=线性布局11,宽度=-1,高度=-1,字体大小=16,背景颜色=0,@左外边距DP=5,@右外边距DP=5,提示文本颜色=-8224126,内容="",提示文本="请输入...",单行显示=真,最低补全字数=1]])
	变量 编辑框1 : 自动补全编辑框
	@布局配置([[父布局=线性布局8,宽度=-1,高度DP=80,纵向布局=真,对齐方式=8388627,背景颜色=-1,@上外边距DP=1]])
	变量 线性布局12 : 线性布局
	@布局配置([[父布局=线性布局12,内容="音乐路径:",粗体=真,@左外边距DP=10,字体颜色=-16777216]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局12,宽度=-1,高度DP=40,@上外边距DP=4,@左外边距DP=10,@右外边距DP=10,卡片阴影=0,圆角=15]])
	变量 卡片布局2 : 卡片布局
	@布局配置([[父布局=卡片布局2,宽度=-1,高度=-1,对齐方式=17,背景颜色=-591879]])
	变量 线性布局13 : 线性布局
	@布局配置([[父布局=线性布局13,宽度=-1,高度=-1,字体大小=16,背景颜色=0,@左外边距DP=5,@右外边距DP=5,提示文本颜色=-8224126,内容="",提示文本="输入ID的时候会自动生成(可以进行更改)...",单行显示=真]])
	变量 编辑框2 : 编辑框
	@布局配置([[父布局=线性布局8,宽度=-1,高度DP=80,纵向布局=真,对齐方式=8388627,背景颜色=-1,@上外边距DP=1]])
	变量 线性布局14 : 线性布局
	@布局配置([[父布局=线性布局14,内容="输出指令:",粗体=真,@左外边距DP=10,字体颜色=-16777216]])
	变量 文本框4 : 文本框
	@布局配置([[父布局=线性布局14,宽度=-1,高度DP=40,@上外边距DP=4,@左外边距DP=10,@右外边距DP=10,卡片阴影=0,圆角=15]])
	变量 卡片布局3 : 卡片布局
	@布局配置([[父布局=卡片布局3,宽度=-1,高度=-1,对齐方式=17,背景颜色=-591879]])
	变量 线性布局17 : 线性布局
	@布局配置([[父布局=线性布局17,宽度=-1,高度=-1,字体大小=16,背景颜色=0,@左外边距DP=5,@右外边距DP=5,提示文本颜色=-8224126,内容="",提示文本="用于播放声音的指令(此处不需要输入)"]])
	变量 编辑框4 : 编辑框
	@布局配置([[父布局=线性布局8,宽度=-1,高度DP=80,纵向布局=真,对齐方式=8388627,背景颜色=-1,@上外边距DP=1]])
	变量 线性布局15 : 线性布局
	@布局配置([[父布局=线性布局15,内容="新音乐路径:",粗体=真,@左外边距DP=10,字体颜色=-16777216]])
	变量 文本框5 : 文本框
	@布局配置([[父布局=线性布局15,宽度=-1,高度DP=40,@上外边距DP=4,@左外边距DP=10,@右外边距DP=10,卡片阴影=0,圆角=15]])
	变量 卡片布局4 : 卡片布局
	@布局配置([[父布局=卡片布局4,宽度=-1,高度=-1,对齐方式=17,背景颜色=-591879]])
	变量 线性布局16 : 线性布局
	@布局配置([[父布局=线性布局16,宽度=-1,高度=-1,字体大小=16,背景颜色=0,@左外边距DP=5,@右外边距DP=5,提示文本颜色=-8224126,内容="",提示文本="新音频的路径(长按进行选择)",单行显示=真]])
	变量 编辑框3 : 编辑框
	@布局配置([[父布局=线性布局8,宽度=-1,高度DP=80,纵向布局=真,对齐方式=8388627,背景颜色=-1,@上外边距DP=1]])
	变量 线性布局18 : 线性布局
	@布局配置([[父布局=线性布局18,内容="流线播放:",粗体=真,@左外边距DP=10,字体颜色=-16777216]])
	变量 文本框6 : 文本框
	@布局配置([[父布局=线性布局18,宽度=-1,高度DP=40,@上外边距DP=4,@左外边距DP=10,@右外边距DP=10,卡片阴影=0,圆角=15]])
	变量 卡片布局6 : 卡片布局
	@布局配置([[父布局=卡片布局6,宽度=-1,高度=-1]])
	变量 相对布局2 : 相对布局
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,对齐方式=8388627,背景颜色=-591879]])
	变量 线性布局21 : 线性布局
	@布局配置([[父布局=线性布局21,内容="stream:",粗体=假,@左外边距DP=10,字体颜色=-16777216]])
	变量 文本框9 : 文本框
	@布局配置([[父布局=线性布局21,宽度DP=20,高度DP=20,图片资源="../../../../资源库/图标/editor/resource_editor/sounds/tips.png",@左外边距DP=5]])
	变量 图片框3 : 图片框
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局19 : 线性布局
	@布局配置([[父布局=线性布局19,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关1 : IOS开关
	@布局配置([[父布局=线性布局5,宽度=-1,高度=-2,纵向布局=真]])
	变量 线性布局9 : 线性布局
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=45,@上外边距DP=20,@左外边距DP=10,@右外边距DP=10,圆角=30,卡片阴影=0,可视=假]])
	变量 卡片布局7 : 卡片布局
	@布局配置([[父布局=卡片布局7,宽度=-1,高度=-1,对齐方式=17,背景颜色=-13328912]])
	变量 线性布局22 : 线性布局
	@布局配置([[父布局=线性布局22,内容="播放新音频",粗体=真,字体颜色=-1]])
	变量 文本框7 : 文本框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=45,@上外边距DP=20,@左外边距DP=10,@右外边距DP=10,圆角=30,卡片阴影=0]])
	变量 卡片布局5 : 卡片布局
	@布局配置([[父布局=卡片布局5,宽度=-1,高度=-1,对齐方式=17,背景颜色=-13328912]])
	变量 线性布局20 : 线性布局
	@布局配置([[父布局=线性布局20,内容="保存并生成",粗体=真,字体颜色=-1]])
	变量 文本框8 : 文本框

	变量 文件选择器S:文件选择器
	变量 音频位置:文本
	变量 JSON对象1 : JSON数组?
	变量 设置_设定 : 设置_设定

	事件 编辑器_资源编辑器_自定义声音:创建完毕()
		//设置主题
		本对象.显示标题栏 = 假
		本对象.状态栏颜色 = 0XFFFFFFFF
		本对象.状态栏字体黑色 = 真
		//窗口切换动画
		播放默认切换动画(2)
		//设置夜间模式
		如果 设置_设定.获取开关("NightMode") 则
			设置夜间模式()
		结束 如果
		//设置背景
		变量 设置相关路径 : 文本 = 设置_设定.获取文本("PersonalityBackground")
		如果 设置相关路径.替换(" ","") == "" 则
		否则
			如果 文件是否存在(设置相关路径) 则
				设置_设置.设置布局背景(本对象,线性布局5,设置相关路径)
			结束 如果
		结束 如果
		//判断文件是否存在
		变量 项目名称 : 文本 = 其他_其他.读缓存("ProjectName")
		变量 sound_definitions的路径 : 文本 = 其他_变量.项目目录 + 项目名称 + "/resource/sounds/sound_definitions.json"
		如果 文件是否存在(sound_definitions的路径) 则
		否则
			写出文本文件(sound_definitions的路径,"{}")
		结束 如果
		//设置补全
		变量 记录文件路径 : 文本 = 其他_变量.数据目录 + "resource/sounds/save_record.txt"
		如果 文件是否存在(记录文件路径) 则
			变量 记录文件内容 : 文本 = 读入文本文件(记录文件路径)
			如果 记录文件内容.替换(" ","") == "" 则
			否则
				变量 补全数组 : 文本[] = 记录文件内容.分割文本(" ")
				编辑框1.设置补全内容(本对象,补全数组)
			结束 如果
		结束 如果
		//订阅事件
		订阅事件()
	结束 事件

	//退出
	事件 退出界面:被单击()
		关闭窗口()
	结束 事件

	//提示
	事件 图片框3:被单击()
		变量 消息 : DX基础对话框
		消息.标题("stream提示")
		消息.内容("是否以流线播放，用于缓解时间较长的音效产生的卡顿，也决定在未播放完音效下播放同一音效是否会叠加，流线情况下不会叠加则为重新播放")
		//设置夜间模式
		如果 设置_设定.获取开关("NightMode") 则
			消息.主题(DX主题.暗色)
		结束 如果
		消息.按钮1("确定")
		消息.可取消(真)
		消息.显示()
	结束 事件

	//输入ID自动填入
	事件 编辑框1:内容被改变()
		变量 idroutess : 文本 = 编辑框1.内容.替换(".","/")
		编辑框2.内容 = "sounds/" + idroutess
		编辑框4.内容 = "/playsound minecraft." + 编辑框1.内容 + " @p"
	结束 事件

	//选择路径
	事件 编辑框3:被长按()
		文件选择器S.选择文件(本对象,1234)
	结束 事件

	//代码回调(获得图标路径)
	事件 编辑器_资源编辑器_自定义声音:获得返回数据(请求码 : 整数,结果码 : 整数,数据 : 启动信息)
		音频位置 = 文件选择器S.解析文件地址(本对象,数据)
		如果 取文件后缀名(音频位置).到小写() == "ogg" 则
			编辑框3.内容 = 音频位置
			卡片布局7.可视 = 真
		否则
			弹出错误提示("选择失败，请选择ogg格式的音频文件")
		结束 如果
	结束 事件

	//播放新音频
	事件 线性布局22:被单击()
		变量 其他_附件_媒体播放 : 其他_附件_媒体播放
		其他_附件_媒体播放.开始(编辑框3.内容)
	结束 事件

	//保存
	事件 线性布局20:被单击()
		如果 编辑框3.内容 == "" 则
			弹出警告提示("新音频路径不能为空!")
		否则
			变量 项目名称 : 文本 = 其他_其他.读缓存("ProjectName")
			变量 sound_definitions的路径 : 文本 = 其他_变量.项目目录 + 项目名称 + "/resource/sounds/sound_definitions.json"
			//变量
			变量 json : JSON对象 = 读入文本文件(sound_definitions的路径,"utf-8")
			变量 json2 : JSON对象 = [[{}]]
			变量 jsonmetadata: JSON对象 = [[{}]]
			JSON对象1 = "[]"
			//需要添加的项
			jsonmetadata["name"] = 编辑框2.内容
			jsonmetadata["stream"] = IOS开关1.选中
			//数组
			JSON对象1.置入(jsonmetadata)
			//添加
			json2["category"] = "music"
			json2["sounds"] = JSON对象1
			//赋值给新对象
			变量 新对象 : JSON对象 = json2
			//根
			json["minecraft." + 编辑框1.内容] = 新对象
			//输出
			写出文本文件(sound_definitions的路径,json.到文本(4))
			//复制音频文件
			变量 输出文件集合 : 文本 = 其他_变量.项目目录 + 项目名称 + "/resource/" + 编辑框2.内容 + ".ogg"
			复制文件(编辑框3.内容,输出文件集合)
			项目记录(输出文件集合)
			//关闭
			关闭窗口()
		结束 如果
		//保存ID记录
		如果 设置_设定.获取开关("ResourceEditorCustomSoundsRecordIdSaved") 则
			变量 记录文件路径 : 文本 = 其他_变量.数据目录 + "resource/sounds/save_record.txt"
			如果 文件是否存在(记录文件路径) 则
				变量 记录文件内容 : 文本 = 读入文本文件(记录文件路径)
				变量 记录文件内容结果 : 文本 = 记录文件内容 + 编辑框1.内容 + " "
				写出文本文件(记录文件路径,记录文件内容结果)
			否则
				写出文本文件(记录文件路径,"")
			结束 如果
		结束 如果
	结束 事件

	//项目记录
	方法 项目记录(路径 : 文本)
		//项目记录
		变量 模块_项目 : 模块_项目
		模块_项目.初始化()
		模块_项目.assets图标 = "icon/item/record.png"
		模块_项目.名称 = 取文件前缀名(路径)
		模块_项目.标识符 = 编辑框1.内容
		模块_项目.描述 = "这个是资源包字体"
		模块_项目.种类 = 模块_项目种类.资源包
		模块_项目.分类 = "custom_sound"
		模块_项目.路径 = 路径
		模块_项目.保存()
	结束 方法

	//设置功能按钮颜色
	方法 设置夜间模式()
		本对象.状态栏颜色 = 0XFF333333
		本对象.状态栏字体黑色 = 假
		线性布局2.背景颜色 = 0XFF333333
		退出界面.图片资源 = 编辑器_资源编辑器_自定义声音_资源.白色返回图标
		图片框1.图片资源 = 编辑器_资源编辑器_自定义声音_资源.白色菜单图标
		文本框2.字体颜色 = 0XFFFFFFFF
		线性布局5.背景颜色 = 0XFF222222
		编辑框1.提示文本颜色 = 0XFF999999
		编辑框1.字体颜色 = 0XFFFFFFFF
		编辑框2.提示文本颜色 = 0XFF999999
		编辑框2.字体颜色 = 0XFFFFFFFF
		编辑框3.提示文本颜色 = 0XFF999999
		编辑框3.字体颜色 = 0XFFFFFFFF
		编辑框4.提示文本颜色 = 0XFF999999
		编辑框4.字体颜色 = 0XFFFFFFFF
		线性布局10.背景颜色 = 0XFF333333
		线性布局12.背景颜色 = 0XFF333333
		线性布局14.背景颜色 = 0XFF333333
		线性布局15.背景颜色 = 0XFF333333
		线性布局18.背景颜色 = 0XFF333333
		文本框1.字体颜色 = 0XFFFFFFFF
		文本框3.字体颜色 = 0XFFFFFFFF
		文本框4.字体颜色 = 0XFFFFFFFF
		文本框5.字体颜色 = 0XFFFFFFFF
		文本框6.字体颜色 = 0XFFFFFFFF
		线性布局11.背景颜色 = 0XFF333333
		线性布局13.背景颜色 = 0XFF333333
		线性布局17.背景颜色 = 0XFF333333
		线性布局16.背景颜色 = 0XFF333333
		线性布局21.背景颜色 = 0XFF333333
		卡片布局1.卡片背景颜色 = 0XFF333333
		卡片布局2.卡片背景颜色 = 0XFF333333
		卡片布局3.卡片背景颜色 = 0XFF333333
		卡片布局4.卡片背景颜色 = 0XFF333333
		卡片布局5.卡片背景颜色 = 0XFF333333
		卡片布局6.卡片背景颜色 = 0XFF333333
		文本框9.字体颜色 = 0XFFFFFFFF
		图片框3.图片资源 = 编辑器_资源编辑器_自定义声音_资源.白色菜单提示
	结束 方法


结束 类

类 编辑器_资源编辑器_自定义声音_资源

	@静态
	变量 白色返回图标 : 图片资源 =  "../../../../资源库/图标/back/default_backicon2.png"

	@静态
	变量 白色菜单图标 : 图片资源 =  "../../../../资源库/图标/editor/resource_editor/menu2.png"

	@静态
	变量 白色菜单提示 : 图片资源 =  "../../../../资源库/图标/editor/resource_editor/sounds/tips2.png"

结束 类