类 设置_资源编辑器 : 窗口

	@布局配置([[根布局=真,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=50,对齐方式=8388627,背景颜色=-1]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度DP=15,高度DP=15,图片资源="../../../../资源库/图标/back/Back_black.png",@左外边距DP=10]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局2,字体大小=15,内容="设置",字体颜色=-16777216]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局2,宽度DP=2,高度DP=12,@左外边距DP=10,卡片阴影=0,卡片背景颜色=16251129]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,背景颜色=-526087]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局2,@左外边距DP=10,粗体=真,字体大小=16,内容="资源编辑器设置",字体颜色=-16777216]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局1,宽度=-1,高度=-1,完全显示=假,显示滚动条=假]])
	变量 滚动布局1 : 滚动布局
	@布局配置([[父布局=滚动布局1,宽度=-1,高度=-1,纵向布局=真,右内边距DP=10,左内边距DP=10]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-2,@上外边距DP=10,卡片阴影=0,圆角=5,可视=真]])
	变量 卡片布局3 : 卡片布局
	@布局配置([[父布局=卡片布局3,宽度=-1,高度=-1,背景颜色=-1,纵向布局=真]])
	变量 线性布局9 : 线性布局
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=40,对齐方式=8388627]])
	变量 线性布局10 : 线性布局
	@布局配置([[父布局=线性布局10,@左外边距DP=10,字体大小=15,字体颜色=-9671572,粗体=真,内容="贴图"]])
	变量 文本框7 : 文本框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局2 : 相对布局
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局11 : 线性布局
	@布局配置([[父布局=线性布局11,@左外边距DP=10,字体颜色=-16777216,内容="重新生成资源",粗体=真,字体大小=16]])
	变量 文本框8 : 文本框
	@布局配置([[父布局=线性布局11,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="如果资源编辑器闪退或者资源缺失，也可以更新里面的贴图"]])
	变量 文本框9 : 文本框
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局12 : 线性布局
	@布局配置([[父布局=线性布局12,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框18 : 图片框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局5 : 相对布局
	@布局配置([[父布局=相对布局5,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局21 : 线性布局
	@布局配置([[父布局=线性布局21,@左外边距DP=10,字体颜色=-16777216,内容="列表大小",粗体=真,字体大小=16]])
	变量 文本框16 : 文本框
	@布局配置([[父布局=线性布局21,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="选择贴图时的列表高度和宽度"]])
	变量 文本框22 : 文本框
	@布局配置([[父布局=相对布局5,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局27 : 线性布局
	@布局配置([[父布局=线性布局27,字体颜色=-9145228,内容="80"]])
	变量 文本框43 : 文本框
	@布局配置([[父布局=线性布局27,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框5 : 图片框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局6 : 相对布局
	@布局配置([[父布局=相对布局6,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局22 : 线性布局
	@布局配置([[父布局=线性布局22,@左外边距DP=10,字体颜色=-16777216,内容="列表列数",粗体=真,字体大小=16]])
	变量 文本框17 : 文本框
	@布局配置([[父布局=线性布局22,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="选择贴图时列表的列数"]])
	变量 文本框23 : 文本框
	@布局配置([[父布局=相对布局6,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局28 : 线性布局
	@布局配置([[父布局=线性布局28,字体颜色=-9145228,内容="4"]])
	变量 文本框44 : 文本框
	@布局配置([[父布局=线性布局28,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框6 : 图片框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局7 : 相对布局
	@布局配置([[父布局=相对布局7,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局23 : 线性布局
	@布局配置([[父布局=线性布局23,@左外边距DP=10,字体颜色=-16777216,内容="横屏列表大小",粗体=真,字体大小=16]])
	变量 文本框18 : 文本框
	@布局配置([[父布局=线性布局23,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="横屏时选择贴图列表高度和宽度"]])
	变量 文本框24 : 文本框
	@布局配置([[父布局=相对布局7,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局29 : 线性布局
	@布局配置([[父布局=线性布局29,字体颜色=-9145228,内容="80"]])
	变量 文本框45 : 文本框
	@布局配置([[父布局=线性布局29,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框7 : 图片框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局8 : 相对布局
	@布局配置([[父布局=相对布局8,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局24 : 线性布局
	@布局配置([[父布局=线性布局24,@左外边距DP=10,字体颜色=-16777216,内容="横屏列表列数",粗体=真,字体大小=16]])
	变量 文本框19 : 文本框
	@布局配置([[父布局=线性布局24,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="横屏时选择贴图列表的列数"]])
	变量 文本框25 : 文本框
	@布局配置([[父布局=相对布局8,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局30 : 线性布局
	@布局配置([[父布局=线性布局30,字体颜色=-9145228,内容="9"]])
	变量 文本框46 : 文本框
	@布局配置([[父布局=线性布局30,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框8 : 图片框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局9 : 相对布局
	@布局配置([[父布局=相对布局9,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局25 : 线性布局
	@布局配置([[父布局=线性布局25,@左外边距DP=10,字体颜色=-16777216,内容="列表图片名称",粗体=真,字体大小=16]])
	变量 文本框20 : 文本框
	@布局配置([[父布局=线性布局25,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="选择贴图时显示列表名称"]])
	变量 文本框26 : 文本框
	@布局配置([[父布局=相对布局9,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局31 : 线性布局
	@布局配置([[父布局=线性布局31,宽度DP=55,高度DP=35,@左外边距DP=0,@右外边距DP=10]])
	变量 IOS开关1 : IOS开关
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局10 : 相对布局
	@布局配置([[父布局=相对布局10,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局26 : 线性布局
	@布局配置([[父布局=线性布局26,@左外边距DP=10,字体颜色=-16777216,内容="列表图片大小",粗体=真,字体大小=16]])
	变量 文本框21 : 文本框
	@布局配置([[父布局=线性布局26,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="选择贴图时显示列表大小"]])
	变量 文本框27 : 文本框
	@布局配置([[父布局=相对布局10,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局32 : 线性布局
	@布局配置([[父布局=线性布局32,宽度DP=55,高度DP=35,@左外边距DP=0,@右外边距DP=10]])
	变量 IOS开关2 : IOS开关
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-2,@上外边距DP=10,卡片阴影=0,圆角=5,可视=真]])
	变量 卡片布局4 : 卡片布局
	@布局配置([[父布局=卡片布局4,宽度=-1,高度=-1,背景颜色=-1,纵向布局=真]])
	变量 线性布局13 : 线性布局
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=40,对齐方式=8388627]])
	变量 线性布局14 : 线性布局
	@布局配置([[父布局=线性布局14,@左外边距DP=10,字体大小=15,字体颜色=-9671572,粗体=真,内容="语言"]])
	变量 文本框10 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局3 : 相对布局
	@布局配置([[父布局=相对布局3,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局15 : 线性布局
	@布局配置([[父布局=线性布局15,@左外边距DP=10,字体颜色=-16777216,内容="国际化语言选项",粗体=真,字体大小=16]])
	变量 文本框11 : 文本框
	@布局配置([[父布局=线性布局15,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="国际化语言的选项"]])
	变量 文本框12 : 文本框
	@布局配置([[父布局=相对布局3,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局16 : 线性布局
	@布局配置([[父布局=线性布局16,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框3 : 图片框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=55,水波纹效果=真,可视=真]])
	变量 相对布局11 : 相对布局
	@布局配置([[父布局=相对布局11,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局33 : 线性布局
	@布局配置([[父布局=线性布局33,@左外边距DP=10,字体颜色=-16777216,内容="国际预翻译",粗体=真,字体大小=16]])
	变量 文本框29 : 文本框
	@布局配置([[父布局=线性布局33,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="在打包前提前翻译好，以免打包时还要进行翻译"]])
	变量 文本框31 : 文本框
	@布局配置([[父布局=相对布局11,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局35 : 线性布局
	@布局配置([[父布局=线性布局35,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关3 : IOS开关
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=55,水波纹效果=真,可视=真]])
	变量 相对布局12 : 相对布局
	@布局配置([[父布局=相对布局12,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局34 : 线性布局
	@布局配置([[父布局=线性布局34,@左外边距DP=10,字体颜色=-16777216,内容="自动保存",粗体=真,字体大小=16]])
	变量 文本框30 : 文本框
	@布局配置([[父布局=线性布局34,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="此功能将会在代码编辑中使用"]])
	变量 文本框32 : 文本框
	@布局配置([[父布局=相对布局12,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局36 : 线性布局
	@布局配置([[父布局=线性布局36,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关3s : IOS开关
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=55,水波纹效果=真,可视=真]])
	变量 相对布局1 : 相对布局
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局5 : 线性布局
	@布局配置([[父布局=线性布局5,@左外边距DP=10,字体颜色=-16777216,内容="打开语言文本的方式",粗体=真,字体大小=16]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=线性布局5,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="打开语言文本文件的方式"]])
	变量 文本框5 : 文本框
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局7 : 线性布局
	@布局配置([[父布局=线性布局7,@左外边距DP=0,字体颜色=-9145228,@上外边距DP=0,内容="自动选择",左内边距DP=0]])
	变量 文本框42 : 文本框
	@布局配置([[父布局=线性布局7,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框2 : 图片框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=55,水波纹效果=真,可视=真]])
	变量 相对布局18 : 相对布局
	@布局配置([[父布局=相对布局18,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局6 : 线性布局
	@布局配置([[父布局=线性布局6,@左外边距DP=10,字体颜色=-16777216,内容="自动保存间隔",粗体=真,字体大小=16]])
	变量 文本框4 : 文本框
	@布局配置([[父布局=线性布局6,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="自动保存间隔，只会在代码编辑中生效"]])
	变量 文本框6 : 文本框
	@布局配置([[父布局=相对布局18,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局8 : 线性布局
	@布局配置([[父布局=线性布局8,字体颜色=-9145228,内容="5000"]])
	变量 文本框47 : 文本框
	@布局配置([[父布局=线性布局8,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框9 : 图片框
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-2,@上外边距DP=10,卡片阴影=0,圆角=5,@下外边距DP=0,可视=真]])
	变量 卡片布局5 : 卡片布局
	@布局配置([[父布局=卡片布局5,宽度=-1,高度=-1,背景颜色=-1,纵向布局=真]])
	变量 线性布局17 : 线性布局
	@布局配置([[父布局=线性布局17,宽度=-1,高度DP=40,对齐方式=8388627]])
	变量 线性布局18 : 线性布局
	@布局配置([[父布局=线性布局18,@左外边距DP=10,字体大小=15,字体颜色=-9671572,粗体=真,内容="声音 / 自定义声音"]])
	变量 文本框13 : 文本框
	@布局配置([[父布局=线性布局17,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局4 : 相对布局
	@布局配置([[父布局=相对布局4,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局19 : 线性布局
	@布局配置([[父布局=线性布局19,@左外边距DP=10,字体颜色=-16777216,内容="简写列表名",粗体=真,字体大小=16]])
	变量 文本框14 : 文本框
	@布局配置([[父布局=线性布局19,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="music/game/piano1.ogg 简写为 piano1.ogg"]])
	变量 文本框15 : 文本框
	@布局配置([[父布局=相对布局4,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局20 : 线性布局
	@布局配置([[父布局=线性布局20,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关4 : IOS开关
	@布局配置([[父布局=线性布局17,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局13 : 相对布局
	@布局配置([[父布局=相对布局13,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局37 : 线性布局
	@布局配置([[父布局=线性布局37,@左外边距DP=10,字体颜色=-16777216,内容="显示项目的数量",粗体=真,字体大小=16]])
	变量 文本框28 : 文本框
	@布局配置([[父布局=线性布局37,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="显示声音选择列表的数量"]])
	变量 文本框41 : 文本框
	@布局配置([[父布局=相对布局13,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局43 : 线性布局
	@布局配置([[父布局=线性布局43,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关5 : IOS开关
	@布局配置([[父布局=线性布局17,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局14 : 相对布局
	@布局配置([[父布局=相对布局14,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局38 : 线性布局
	@布局配置([[父布局=线性布局38,@左外边距DP=10,字体颜色=-16777216,内容="记录查找内容",粗体=真,字体大小=16]])
	变量 文本框33 : 文本框
	@布局配置([[父布局=线性布局38,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="将搜索声音ID记录进行保存，方便后面补齐"]])
	变量 文本框37 : 文本框
	@布局配置([[父布局=相对布局14,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局44 : 线性布局
	@布局配置([[父布局=线性布局44,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关6 : IOS开关
	@布局配置([[父布局=线性布局17,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局15 : 相对布局
	@布局配置([[父布局=相对布局15,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局39 : 线性布局
	@布局配置([[父布局=线性布局39,@左外边距DP=10,字体颜色=-16777216,内容="清除查找记录内容",粗体=真,字体大小=16]])
	变量 文本框34 : 文本框
	@布局配置([[父布局=线性布局39,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="将搜索声音ID记录清除"]])
	变量 文本框38 : 文本框
	@布局配置([[父布局=相对布局15,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局45 : 线性布局
	@布局配置([[父布局=线性布局45,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框15 : 图片框
	@布局配置([[父布局=线性布局17,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局16 : 相对布局
	@布局配置([[父布局=相对布局16,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局40 : 线性布局
	@布局配置([[父布局=线性布局40,@左外边距DP=10,字体颜色=-16777216,内容="保存的时候记录",粗体=真,字体大小=16]])
	变量 文本框35 : 文本框
	@布局配置([[父布局=线性布局40,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="在自定义声音中保存时，会将ID编辑框的内容进行记录"]])
	变量 文本框39 : 文本框
	@布局配置([[父布局=相对布局16,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局46 : 线性布局
	@布局配置([[父布局=线性布局46,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关7 : IOS开关
	@布局配置([[父布局=线性布局17,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局17 : 相对布局
	@布局配置([[父布局=相对布局17,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局41 : 线性布局
	@布局配置([[父布局=线性布局41,@左外边距DP=10,字体颜色=-16777216,内容="清除保存的时候记录",粗体=真,字体大小=16]])
	变量 文本框36 : 文本框
	@布局配置([[父布局=线性布局41,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="会将自定义声音，ID保存记录清除"]])
	变量 文本框40 : 文本框
	@布局配置([[父布局=相对布局17,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局47 : 线性布局
	@布局配置([[父布局=线性布局47,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框17 : 图片框
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-2,@上外边距DP=10,卡片阴影=0,圆角=5,可视=真,@下外边距DP=0]])
	变量 卡片布局2 : 卡片布局
	@布局配置([[父布局=卡片布局2,宽度=-1,高度=-1,背景颜色=-1,纵向布局=真]])
	变量 线性布局42 : 线性布局
	@布局配置([[父布局=线性布局42,宽度=-1,高度DP=40,对齐方式=8388627]])
	变量 线性布局48 : 线性布局
	@布局配置([[父布局=线性布局48,@左外边距DP=10,字体大小=15,字体颜色=-9671572,粗体=真,内容="字体"]])
	变量 文本框48 : 文本框
	@布局配置([[父布局=线性布局42,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局19 : 相对布局
	@布局配置([[父布局=相对布局19,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局49 : 线性布局
	@布局配置([[父布局=线性布局49,@左外边距DP=10,字体颜色=-16777216,内容="保存速度",粗体=真,字体大小=16]])
	变量 文本框49 : 文本框
	@布局配置([[父布局=线性布局49,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="字体保存时的进度速度，复制文件的速度"]])
	变量 文本框50 : 文本框
	@布局配置([[父布局=相对布局19,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局50 : 线性布局
	@布局配置([[父布局=线性布局50,字体颜色=-9145228,内容="50"]])
	变量 文本框51 : 文本框
	@布局配置([[父布局=线性布局50,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框4 : 图片框
	@布局配置([[父布局=线性布局42,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局20 : 相对布局
	@布局配置([[父布局=相对布局20,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局51 : 线性布局
	@布局配置([[父布局=线性布局51,@左外边距DP=10,字体颜色=-16777216,内容="自动清理缓存",粗体=真,字体大小=16]])
	变量 文本框52 : 文本框
	@布局配置([[父布局=线性布局51,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="进入字体主页，自动清除上一次的记录"]])
	变量 文本框53 : 文本框
	@布局配置([[父布局=相对布局20,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局52 : 线性布局
	@布局配置([[父布局=线性布局52,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关8 : IOS开关
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-2,@上外边距DP=10,卡片阴影=0,圆角=5,可视=真,@下外边距DP=10]])
	变量 卡片布局6 : 卡片布局
	@布局配置([[父布局=卡片布局6,宽度=-1,高度=-1,背景颜色=-1,纵向布局=真]])
	变量 线性布局53 : 线性布局
	@布局配置([[父布局=线性布局53,宽度=-1,高度DP=40,对齐方式=8388627]])
	变量 线性布局54 : 线性布局
	@布局配置([[父布局=线性布局54,@左外边距DP=10,字体大小=15,字体颜色=-9671572,粗体=真,内容="物品／迷雾"]])
	变量 文本框54 : 文本框
	@布局配置([[父布局=线性布局53,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局21 : 相对布局
	@布局配置([[父布局=相对布局21,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局55 : 线性布局
	@布局配置([[父布局=线性布局55,@左外边距DP=10,字体颜色=-16777216,内容="显示物品原键名",粗体=真,字体大小=16]])
	变量 文本框55 : 文本框
	@布局配置([[父布局=线性布局55,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="显示物品编辑页原键名"]])
	变量 文本框56 : 文本框
	@布局配置([[父布局=相对布局21,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局56 : 线性布局
	@布局配置([[父布局=线性布局56,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关9 : IOS开关
	@布局配置([[父布局=线性布局53,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局22 : 相对布局
	@布局配置([[父布局=相对布局22,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局57 : 线性布局
	@布局配置([[父布局=线性布局57,@左外边距DP=10,字体颜色=-16777216,内容="显示迷雾原键名",粗体=真,字体大小=16]])
	变量 文本框57 : 文本框
	@布局配置([[父布局=线性布局57,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="显示迷雾编辑页原键名"]])
	变量 文本框59 : 文本框
	@布局配置([[父布局=相对布局22,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局59 : 线性布局
	@布局配置([[父布局=线性布局59,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关10 : IOS开关
	@布局配置([[父布局=线性布局53,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局23 : 相对布局
	@布局配置([[父布局=相对布局23,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局58 : 线性布局
	@布局配置([[父布局=线性布局58,@左外边距DP=10,字体颜色=-16777216,内容="保存强制覆盖",粗体=真,字体大小=16]])
	变量 文本框58 : 文本框
	@布局配置([[父布局=线性布局58,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="保存时不再覆盖文件提示，直接覆盖"]])
	变量 文本框60 : 文本框
	@布局配置([[父布局=相对布局23,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局60 : 线性布局
	@布局配置([[父布局=线性布局60,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关11 : IOS开关
	@布局配置([[父布局=线性布局53,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局24 : 相对布局
	@布局配置([[父布局=相对布局24,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局61 : 线性布局
	@布局配置([[父布局=线性布局61,@左外边距DP=10,字体颜色=-16777216,内容="编辑页显示描述",粗体=真,字体大小=16]])
	变量 文本框61 : 文本框
	@布局配置([[父布局=线性布局61,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="在编辑页中的文件名旁边，显示该文件的描述"]])
	变量 文本框62 : 文本框
	@布局配置([[父布局=相对布局24,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局62 : 线性布局
	@布局配置([[父布局=线性布局62,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关12 : IOS开关

	//声明
	变量 设置_设定 : 设置_设定
	变量 设置_编辑 : 设置_编辑

	事件 设置_资源编辑器:创建完毕()
		//设置主题
		本对象.显示标题栏 = 假
		本对象.状态栏颜色 = 0XFFFFFFFF
		本对象.状态栏字体黑色 = 真
		//窗口切换动画
		播放默认切换动画(2)
		//退出按钮
		事件 图片框1:被单击()
			保存()
			关闭窗口()
		结束 事件
		事件 文本框2:被单击()
			保存()
			关闭窗口()
		结束 事件
		//设置
		文本框43.内容 = 设置_设定.获取整数("ResourceEditorListSize").到文本()
		文本框44.内容 = 设置_设定.获取整数("ResourceEditorListNumber").到文本()
		文本框45.内容 = 设置_设定.获取整数("ResourceEditorTransverseListSize").到文本()
		文本框46.内容 = 设置_设定.获取整数("ResourceEditorTransverseListNumber").到文本()
		IOS开关1.选中 = 设置_设定.获取开关("ResourceEditorListPictureName")
		IOS开关2.选中 = 设置_设定.获取开关("ResourceEditorListPictureSize")
		IOS开关3.选中 = 设置_设定.获取开关("ResourceEditorTextsPreTranslation")
		IOS开关3s.选中 = 设置_设定.获取开关("ResourceEditorTextsAutoSave")
		假如 设置_设定.获取整数("ResourceEditorTextsOpenMode")
			是 0
				文本框42.内容 = "手动选择"
			是 1
				文本框42.内容 = "列表编辑"
			是 2
				文本框42.内容 = "代码编辑"
		结束 假如
		文本框47.内容 = 设置_设定.获取整数("ResourceEditorTextsAutoSaveTime").到文本()
		IOS开关4.选中 = 设置_设定.获取开关("ResourceEditorSoundsName")
		IOS开关5.选中 = 设置_设定.获取开关("ResourceEditorSoundsDisplayQuantity")
		IOS开关6.选中 = 设置_设定.获取开关("ResourceEditorSoundsRecordSearch")
		IOS开关7.选中 = 设置_设定.获取开关("ResourceEditorCustomSoundsRecordIdSaved")
		文本框51.内容 = 设置_设定.获取整数("ResourceEditorFontsSpeed").到文本()
		IOS开关8.选中 = 设置_设定.获取开关("ResourceEditorFontsCleanCache")
		IOS开关9.选中 = 设置_设定.获取开关("ResourceEditorItemOriginalKeyName")
		IOS开关10.选中 = 设置_设定.获取开关("ResourceEditorForgsOriginalKeyName")
		IOS开关11.选中 = 设置_设定.获取开关("ResourceEditorItemForgsForceOverride")
		IOS开关12.选中 = 设置_设定.获取开关("ResourceEditorItemForgsShowDescription")
		//加载夜间模式
		如果 设置_设定.获取开关("NightMode") 则
			设置夜间模式()
		结束 如果
		//设置背景
		变量 设置相关路径 : 文本 = 设置_设定.获取文本("PersonalityBackground")
		如果 设置相关路径.替换(" ","") == "" 则
		否则
			如果 文件是否存在(设置相关路径) 则
				设置_设置.设置布局背景(本对象,滚动布局1,设置相关路径)
			结束 如果
		结束 如果
		//加载方法
		贴图设置按钮()
		语言设置按钮()
		声音设置按钮()
		字体设置按钮()
		//订阅事件
		订阅事件()
	结束 事件

	//窗口被重新启动时触发该事件
	事件 设置_资源编辑器:被重新启动()
		//窗口切换动画
		播放默认切换动画(2)
	结束 事件


	//设置功能按钮颜色
	方法 设置夜间模式()
		本对象.状态栏颜色 = 0XFF333333
		本对象.状态栏字体黑色 = 假
		线性布局2.背景颜色 = 0XFF333333
		线性布局3.背景颜色 = 0XFF222222
		卡片布局1.卡片背景颜色 = 0XFF222222
		文本框2.字体颜色 = 0XFFFFFFFF
		文本框3.字体颜色 = 0XFFFFFFFF
		图片框1.图片资源 = 其他_资源.白色返回图标
		滚动布局1.背景颜色 = 0XFF222222
		线性布局4.背景颜色 = 0XFF222222
		相对布局1.背景颜色 = 0XFF333333
		文本框1.字体颜色 = 0XFFFFFFFF
		文本框5.字体颜色 = 0XFFFFFFFF
		文本框4.字体颜色 = 0XFFFFFFFF
		文本框6.字体颜色 = 0XFFE0E0E0
		线性布局9.背景颜色 = 0XFF333333
		线性布局13.背景颜色 = 0XFF333333
		线性布局17.背景颜色 = 0XFF333333
		线性布局42.背景颜色 = 0XFF333333
		线性布局53.背景颜色 = 0XFF333333
		卡片布局3.卡片背景颜色 = 0XFF333333
		卡片布局4.卡片背景颜色 = 0XFF333333
		卡片布局5.卡片背景颜色 = 0XFF333333
		卡片布局2.卡片背景颜色 = 0XFF333333
		卡片布局6.卡片背景颜色 = 0XFF333333
		文本框7.字体颜色 = 0XFFE0E0E0
		文本框13.字体颜色 = 0XFFE0E0E0
		文本框10.字体颜色 = 0XFFE0E0E0
		文本框48.字体颜色 = 0XFFE0E0E0
		文本框8.字体颜色 = 0XFFFFFFFF
		文本框16.字体颜色 = 0XFFFFFFFF
		文本框17.字体颜色 = 0XFFFFFFFF
		文本框18.字体颜色 = 0XFFFFFFFF
		文本框19.字体颜色 = 0XFFFFFFFF
		文本框20.字体颜色 = 0XFFFFFFFF
		文本框21.字体颜色 = 0XFFFFFFFF
		文本框22.字体颜色 = 0XFFE0E0E0
		文本框23.字体颜色 = 0XFFE0E0E0
		文本框24.字体颜色 = 0XFFE0E0E0
		文本框25.字体颜色 = 0XFFE0E0E0
		文本框26.字体颜色 = 0XFFE0E0E0
		文本框27.字体颜色 = 0XFFE0E0E0
		文本框11.字体颜色 = 0XFFFFFFFF
		文本框12.字体颜色 = 0XFFE0E0E0
		文本框9.字体颜色 = 0XFFE0E0E0
		文本框14.字体颜色 = 0XFFFFFFFF
		文本框28.字体颜色 = 0XFFFFFFFF
		文本框33.字体颜色 = 0XFFFFFFFF
		文本框34.字体颜色 = 0XFFFFFFFF
		文本框35.字体颜色 = 0XFFFFFFFF
		文本框36.字体颜色 = 0XFFFFFFFF
		文本框15.字体颜色 = 0XFFE0E0E0
		文本框41.字体颜色 = 0XFFE0E0E0
		文本框37.字体颜色 = 0XFFE0E0E0
		文本框38.字体颜色 = 0XFFE0E0E0
		文本框39.字体颜色 = 0XFFE0E0E0
		文本框40.字体颜色 = 0XFFE0E0E0
		文本框29.字体颜色 = 0XFFFFFFFF
		文本框31.字体颜色 = 0XFFE0E0E0
		文本框30.字体颜色 = 0XFFFFFFFF
		文本框32.字体颜色 = 0XFFE0E0E0
		文本框42.字体颜色 = 0XFFE0E0E0
		文本框43.字体颜色 = 0XFFE0E0E0
		文本框44.字体颜色 = 0XFFE0E0E0
		文本框45.字体颜色 = 0XFFE0E0E0
		文本框46.字体颜色 = 0XFFE0E0E0
		文本框47.字体颜色 = 0XFFE0E0E0
		文本框49.字体颜色 = 0XFFFFFFFF
		文本框52.字体颜色 = 0XFFFFFFFF
		文本框50.字体颜色 = 0XFFE0E0E0
		文本框53.字体颜色 = 0XFFE0E0E0
		文本框51.字体颜色 = 0XFFE0E0E0
		文本框54.字体颜色 = 0XFFE0E0E0
		文本框55.字体颜色 = 0XFFFFFFFF
		文本框56.字体颜色 = 0XFFE0E0E0
		文本框57.字体颜色 = 0XFFFFFFFF
		文本框59.字体颜色 = 0XFFE0E0E0
		文本框58.字体颜色 = 0XFFFFFFFF
		文本框60.字体颜色 = 0XFFE0E0E0
		文本框61.字体颜色 = 0XFFFFFFFF
		文本框62.字体颜色 = 0XFFE0E0E0
	结束 方法

	//贴图
	方法 贴图设置按钮()
		//重新生成资源
		事件 相对布局2:被单击()
			如果 文件是否存在(其他_变量.数据目录 + "resource/textures/textures") 则
				如果 删除文件(其他_变量.数据目录 + "resource/textures/textures") 则
					弹出成功提示("重新生成资源生效，请重新进入资源编辑器")
				否则
					弹出错误提示("重新生成资源失败！")
				结束 如果
			结束 如果
		结束 事件
		//列表大小
		事件 相对布局5:被单击()
			设置_编辑.整数(文本框43,"列表大小","请输入整数，例如：80",35,200)
		结束 事件
		//列表列数
		事件 相对布局6:被单击()
			设置_编辑.整数(文本框44,"列表列数","请输入整数，例如：4",1,15)
		结束 事件
		//横屏列表大小
		事件 相对布局7:被单击()
			设置_编辑.整数(文本框45,"横屏列表大小","请输入整数，例如：80",35,200)
		结束 事件
		//横屏列表列数
		事件 相对布局8:被单击()
			设置_编辑.整数(文本框46,"列表列数","请输入整数，例如：9",1,20)
		结束 事件
	结束 方法

	方法 语言设置按钮()
		//国际化语言选项
		事件 相对布局3:被单击()
			切换窗口(设置_资源编辑器_国际化语言选项)
		结束 事件
		//语言文本打开方式
		事件 相对布局1:被单击()
			变量 XPopup : XPopup附着弹窗
			变量 项目 : 文本[] = {"手动选择","列表编辑","代码编辑"}
			XPopup.列表项目 = 项目
			XPopup.附着组件 = 图片框2
			XPopup.动画(XPopup动画.滑动_右上)
			XPopup.半透明(假)
			XPopup.亮色状态栏(真)
			//设置夜间模式
			如果 设置_设定.获取开关("NightMode") 则
				XPopup.暗色主题(真)
			结束 如果
			XPopup.显示()
			//选中后
			事件 XPopup:列表被单击(索引 : 整数,文本 : 文本)
				设置_设定.修改整数("ResourceEditorTextsOpenMode",索引)
				假如 索引
					是 0
						文本框42.内容 = "手动选择"
					是 1
						文本框42.内容 = "列表编辑"
					是 2
						文本框42.内容 = "代码编辑"
				结束 假如
			结束 事件
		结束 事件
		//语言缩进
		事件 相对布局18:被单击()
			设置_编辑.整数(文本框47,"自动保存间隔","默认值为：5000，尽量不要设置的太大",2000,20000)
		结束 事件
	结束 方法
	
	变量 缓存大小 : 长整数
	变量 缓存大小2 : 长整数
	方法 声音设置按钮()
		//清除搜索记录
		事件 相对布局15:被单击()
			变量 搜索文件路径 : 文本 = 其他_变量.数据目录 + "resource/sounds/search_record.txt"
			如果 文件是否存在(搜索文件路径) 则
				缓存大小 = 取文件大小(搜索文件路径)
				如果 删除文件(搜索文件路径) 则
					弹出成功通知("成功清理了" + 其他_转换.转换文件大小(缓存大小) + "的缓存")
					否则
						弹出错误通知("缓存清理失败！")
				结束 如果
				否则
					弹出通知("没有缓存，无需清理！")
			结束 如果
		结束 事件
		//清除保存记录
		事件 相对布局17:被单击()
			变量 保存文件路径 : 文本 = 其他_变量.数据目录 + "resource/sounds/save_record.txt"
			如果 文件是否存在(保存文件路径) 则
				缓存大小2 = 取文件大小(保存文件路径)
				如果 删除文件(保存文件路径) 则
					弹出成功通知("成功清理了" + 其他_转换.转换文件大小(缓存大小2) + "的缓存")
					否则
						弹出错误通知("缓存清理失败！")
				结束 如果
				否则
					弹出通知("没有缓存，无需清理！")
			结束 如果
		结束 事件
	结束 方法
	
	方法 字体设置按钮()
		//保存速度
		事件 相对布局19:被单击()
			设置_编辑.整数(文本框51,"保存速度","默认值为：50，1秒=1000",10,5000)
		结束 事件
	结束 方法

	@虚拟方法
	方法 返回键被按下()
		保存()
		父对象.返回键被按下()
	结束 方法

	//保存
	方法 保存()
		//列表大小
		设置_设定.修改整数("ResourceEditorListSize",文本框43.内容.到整数())
		//列表列数
		设置_设定.修改整数("ResourceEditorListNumber",文本框44.内容.到整数())
		//横屏列表大小
		设置_设定.修改整数("ResourceEditorTransverseListSize",文本框45.内容.到整数())
		//横屏列表列数
		设置_设定.修改整数("ResourceEditorTransverseListNumber",文本框46.内容.到整数())
		//列表图片名称
		设置_设定.修改开关("ResourceEditorListPictureName",IOS开关1.选中)
		//列表图片大小
		设置_设定.修改开关("ResourceEditorListPictureSize",IOS开关2.选中)
		//国际预翻译
		设置_设定.修改开关("ResourceEditorTextsPreTranslation",IOS开关3.选中)
		//语言自动保存
		设置_设定.修改开关("ResourceEditorTextsAutoSave",IOS开关3s.选中)
		//语言自动保存间隔
		设置_设定.修改整数("ResourceEditorTextsAutoSaveTime",文本框47.内容.到整数())
		//简写列表名
		设置_设定.修改开关("ResourceEditorSoundsName",IOS开关4.选中)
		//显示项目数量
		设置_设定.修改开关("ResourceEditorSoundsDisplayQuantity",IOS开关5.选中)
		//记录查找内容
		设置_设定.修改开关("ResourceEditorSoundsRecordSearch",IOS开关6.选中)
		//保存的时候记录ID
		设置_设定.修改开关("ResourceEditorCustomSoundsRecordIdSaved",IOS开关7.选中)
		//字体保存速度
		设置_设定.修改整数("ResourceEditorFontsSpeed",文本框51.内容.到整数())
		//字体自动清理缓存
		设置_设定.修改开关("ResourceEditorFontsCleanCache",IOS开关8.选中)
		//显示物品原键名
		设置_设定.修改开关("ResourceEditorItemOriginalKeyName",IOS开关9.选中)
		//显示迷雾原键名
		设置_设定.修改开关("ResourceEditorForgsOriginalKeyName",IOS开关10.选中)
		//物品迷雾强制覆盖原文件
		设置_设定.修改开关("ResourceEditorItemForgsForceOverride",IOS开关11.选中)
		//显示物品迷雾的文件名描述
		设置_设定.修改开关("ResourceEditorItemForgsShowDescription",IOS开关12.选中)
	结束 方法


结束 类

类 设置_资源编辑器_国际化语言选项 : 窗口

	@布局配置([[根布局=真,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=50,对齐方式=8388627,背景颜色=-1]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度DP=15,高度DP=15,图片资源="../../../../资源库/图标/back/Back_black.png",@左外边距DP=10]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局2,字体大小=15,内容="资源编辑器",字体颜色=-16777216]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局2,宽度DP=2,高度DP=12,@左外边距DP=10,卡片阴影=0,卡片背景颜色=16251129]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,背景颜色=-526087]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局2,@左外边距DP=10,粗体=真,字体大小=16,内容="国际化语言选项",字体颜色=-16777216]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局1,宽度=-1,高度=-1,完全显示=假,显示滚动条=假]])
	变量 滚动布局1 : 滚动布局
	@布局配置([[父布局=滚动布局1,宽度=-1,高度=-1,纵向布局=真,右内边距DP=10,左内边距DP=10]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-2,@上外边距DP=10,卡片阴影=0,圆角=5,可视=真,@下外边距DP=0]])
	变量 卡片布局3 : 卡片布局
	@布局配置([[父布局=卡片布局3,宽度=-1,高度=-1,背景颜色=-1,纵向布局=真]])
	变量 线性布局9 : 线性布局
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=40,对齐方式=8388627]])
	变量 线性布局10 : 线性布局
	@布局配置([[父布局=线性布局10,@左外边距DP=10,字体大小=15,字体颜色=-9671572,粗体=真,内容="国际化语言 (选择你要国际化选项)"]])
	变量 文本框7 : 文本框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局2 : 相对布局
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局11 : 线性布局
	@布局配置([[父布局=线性布局11,@左外边距DP=10,字体颜色=-16777216,内容="中文 (不可关闭)",粗体=真,字体大小=16]])
	变量 文本框8 : 文本框
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局12 : 线性布局
	@布局配置([[父布局=线性布局12,@左外边距DP=0,@右外边距DP=10,内容="",选中=真,可视=真,可用=假]])
	变量 多选框1 : 多选框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局5 : 相对布局
	@布局配置([[父布局=相对布局5,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局21 : 线性布局
	@布局配置([[父布局=线性布局21,@左外边距DP=10,字体颜色=-16777216,内容="英语",粗体=真,字体大小=16]])
	变量 文本框16 : 文本框
	@布局配置([[父布局=相对布局5,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局27 : 线性布局
	@布局配置([[父布局=线性布局27,@右外边距DP=10,内容=""]])
	变量 多选框2 : 多选框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局6 : 相对布局
	@布局配置([[父布局=相对布局6,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局22 : 线性布局
	@布局配置([[父布局=线性布局22,@左外边距DP=10,字体颜色=-16777216,内容="日语",粗体=真,字体大小=16]])
	变量 文本框17 : 文本框
	@布局配置([[父布局=相对布局6,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局28 : 线性布局
	@布局配置([[父布局=线性布局28,@右外边距DP=10,内容=""]])
	变量 多选框3 : 多选框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局7 : 相对布局
	@布局配置([[父布局=相对布局7,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局23 : 线性布局
	@布局配置([[父布局=线性布局23,@左外边距DP=10,字体颜色=-16777216,内容="韩语",粗体=真,字体大小=16]])
	变量 文本框18 : 文本框
	@布局配置([[父布局=相对布局7,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局29 : 线性布局
	@布局配置([[父布局=线性布局29,@右外边距DP=10,内容=""]])
	变量 多选框4 : 多选框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局8 : 相对布局
	@布局配置([[父布局=相对布局8,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局24 : 线性布局
	@布局配置([[父布局=线性布局24,@左外边距DP=10,字体颜色=-16777216,内容="法语",粗体=真,字体大小=16]])
	变量 文本框19 : 文本框
	@布局配置([[父布局=相对布局8,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局30 : 线性布局
	@布局配置([[父布局=线性布局30,@右外边距DP=10,内容=""]])
	变量 多选框5 : 多选框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局9 : 相对布局
	@布局配置([[父布局=相对布局9,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局25 : 线性布局
	@布局配置([[父布局=线性布局25,@左外边距DP=10,字体颜色=-16777216,内容="俄语",粗体=真,字体大小=16]])
	变量 文本框20 : 文本框
	@布局配置([[父布局=相对布局9,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局31 : 线性布局
	@布局配置([[父布局=线性布局31,@右外边距DP=10,内容=""]])
	变量 多选框6 : 多选框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局10 : 相对布局
	@布局配置([[父布局=相对布局10,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局26 : 线性布局
	@布局配置([[父布局=线性布局26,@左外边距DP=10,字体颜色=-16777216,内容="西班牙语",粗体=真,字体大小=16]])
	变量 文本框21 : 文本框
	@布局配置([[父布局=相对布局10,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局32 : 线性布局
	@布局配置([[父布局=线性布局32,@右外边距DP=10,内容=""]])
	变量 多选框7 : 多选框

	//声明
	变量 设置_设定 : 设置_设定
	变量 文本数组 : 文本集合
	变量 文本数组2 : 文本 = ""

	事件 设置_资源编辑器_国际化语言选项:创建完毕()
		//设置主题
		本对象.显示标题栏 = 假
		本对象.状态栏颜色 = 0XFFFFFFFF
		本对象.状态栏字体黑色 = 真
		//窗口切换动画
		播放默认切换动画(2)
		//退出按钮
		事件 图片框1:被单击()
			保存()
			关闭窗口()
		结束 事件
		事件 文本框2:被单击()
			保存()
			关闭窗口()
		结束 事件
		//设置
		变量 设置内容 : 文本 = 设置_设定.获取文本("ResourceEditorTextsLanguage")
		如果 设置内容 ? "en_US" 则
			多选框2.选中 = 真
		否则
			多选框2.选中 = 假
		结束 如果
		如果 设置内容 ? "ja_JP" 则
			多选框3.选中 = 真
		否则
			多选框3.选中 = 假
		结束 如果
		如果 设置内容 ? "ko_KR" 则
			多选框4.选中 = 真
		否则
			多选框4.选中 = 假
		结束 如果
		如果 设置内容 ? "fr_FR" 则
			多选框5.选中 = 真
		否则
			多选框5.选中 = 假
		结束 如果
		如果 设置内容 ? "bg_BG" 则
			多选框6.选中 = 真
		否则
			多选框6.选中 = 假
		结束 如果
		如果 设置内容 ? "es_ES" 则
			多选框7.选中 = 真
		否则
			多选框7.选中 = 假
		结束 如果
		//加载夜间模式
		如果 设置_设定.获取开关("NightMode") 则
			设置夜间模式()
		结束 如果
		//设置背景
		变量 设置相关路径 : 文本 = 设置_设定.获取文本("PersonalityBackground")
		如果 设置相关路径.替换(" ","") == "" 则
		否则
			如果 文件是否存在(设置相关路径) 则
				设置_设置.设置布局背景(本对象,滚动布局1,设置相关路径)
			结束 如果
		结束 如果
		//加载方法
		//订阅事件
		订阅事件()
	结束 事件

	//设置功能按钮颜色
	方法 设置夜间模式()
		本对象.状态栏颜色 = 0XFF333333
		本对象.状态栏字体黑色 = 假
		线性布局2.背景颜色 = 0XFF333333
		线性布局3.背景颜色 = 0XFF222222
		卡片布局1.卡片背景颜色 = 0XFF222222
		文本框2.字体颜色 = 0XFFFFFFFF
		文本框3.字体颜色 = 0XFFFFFFFF
		图片框1.图片资源 = 其他_资源.白色返回图标
		滚动布局1.背景颜色 = 0XFF222222
		线性布局4.背景颜色 = 0XFF222222
		卡片布局3.卡片背景颜色 = 0XFF333333
		线性布局9.背景颜色 = 0XFF333333
		文本框7.字体颜色 = 0XFFE0E0E0
		文本框8.字体颜色 = 0XFFFFFFFF
		文本框16.字体颜色 = 0XFFFFFFFF
		文本框17.字体颜色 = 0XFFFFFFFF
		文本框18.字体颜色 = 0XFFFFFFFF
		文本框19.字体颜色 = 0XFFFFFFFF
		文本框20.字体颜色 = 0XFFFFFFFF
		文本框21.字体颜色 = 0XFFFFFFFF
	结束 方法

	@虚拟方法
	方法 返回键被按下()
		保存()
		父对象.返回键被按下()
	结束 方法

	//保存设定
	方法 保存()
		如果 多选框1.选中 则
			文本数组.添加成员("zh_CN")
		结束 如果
		如果 多选框2.选中 则
			文本数组.添加成员("en_US")
		结束 如果
		如果 多选框3.选中 则
			文本数组.添加成员("ja_JP")
		结束 如果
		如果 多选框4.选中 则
			文本数组.添加成员("ko_KR")
		结束 如果
		如果 多选框5.选中 则
			文本数组.添加成员("fr_FR")
		结束 如果
		如果 多选框6.选中 则
			文本数组.添加成员("bg_BG")
		结束 如果
		如果 多选框7.选中 则
			文本数组.添加成员("es_ES")
		结束 如果
		循环(i, 0, 文本数组.长度)
			文本数组2 = 文本数组2 + 文本数组[i] + "|"
		结束 循环
		变量 文本数组3 : 文本 = 文本数组2.替换("es_ES|","es_ES")
		设置_设定.修改文本("ResourceEditorTextsLanguage",文本数组3)
	结束 方法

结束 类