类 设置_高级设定 : 窗口

	@布局配置([[根布局=真,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=50,对齐方式=8388627,背景颜色=-1]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度DP=15,高度DP=15,图片资源="../../../../资源库/图标/back/Back_black.png",@左外边距DP=10]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局2,字体大小=15,内容="设置",字体颜色=-16777216]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局2,宽度DP=2,高度DP=12,@左外边距DP=10,卡片阴影=0,卡片背景颜色=16251129]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,背景颜色=-526087]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局2,@左外边距DP=10,粗体=真,字体大小=16,内容="高级设定",字体颜色=-16777216]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局1,宽度=-1,高度=-1,完全显示=假,显示滚动条=假]])
	变量 滚动布局1 : 滚动布局
	@布局配置([[父布局=滚动布局1,宽度=-1,高度=-1,纵向布局=真,右内边距DP=10,左内边距DP=10]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-2,@上外边距DP=10,卡片阴影=0,圆角=5,可视=真]])
	变量 卡片布局3 : 卡片布局
	@布局配置([[父布局=卡片布局3,宽度=-1,高度=-1,背景颜色=-1,纵向布局=真]])
	变量 线性布局9 : 线性布局
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=40,对齐方式=8388627]])
	变量 线性布局10 : 线性布局
	@布局配置([[父布局=线性布局10,@左外边距DP=10,字体大小=15,字体颜色=-9671572,粗体=真,内容="基础"]])
	变量 文本框7 : 文本框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局2 : 相对布局
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局11 : 线性布局
	@布局配置([[父布局=线性布局11,@左外边距DP=10,字体颜色=-16777216,内容="手机信息",粗体=真,字体大小=16]])
	变量 文本框8 : 文本框
	@布局配置([[父布局=线性布局11,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="显示手机的相关信息"]])
	变量 文本框9 : 文本框
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局12 : 线性布局
	@布局配置([[父布局=线性布局12,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框8 : 图片框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局5 : 相对布局
	@布局配置([[父布局=相对布局5,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局21 : 线性布局
	@布局配置([[父布局=线性布局21,@左外边距DP=10,字体颜色=-16777216,内容="性能信息",粗体=真,字体大小=16]])
	变量 文本框16 : 文本框
	@布局配置([[父布局=线性布局21,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="显示手机CPU与内存等信息"]])
	变量 文本框22 : 文本框
	@布局配置([[父布局=相对布局5,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局27 : 线性布局
	@布局配置([[父布局=线性布局27,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框5 : 图片框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局6 : 相对布局
	@布局配置([[父布局=相对布局6,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局22 : 线性布局
	@布局配置([[父布局=线性布局22,@左外边距DP=10,字体颜色=-16777216,内容="硬件信息",粗体=真,字体大小=16]])
	变量 文本框17 : 文本框
	@布局配置([[父布局=线性布局22,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="显示手机内的传感器相关信息"]])
	变量 文本框23 : 文本框
	@布局配置([[父布局=相对布局6,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局28 : 线性布局
	@布局配置([[父布局=线性布局28,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框6 : 图片框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局7 : 相对布局
	@布局配置([[父布局=相对布局7,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局23 : 线性布局
	@布局配置([[父布局=线性布局23,@左外边距DP=10,字体颜色=-16777216,内容="崩溃日志",粗体=真,字体大小=16]])
	变量 文本框18 : 文本框
	@布局配置([[父布局=线性布局23,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="查看软件的崩溃日志，更好的分析问题"]])
	变量 文本框24 : 文本框
	@布局配置([[父布局=相对布局7,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局29 : 线性布局
	@布局配置([[父布局=线性布局29,字体颜色=-9145228,内容=""]])
	变量 文本框45 : 文本框
	@布局配置([[父布局=线性布局29,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框7 : 图片框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局8 : 相对布局
	@布局配置([[父布局=相对布局8,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局24 : 线性布局
	@布局配置([[父布局=线性布局24,@左外边距DP=10,字体颜色=-16777216,内容="运行日志",粗体=真,字体大小=16]])
	变量 文本框19 : 文本框
	@布局配置([[父布局=线性布局24,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="查看软件最近运行的日志，用于调试"]])
	变量 文本框25 : 文本框
	@布局配置([[父布局=相对布局8,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局30 : 线性布局
	@布局配置([[父布局=线性布局30,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框2 : 图片框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局9 : 相对布局
	@布局配置([[父布局=相对布局9,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局25 : 线性布局
	@布局配置([[父布局=线性布局25,@左外边距DP=10,字体颜色=-16777216,内容="关闭程序",粗体=真,字体大小=16]])
	变量 文本框20 : 文本框
	@布局配置([[父布局=线性布局25,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="此功能用来关闭当前程序"]])
	变量 文本框26 : 文本框
	@布局配置([[父布局=相对布局9,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局31 : 线性布局
	@布局配置([[父布局=线性布局31,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框4 : 图片框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真,可视=真]])
	变量 相对布局10 : 相对布局
	@布局配置([[父布局=相对布局10,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局26 : 线性布局
	@布局配置([[父布局=线性布局26,@左外边距DP=10,字体颜色=-16777216,内容="手动崩溃",粗体=真,字体大小=16]])
	变量 文本框21 : 文本框
	@布局配置([[父布局=线性布局26,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="用来测试崩溃日志是否生成"]])
	变量 文本框27 : 文本框
	@布局配置([[父布局=相对布局10,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局32 : 线性布局
	@布局配置([[父布局=线性布局32,字体颜色=-9145228,内容=""]])
	变量 文本框50 : 文本框
	@布局配置([[父布局=线性布局32,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框3 : 图片框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=55,水波纹效果=真,可视=真]])
	变量 相对布局20 : 相对布局
	@布局配置([[父布局=相对布局20,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局49 : 线性布局
	@布局配置([[父布局=线性布局49,@左外边距DP=10,字体颜色=-16777216,内容="申请内测",粗体=真,字体大小=16]])
	变量 文本框48 : 文本框
	@布局配置([[父布局=线性布局49,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="加入群聊来获取最新内测版"]])
	变量 文本框49 : 文本框
	@布局配置([[父布局=相对布局20,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局50 : 线性布局
	@布局配置([[父布局=线性布局50,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框10 : 图片框
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-2,@上外边距DP=10,卡片阴影=0,圆角=5,可视=真,@下外边距DP=10]])
	变量 卡片布局4 : 卡片布局
	@布局配置([[父布局=卡片布局4,宽度=-1,高度=-1,背景颜色=-1,纵向布局=真]])
	变量 线性布局13 : 线性布局
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=40,对齐方式=8388627]])
	变量 线性布局14 : 线性布局
	@布局配置([[父布局=线性布局14,@左外边距DP=10,字体大小=15,字体颜色=-9671572,粗体=真,内容="开发"]])
	变量 文本框10 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局3 : 相对布局
	@布局配置([[父布局=相对布局3,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局15 : 线性布局
	@布局配置([[父布局=线性布局15,@左外边距DP=10,字体颜色=-16777216,内容="新版本内容",粗体=真,字体大小=16]])
	变量 文本框11 : 文本框
	@布局配置([[父布局=线性布局15,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="这里用来测试新版本的内容，通常不稳定"]])
	变量 文本框12 : 文本框
	@布局配置([[父布局=相对布局3,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局16 : 线性布局
	@布局配置([[父布局=线性布局16,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框11 : 图片框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=55,水波纹效果=真,可视=真]])
	变量 相对布局11 : 相对布局
	@布局配置([[父布局=相对布局11,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局33 : 线性布局
	@布局配置([[父布局=线性布局33,@左外边距DP=10,字体颜色=-16777216,内容="开发者模式",粗体=真,字体大小=16]])
	变量 文本框29 : 文本框
	@布局配置([[父布局=线性布局33,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="这里只提供软件开发者测试时用的，内置工具"]])
	变量 文本框31 : 文本框
	@布局配置([[父布局=相对布局11,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局35 : 线性布局
	@布局配置([[父布局=线性布局35,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框12 : 图片框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=55,水波纹效果=真,可视=假]])
	变量 相对布局12 : 相对布局
	@布局配置([[父布局=相对布局12,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局34 : 线性布局
	@布局配置([[父布局=线性布局34,@左外边距DP=10,字体颜色=-16777216,内容="标题",粗体=真,字体大小=16]])
	变量 文本框30 : 文本框
	@布局配置([[父布局=线性布局34,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="标题"]])
	变量 文本框32 : 文本框
	@布局配置([[父布局=相对布局12,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局36 : 线性布局
	@布局配置([[父布局=线性布局36,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关3s : IOS开关
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=55,水波纹效果=真,可视=假]])
	变量 相对布局1 : 相对布局
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局5 : 线性布局
	@布局配置([[父布局=线性布局5,@左外边距DP=10,字体颜色=-16777216,内容="标题",粗体=真,字体大小=16]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=线性布局5,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="标题"]])
	变量 文本框5 : 文本框
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局7 : 线性布局
	@布局配置([[父布局=线性布局7,@左外边距DP=0,字体颜色=-9145228,@上外边距DP=0,内容="标题",左内边距DP=0]])
	变量 文本框42 : 文本框
	@布局配置([[父布局=线性布局7,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框2s : 图片框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=55,水波纹效果=真,可视=假]])
	变量 相对布局18 : 相对布局
	@布局配置([[父布局=相对布局18,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局6 : 线性布局
	@布局配置([[父布局=线性布局6,@左外边距DP=10,字体颜色=-16777216,内容="标题",粗体=真,字体大小=16]])
	变量 文本框4 : 文本框
	@布局配置([[父布局=线性布局6,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="标题"]])
	变量 文本框6 : 文本框
	@布局配置([[父布局=相对布局18,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局8 : 线性布局
	@布局配置([[父布局=线性布局8,字体颜色=-9145228,内容="标题"]])
	变量 文本框47 : 文本框
	@布局配置([[父布局=线性布局8,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框9 : 图片框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=55,水波纹效果=真,可视=假]])
	变量 相对布局19 : 相对布局
	@布局配置([[父布局=相对布局19,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局42 : 线性布局
	@布局配置([[父布局=线性布局42,@左外边距DP=10,字体颜色=-16777216,内容="标题",粗体=真,字体大小=16]])
	变量 文本框44 : 文本框
	@布局配置([[父布局=线性布局42,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="标题"]])
	变量 文本框46 : 文本框
	@布局配置([[父布局=相对布局19,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局48 : 线性布局
	@布局配置([[父布局=线性布局48,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关11 : IOS开关
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-2,@上外边距DP=10,卡片阴影=0,圆角=5,@下外边距DP=10,可视=假]])
	变量 卡片布局5 : 卡片布局
	@布局配置([[父布局=卡片布局5,宽度=-1,高度=-1,背景颜色=-1,纵向布局=真]])
	变量 线性布局17 : 线性布局
	@布局配置([[父布局=线性布局17,宽度=-1,高度DP=40,对齐方式=8388627]])
	变量 线性布局18 : 线性布局
	@布局配置([[父布局=线性布局18,@左外边距DP=10,字体大小=15,字体颜色=-9671572,粗体=真,内容="标题"]])
	变量 文本框13 : 文本框
	@布局配置([[父布局=线性布局17,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局4 : 相对布局
	@布局配置([[父布局=相对布局4,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局19 : 线性布局
	@布局配置([[父布局=线性布局19,@左外边距DP=10,字体颜色=-16777216,内容="标题",粗体=真,字体大小=16]])
	变量 文本框14 : 文本框
	@布局配置([[父布局=线性布局19,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="标题"]])
	变量 文本框15 : 文本框
	@布局配置([[父布局=相对布局4,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局20 : 线性布局
	@布局配置([[父布局=线性布局20,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关4 : IOS开关
	@布局配置([[父布局=线性布局17,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局13 : 相对布局
	@布局配置([[父布局=相对布局13,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局37 : 线性布局
	@布局配置([[父布局=线性布局37,@左外边距DP=10,字体颜色=-16777216,内容="标题",粗体=真,字体大小=16]])
	变量 文本框28 : 文本框
	@布局配置([[父布局=线性布局37,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="标题"]])
	变量 文本框41 : 文本框
	@布局配置([[父布局=相对布局13,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局43 : 线性布局
	@布局配置([[父布局=线性布局43,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关5 : IOS开关
	@布局配置([[父布局=线性布局17,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局14 : 相对布局
	@布局配置([[父布局=相对布局14,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局38 : 线性布局
	@布局配置([[父布局=线性布局38,@左外边距DP=10,字体颜色=-16777216,内容="标题",粗体=真,字体大小=16]])
	变量 文本框33 : 文本框
	@布局配置([[父布局=线性布局38,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="标题"]])
	变量 文本框37 : 文本框
	@布局配置([[父布局=相对布局14,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局44 : 线性布局
	@布局配置([[父布局=线性布局44,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关6 : IOS开关
	@布局配置([[父布局=线性布局17,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局15 : 相对布局
	@布局配置([[父布局=相对布局15,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局39 : 线性布局
	@布局配置([[父布局=线性布局39,@左外边距DP=10,字体颜色=-16777216,内容="标题",粗体=真,字体大小=16]])
	变量 文本框34 : 文本框
	@布局配置([[父布局=线性布局39,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="标题"]])
	变量 文本框38 : 文本框
	@布局配置([[父布局=相对布局15,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局45 : 线性布局
	@布局配置([[父布局=线性布局45,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框15 : 图片框
	@布局配置([[父布局=线性布局17,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局16 : 相对布局
	@布局配置([[父布局=相对布局16,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局40 : 线性布局
	@布局配置([[父布局=线性布局40,@左外边距DP=10,字体颜色=-16777216,内容="标题",粗体=真,字体大小=16]])
	变量 文本框35 : 文本框
	@布局配置([[父布局=线性布局40,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="标题"]])
	变量 文本框39 : 文本框
	@布局配置([[父布局=相对布局16,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局46 : 线性布局
	@布局配置([[父布局=线性布局46,宽度DP=55,高度DP=35,@右外边距DP=10]])
	变量 IOS开关7 : IOS开关
	@布局配置([[父布局=线性布局17,宽度=-1,高度DP=55,水波纹效果=真]])
	变量 相对布局17 : 相对布局
	@布局配置([[父布局=相对布局17,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局41 : 线性布局
	@布局配置([[父布局=线性布局41,@左外边距DP=10,字体颜色=-16777216,内容="标题",粗体=真,字体大小=16]])
	变量 文本框36 : 文本框
	@布局配置([[父布局=线性布局41,@左外边距DP=10,字体颜色=-9145228,@上外边距DP=3,内容="标题"]])
	变量 文本框40 : 文本框
	@布局配置([[父布局=相对布局17,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局47 : 线性布局
	@布局配置([[父布局=线性布局47,宽度DP=35,高度DP=35,@右外边距DP=10,图片资源="../../../../资源库/图标/setting/images_right_arrow.png"]])
	变量 图片框17 : 图片框

	//声明
	变量 设置_设定 : 设置_设定
	变量 设置_编辑 : 设置_编辑

	事件 设置_高级设定:创建完毕()
		//设置主题
		本对象.显示标题栏 = 假
		本对象.状态栏颜色 = 0XFFFFFFFF
		本对象.状态栏字体黑色 = 真
		//窗口切换动画
		播放默认切换动画(2)
		//退出按钮
		事件 图片框1:被单击()
			保存()
			关闭窗口()
		结束 事件
		事件 文本框2:被单击()
			保存()
			关闭窗口()
		结束 事件
		//设置
		
		//加载夜间模式
		如果 设置_设定.获取开关("NightMode") 则
			设置夜间模式()
		结束 如果
		//设置背景
		变量 设置相关路径 : 文本 = 设置_设定.获取文本("PersonalityBackground")
		如果 设置相关路径.替换(" ","") == "" 则
		否则
			如果 文件是否存在(设置相关路径) 则
				设置_设置.设置布局背景(本对象,滚动布局1,设置相关路径)
			结束 如果
		结束 如果
		//加载方法
		基础按钮事件()
		开发按钮事件()
		//订阅事件
		订阅事件()
	结束 事件

	//窗口被重新启动时触发该事件
	事件 设置_高级设定:被重新启动()
		//窗口切换动画
		播放默认切换动画(2)
	结束 事件
	
	//基础按钮区域事件
	方法 基础按钮事件()
		//手机信息
		事件 相对布局2:被单击()
			切换窗口(其他_附件_手机信息)
		结束 事件
		//性能信息
		事件 相对布局5:被单击()
			切换窗口(其他_附件_性能信息)
		结束 事件
		//硬件信息
		事件 相对布局6:被单击()
			切换窗口(其他_附件_传感器)
		结束 事件
		//崩溃日志
		事件 相对布局7:被单击()
			切换窗口(其他_附件_崩溃日志)
		结束 事件
		//运行日志
		事件 相对布局8:被单击()
			弹出通知("目前没有运行日志哦！")
		结束 事件
		//关闭程序
		事件 相对布局9:被单击()
			code finishAffinity();
		结束 事件
		//手动崩溃
		事件 相对布局10:被单击()
			code throw new RuntimeException("手动崩溃已触发！");
		结束 事件
		//申请内测
		事件 相对布局20:被单击()
			如果 打开QQ加群("913177993") 则
				否则
					弹出错误提示("打开失败！")
			结束 如果
		结束 事件
	结束 方法
	
	//开发按钮区域事件
	方法 开发按钮事件()
		//新版本内容
		事件 相对布局3:被单击()
			切换窗口(新版本内容)
		结束 事件
		//开发者模式
		事件 相对布局11:被单击()
			变量 验证弹窗 : InputDialog
			验证弹窗.初始化 = 本对象
			验证弹窗.标题 = "开发者密码"
			验证弹窗.内容 = "请输入开发者密码才可进入"
			验证弹窗.编辑框数量 = 1
			验证弹窗.按钮1 = "验证"
			验证弹窗.按钮2 = "取消"
			验证弹窗.单独编辑框样式(1,"请输入密码...")
			验证弹窗.隐藏编辑框下横条()
			验证弹窗.显示()
			事件 验证弹窗:按钮1被点击()
				变量 编辑框内容 : 文本 = 验证弹窗.获取内容(1)
				变量 MD5 : 文本 = MD5加密(编辑框内容)
				//zy1314520
				如果 MD5 == "7646275fa5ce5dfb683426088ad18381" 则
					切换窗口(开发者主页)
					否则
						验证弹窗.关闭()
						弹出错误提示("密码错误！")
				结束 如果
			结束 事件
		结束 事件
	结束 方法

	//设置功能按钮颜色
	方法 设置夜间模式()
		本对象.状态栏颜色 = 0XFF333333
		本对象.状态栏字体黑色 = 假
		线性布局2.背景颜色 = 0XFF333333
		线性布局3.背景颜色 = 0XFF222222
		卡片布局1.卡片背景颜色 = 0XFF222222
		文本框2.字体颜色 = 0XFFFFFFFF
		文本框3.字体颜色 = 0XFFFFFFFF
		图片框1.图片资源 = 其他_资源.白色返回图标
		滚动布局1.背景颜色 = 0XFF222222
		线性布局4.背景颜色 = 0XFF222222
		相对布局1.背景颜色 = 0XFF333333
		文本框1.字体颜色 = 0XFFFFFFFF
		文本框5.字体颜色 = 0XFFFFFFFF
		文本框4.字体颜色 = 0XFFFFFFFF
		文本框6.字体颜色 = 0XFFE0E0E0
		线性布局9.背景颜色 = 0XFF333333
		线性布局13.背景颜色 = 0XFF333333
		线性布局17.背景颜色 = 0XFF333333
		卡片布局3.卡片背景颜色 = 0XFF333333
		卡片布局4.卡片背景颜色 = 0XFF333333
		卡片布局5.卡片背景颜色 = 0XFF333333
		文本框7.字体颜色 = 0XFFE0E0E0
		文本框13.字体颜色 = 0XFFE0E0E0
		文本框10.字体颜色 = 0XFFE0E0E0
		文本框8.字体颜色 = 0XFFFFFFFF
		文本框16.字体颜色 = 0XFFFFFFFF
		文本框17.字体颜色 = 0XFFFFFFFF
		文本框18.字体颜色 = 0XFFFFFFFF
		文本框19.字体颜色 = 0XFFFFFFFF
		文本框20.字体颜色 = 0XFFFFFFFF
		文本框21.字体颜色 = 0XFFFFFFFF
		文本框22.字体颜色 = 0XFFE0E0E0
		文本框23.字体颜色 = 0XFFE0E0E0
		文本框24.字体颜色 = 0XFFE0E0E0
		文本框25.字体颜色 = 0XFFE0E0E0
		文本框26.字体颜色 = 0XFFE0E0E0
		文本框27.字体颜色 = 0XFFE0E0E0
		文本框11.字体颜色 = 0XFFFFFFFF
		文本框12.字体颜色 = 0XFFE0E0E0
		文本框9.字体颜色 = 0XFFE0E0E0
		文本框14.字体颜色 = 0XFFFFFFFF
		文本框28.字体颜色 = 0XFFFFFFFF
		文本框33.字体颜色 = 0XFFFFFFFF
		文本框34.字体颜色 = 0XFFFFFFFF
		文本框35.字体颜色 = 0XFFFFFFFF
		文本框36.字体颜色 = 0XFFFFFFFF
		文本框15.字体颜色 = 0XFFE0E0E0
		文本框41.字体颜色 = 0XFFE0E0E0
		文本框37.字体颜色 = 0XFFE0E0E0
		文本框38.字体颜色 = 0XFFE0E0E0
		文本框39.字体颜色 = 0XFFE0E0E0
		文本框40.字体颜色 = 0XFFE0E0E0
		文本框29.字体颜色 = 0XFFFFFFFF
		文本框31.字体颜色 = 0XFFE0E0E0
		文本框30.字体颜色 = 0XFFFFFFFF
		文本框32.字体颜色 = 0XFFE0E0E0
		文本框44.字体颜色 = 0XFFFFFFFF
		文本框42.字体颜色 = 0XFFE0E0E0
		文本框45.字体颜色 = 0XFFE0E0E0
		文本框46.字体颜色 = 0XFFE0E0E0
		文本框47.字体颜色 = 0XFFE0E0E0
		文本框50.字体颜色 = 0XFFE0E0E0
		文本框48.字体颜色 = 0XFFFFFFFF
		文本框49.字体颜色 = 0XFFE0E0E0
	结束 方法

	@虚拟方法
	方法 返回键被按下()
		保存()
		父对象.返回键被按下()
	结束 方法

	//保存
	方法 保存()
		
	结束 方法


结束 类