类 创建项目 : 窗口

	@布局配置([[根布局=真,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=50,对齐方式=8388627,背景颜色=-1]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度DP=15,高度DP=15,图片资源="../../资源库/图标/back/Back_black.png",@左外边距DP=10]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局2,字体大小=15,内容="项目",字体颜色=-16777216]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局2,宽度DP=2,高度DP=12,@左外边距DP=10,卡片阴影=0,卡片背景颜色=16251129]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,背景颜色=-526087]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局2,@左外边距DP=10,粗体=真,字体大小=16,内容="创建项目",字体颜色=-16777216]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局1,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,宽度=-1,高度=1,背景颜色=-2116889902]])
	变量 线性布局6 : 线性布局
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-1,背景颜色=-526087]])
	变量 相对布局1 : 相对布局
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1]])
	变量 线性布局5 : 线性布局
	@布局配置([[父布局=线性布局5,宽度=-1,高度=-1,圆角=40,卡片阴影=1,@上外边距DP=40]])
	变量 卡片布局2 : 卡片布局
	@布局配置([[父布局=卡片布局2,宽度=-1,高度=-1,背景颜色=-1,纵向布局=真]])
	变量 线性布局7 : 线性布局
	@布局配置([[父布局=线性布局7,宽度=-1,高度DP=45,@上外边距DP=80]])
	变量 相对布局2 : 相对布局
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局8 : 线性布局
	@布局配置([[父布局=线性布局8,@左外边距DP=15,粗体=真,字体大小=15,内容="工程类型",字体颜色=-9079435]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局9 : 线性布局
	@布局配置([[父布局=线性布局9,@右外边距DP=15,高度=-1,宽度DP=200,水波纹效果=真]])
	变量 自定义下拉列表框1 : 自定义下拉列表框
	@布局配置([[父布局=线性布局7,宽度=-1,高度=-2,纵向布局=真,@上外边距DP=5]])
	变量 线性布局10 : 线性布局
	@布局配置([[父布局=线性布局10,@左外边距DP=15,粗体=真,字体大小=15,内容="工程模板",@上外边距DP=5,字体颜色=-9079435]])
	变量 文本框4 : 文本框
	@布局配置([[父布局=线性布局10,宽度=-1,高度DP=42,@上外边距DP=5,@下外边距DP=5,背景颜色=16777215]])
	变量 相对布局3 : 相对布局
	@布局配置([[父布局=相对布局3,宽度=-1,高度=-1,背景颜色=16777215]])
	变量 线性布局11 : 线性布局
	@布局配置([[父布局=线性布局11,宽度=-1,高度=-1,@左外边距DP=15,@右外边距DP=15,对齐方式=8388627,背景颜色=16777215]])
	变量 线性布局13 : 线性布局
	@布局配置([[父布局=线性布局13,@左外边距DP=8,字体颜色=-16777216,内容="默认空白模板"]])
	变量 文本框5 : 文本框
	@布局配置([[父布局=相对布局3,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局12 : 线性布局
	@布局配置([[父布局=线性布局12,高度=-1,宽度DP=80,卡片阴影=0,圆角=10,@右外边距DP=15]])
	变量 卡片布局3 : 卡片布局
	@布局配置([[父布局=卡片布局3,宽度=-1,高度=-1,对齐方式=17,背景颜色=-769226,水波纹效果=真]])
	变量 线性布局14 : 线性布局
	@布局配置([[父布局=线性布局14,字体大小=15,字体颜色=-1,内容="选择"]])
	变量 文本框6 : 文本框
	@布局配置([[父布局=线性布局7,宽度=-1,高度=-2,纵向布局=真,@上外边距DP=5]])
	变量 线性布局15 : 线性布局
	@布局配置([[父布局=线性布局15,@左外边距DP=15,粗体=真,字体大小=15,内容="工程名称",@上外边距DP=5,字体颜色=-9079435]])
	变量 文本框7 : 文本框
	@布局配置([[父布局=线性布局15,宽度=-1,高度DP=40,@左外边距DP=15,@右外边距DP=15,@上外边距DP=5,@下外边距DP=5,对齐方式=17]])
	变量 线性布局16 : 线性布局
	@布局配置([[父布局=线性布局16,宽度=-1,高度=-1,背景颜色=16777215,左内边距DP=8,右内边距DP=8,字体颜色=-16777216,字体大小=17,单行输入=真,内容="",提示文本="项目工程名称",提示文本颜色=-6381922]])
	变量 编辑框1 : 编辑框
	@布局配置([[父布局=线性布局7,宽度=-1,高度=-1,@左外边距DP=15,@右外边距DP=15,@上外边距DP=5]])
	变量 滚动布局1 : 滚动布局
	@布局配置([[父布局=滚动布局1,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局17 : 线性布局
	@布局配置([[父布局=线性布局17,宽度=-1,高度=-2,纵向布局=真]])
	变量 线性布局18 : 线性布局
	@布局配置([[父布局=线性布局18,@左外边距DP=0,粗体=真,字体大小=15,内容="项目名称",字体颜色=-9079435]])
	变量 文本框8 : 文本框
	@布局配置([[父布局=线性布局18,宽度=-1,高度DP=40,@上外边距DP=5,@下外边距DP=5,对齐方式=17]])
	变量 线性布局19 : 线性布局
	@布局配置([[父布局=线性布局19,宽度=-1,高度=-1,背景颜色=16777215,左内边距DP=8,右内边距DP=8,字体颜色=-16777216,字体大小=17,单行输入=真,内容="我的项目",提示文本="Addons的名称",提示文本颜色=-6381922]])
	变量 编辑框2 : 编辑框
	@布局配置([[父布局=线性布局17,宽度=-1,高度=-2,纵向布局=真]])
	变量 线性布局20 : 线性布局
	@布局配置([[父布局=线性布局20,粗体=真,字体大小=15,内容="项目作者",字体颜色=-9079435]])
	变量 文本框9 : 文本框
	@布局配置([[父布局=线性布局20,宽度=-1,高度DP=40,@上外边距DP=5,@下外边距DP=5,对齐方式=17]])
	变量 线性布局21 : 线性布局
	@布局配置([[父布局=线性布局21,宽度=-1,高度=-1,背景颜色=16777215,左内边距DP=8,右内边距DP=8,字体颜色=-16777216,字体大小=17,单行输入=真,提示文本="Addons的作者",内容="Addon IDE",提示文本颜色=-6381922]])
	变量 编辑框3 : 编辑框
	@布局配置([[父布局=线性布局17,宽度=-1,高度=-2,纵向布局=真]])
	变量 线性布局22 : 线性布局
	@布局配置([[父布局=线性布局22,@左外边距DP=0,粗体=真,字体大小=15,内容="项目版本",字体颜色=-9079435]])
	变量 文本框10 : 文本框
	@布局配置([[父布局=线性布局22,宽度=-1,高度DP=40,@上外边距DP=5,@下外边距DP=5,对齐方式=17]])
	变量 线性布局24 : 线性布局
	@布局配置([[父布局=线性布局24,宽度=-1,高度=-1,背景颜色=16777215,左内边距DP=8,右内边距DP=8,字体颜色=-16777216,字体大小=17,单行输入=真,提示文本="Addons版本",内容="1, 0, 0",提示文本颜色=-6381922]])
	变量 编辑框4 : 编辑框
	@布局配置([[父布局=线性布局17,宽度=-1,高度=-2,纵向布局=真]])
	变量 线性布局23 : 线性布局
	@布局配置([[父布局=线性布局23,@左外边距DP=0,粗体=真,字体大小=15,内容="项目描述",字体颜色=-9079435]])
	变量 文本框11 : 文本框
	@布局配置([[父布局=线性布局23,宽度=-1,高度DP=40,@上外边距DP=5,@下外边距DP=5,对齐方式=17]])
	变量 线性布局25 : 线性布局
	@布局配置([[父布局=线性布局25,宽度=-1,高度=-1,背景颜色=16777215,左内边距DP=8,右内边距DP=8,字体颜色=-16777216,字体大小=17,内容="我是描述 ~ ~ ~",提示文本="Addons的描述",提示文本颜色=-6381922]])
	变量 编辑框5 : 编辑框
	@布局配置([[父布局=线性布局17,宽度=-1,高度DP=50,对齐方式=17,@上外边距DP=10]])
	变量 线性布局28 : 线性布局
	@布局配置([[父布局=线性布局28,宽度=-1,高度DP=45,卡片阴影=0,圆角=80]])
	变量 卡片布局5 : 卡片布局
	@布局配置([[父布局=卡片布局5,对齐方式=17,背景颜色=-769226,宽度=-1,高度=-1,水波纹效果=真]])
	变量 创建项目按钮 : 线性布局
	@布局配置([[父布局=创建项目按钮,内容="创建",字体大小=17,字体颜色=-1]])
	变量 文本框14 : 文本框
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1,对齐方式=49,可视=真,背景颜色=16777215]])
	变量 线性布局26 : 线性布局
	@布局配置([[父布局=线性布局26,宽度DP=80,高度DP=80,圆角=35,卡片阴影=0,@上外边距DP=10,卡片背景颜色=-1]])
	变量 卡片布局4 : 卡片布局
	@布局配置([[父布局=卡片布局4,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,水波纹效果=真]])
	变量 线性布局27 : 线性布局
	@布局配置([[父布局=线性布局27,宽度DP=50,高度DP=50,图片资源="../../资源库/图标/icon.png"]])
	变量 图片框2 : 图片框

	//声明
	变量 添加项目类型 : 集合
	变量 图片选择器 : 文件选择器
	变量 UUID : UUID
	变量 设置_设定 : 设置_设定

	//变量
	变量 项目类型分类 : 整数 = 0
	变量 图片位置 : 文本 = ""
	变量 模板文件 : 文本 = "default.zip"

	事件 创建项目:创建完毕()
		//设置主题
		本对象.显示标题栏 = 假
		本对象.状态栏颜色 = 0XFFFFFFFF
		本对象.状态栏字体黑色 = 真
		//窗口切换动画
		播放默认切换动画(2)
		//退出按钮
		事件 图片框1:被单击()
			关闭窗口()
		结束 事件
		事件 文本框2:被单击()
			关闭窗口()
		结束 事件
		//加载方法
		圆角背景边框()
		工程类型()
		//设置夜间模式
		如果 设置_设定.获取开关("NightMode") 则
			设置夜间模式()
		结束 如果
		//设置背景
		变量 设置相关路径 : 文本 = 设置_设定.获取文本("PersonalityBackground")
		如果 设置相关路径.替换(" ","") == "" 则
		否则
			如果 文件是否存在(设置相关路径) 则
				设置_设置.设置布局背景(本对象,线性布局4,设置相关路径)
			结束 如果
		结束 如果
		//订阅事件
		订阅事件()
	结束 事件

	//窗口被重新启动时触发该事件
	事件 创建项目:被重新启动()
		//窗口切换动画
		播放默认切换动画(2)
	结束 事件

	//选择模板
	事件 线性布局14:被单击()
		切换窗口2(创建项目_选择模板, 1)
	结束 事件

	//圆角背景边框
	方法 圆角背景边框()
		组件样式操作.置圆角背景边框(线性布局13,0xF0FFFFFF,2,0xFFE8E8E8,5,5,5,5)
		组件样式操作.置圆角背景边框(线性布局16,0xF0FFFFFF,2,0xFFE8E8E8,5,5,5,5)
		组件样式操作.置圆角背景边框(线性布局19,0xF0FFFFFF,2,0xFFE8E8E8,5,5,5,5)
		组件样式操作.置圆角背景边框(线性布局21,0xF0FFFFFF,2,0xFFE8E8E8,5,5,5,5)
		组件样式操作.置圆角背景边框(线性布局24,0xF0FFFFFF,2,0xFFE8E8E8,5,5,5,5)
		组件样式操作.置圆角背景边框(线性布局25,0xF0FFFFFF,2,0xFFE8E8E8,5,5,5,5)
	结束 方法

	//设置功能按钮颜色
	方法 设置夜间模式()
		本对象.状态栏颜色 = 0XFF333333
		本对象.状态栏字体黑色 = 假
		线性布局2.背景颜色 = 0XFF333333
		线性布局3.背景颜色 = 0XFF222222
		卡片布局1.卡片背景颜色 = 0XFF222222
		文本框2.字体颜色 = 0XFFFFFFFF
		文本框3.字体颜色 = 0XFFFFFFFF
		图片框1.图片资源 = 其他_资源.白色返回图标
		相对布局1.背景颜色 = 0XFF222222
		线性布局7.背景颜色 = 0XFF333333
		文本框1.字体颜色 = 0XFFFFFFFF
		文本框4.字体颜色 = 0XFFFFFFFF
		文本框5.字体颜色 = 0XFFFFFFFF
		文本框7.字体颜色 = 0XFFFFFFFF
		文本框8.字体颜色 = 0XFFFFFFFF
		文本框9.字体颜色 = 0XFFFFFFFF
		文本框10.字体颜色 = 0XFFFFFFFF
		文本框11.字体颜色 = 0XFFFFFFFF
		线性布局6.背景颜色 = 0XFF333333
		滚动布局1.背景颜色 = 0XFF333333
		自定义下拉列表框1.背景颜色 = 0XFF333333
		线性布局13.背景颜色 = 0XFF333333
		线性布局16.背景颜色 = 0XFF333333
		线性布局19.背景颜色 = 0XFF333333
		线性布局21.背景颜色 = 0XFF333333
		线性布局24.背景颜色 = 0XFF333333
		线性布局25.背景颜色 = 0XFF333333
		组件样式操作.置圆角背景边框(线性布局13,0XFF333333,2,0XFF222222,5,5,5,5)
		组件样式操作.置圆角背景边框(线性布局16,0XFF333333,2,0XFF222222,5,5,5,5)
		组件样式操作.置圆角背景边框(线性布局19,0XFF333333,2,0XFF222222,5,5,5,5)
		组件样式操作.置圆角背景边框(线性布局21,0XFF333333,2,0XFF222222,5,5,5,5)
		组件样式操作.置圆角背景边框(线性布局24,0XFF333333,2,0XFF222222,5,5,5,5)
		组件样式操作.置圆角背景边框(线性布局25,0XFF333333,2,0XFF222222,5,5,5,5)
		编辑框1.字体颜色 = 0XFFFFFFFF
		编辑框2.字体颜色 = 0XFFFFFFFF
		编辑框3.字体颜色 = 0XFFFFFFFF
		编辑框4.字体颜色 = 0XFFFFFFFF
		编辑框5.字体颜色 = 0XFFFFFFFF
		卡片布局4.卡片背景颜色 = 0XFF333333
		线性布局27.背景颜色 = 0XFF333333
	结束 方法

	//工程类型选择列表
	方法 工程类型()
		//添加项目的类型
		添加项目类型.添加成员("默认项目")
		//更新列表框
		自定义下拉列表框1.更新项目(添加项目类型.长度)
		//加载下拉列表
		事件 自定义下拉列表框1:加载布局(索引 : 整数,项目布局 : 组件容器) : 组件容器
			变量 项目类型 : 创建项目_列表?
			如果 项目布局 == 空 则
				项目类型 = 创建 创建项目_列表
			否则
				项目类型 = 项目布局
			结束 如果
			项目类型.文本框1.内容 = 添加项目类型.取成员(索引)
			返回 项目类型
		结束 事件
		//列表被点击
		事件 自定义下拉列表框1:项目被选中(被单击组件 : 可视化组件,索引 : 整数)
			项目类型分类 = 索引
		结束 事件
	结束 方法

	//选择图标
	事件 线性布局27:被单击()
		图片选择器.选择图片(本对象,1234)
	结束 事件

	//代码回调(获得图标路径)
	事件 创建项目:获得返回数据(请求码 : 整数,结果码 : 整数,数据 : 启动信息)
		假如 请求码
			是 1234
				图片位置 = 图片选择器.解析图片地址(本对象,数据)
				图片框2.图片路径 = 图片位置
		结束 假如
		//获取选择模板返回信息
		如果 (请求码 == 1) 且 (结果码 == -1) 且 (数据 != 空)
			变量 name = 数据.取文本("name")
			变量 path = 数据.取文本("path")
			文本框5.内容 = name
			模板文件 = path
		结束 如果
	结束 事件

	//创建按钮
	事件 创建项目按钮:被单击()
		假如 项目类型分类
			是 0
				默认项目()
		结束 假如
	结束 事件

	//默认项目
	方法 默认项目()
		//变量
		变量 json : JSON对象 = [[{}]]
		变量 jsonversion : JSON对象 = [[{}]]
		变量 jsonmetadata : JSON对象 = [[{}]]
		变量 jsonjavascript : JSON对象 = [[{}]]
		变量 jsonuuid : JSON对象 = [[{}]]
		变量 option : JSON对象 = [[{}]]
		变量 message : JSON对象 = [[{}]]
		//获得编辑框中的属性
		变量 工程名称 = 编辑框1.内容.替换("?","")
		变量 项目名称 = 编辑框2.内容
		变量 项目作者 = 编辑框3.内容
		变量 项目版本 = 编辑框4.内容
		变量 项目描述 = 编辑框5.内容
		//获得相关属性
		变量 时间戳 : 长整数 = 取当前时间戳()
		变量 时间 : 文本 = 取格式时间("yyyy-MM-dd HH:mm:ss")
		//创建
		如果 编辑框1.内容.替换(" ","").长度<2
			弹出警告提示("内容过短!")
		否则 
			//--JSON生成--
			//基础
			json["Icon"] = 图片位置
			json["Name"] = 项目名称
			json["Author"] = 项目作者
			json["Version"] = 项目版本
			json["Describe"] = 项目描述
			json["Type"] = 添加项目类型.取成员(0).到文本()
			//版本
			jsonversion["format_version"] = "2"
			jsonversion["vanilla"] = "1, 12, 0"
			jsonversion["base_game_version"] = "1, 17, 1"
			jsonversion["min_engine_version"] = "1, 13, 1"
			//元数据
			jsonmetadata["authors"] = "Addon IDE"
			jsonmetadata["license"] = "MIT"
			jsonmetadata["url"] = "http://www.exampleurl.com"
			//generated_with子原数据
			变量 generatedwith: JSON对象 = [[{}]]
			generatedwith["example_tool"] = "【1.0.0,1.0.1】"
			变量 新对象generatedwith : JSON对象 = generatedwith
			jsonmetadata["generated_with"] = 新对象generatedwith
			//javascript Java脚本
			jsonjavascript["description"] = "实现基本启动器测试的脚本"
			jsonjavascript["type"] = "javascript"
			jsonjavascript["uuid"] = "1A1B53FC-5653-4A75-91B7-9CDF027674AE"
			jsonjavascript["version"] = "0, 0, 1"
			jsonjavascript["entry"] = "scripts/StarterTests.js"
			//UUID
			jsonuuid["uuid1"] = UUID.获取UUID()
			jsonuuid["uuid2"] = UUID.获取UUID()
			jsonuuid["uuid3"] = UUID.获取UUID()
			jsonuuid["uuid4"] = UUID.获取UUID()
			//选项设置
			option["Unicode"] = 假
			option["Dependence"] = 假
			option["JavaScript"] = 假
			option["Metadata"] = 假
			//信息
			message["construct_timestamp"] = 时间戳
			message["construct_time"] = 时间
			//设置JSON对象变量
			变量 新对象version : JSON对象 = jsonversion
			变量 新对象metadata : JSON对象 = jsonmetadata
			变量 新对象jsonjavascript : JSON对象 = jsonjavascript
			变量 新对象uuid : JSON对象 = jsonuuid
			变量 新对象option : JSON对象 = option
			变量 新对象message : JSON对象 = message
			//添加
			json["Edition"] = 新对象version
			json["Metadata"] = 新对象metadata
			json["JavaScript"] = 新对象jsonjavascript
			json["UUID"] = 新对象uuid
			json["Option"] = 新对象option
			json["Message"] = 新对象message
			变量 jsonout : 文本 = json.到文本(4)
			//输出文件
			变量 文件输出结果 : 文本 = 其他_变量.项目目录 + 工程名称 + "/"
			写出文本文件(文件输出结果 + "manifest.json",jsonout)
			//生成图标
			如果 图片位置 == "" 则
				写出资源文件(本对象,"icon.png",文件输出结果 + "icon.png")
			否则
				如果 文件是否存在(图片位置) 则
					复制文件(图片位置,文件输出结果 + "icon.png")
				否则
					弹出警告提示("此文件不存在，系统采用了默认图标")
					写出资源文件(本对象,"icon.png",文件输出结果 + "icon.png")
				结束 如果
			结束 如果
			//解压模板
			变量 模板资源路径 : 文本 = "mores/template/" + 模板文件
			变量 模板资源缓存路径 : 文本 = 其他_变量.缓存目录 + "main/template.zip"
			如果 删除文件(模板资源缓存路径) 则
			否则
				弹出错误提示("清理模板缓存失败！")
			结束 如果
			如果 写出资源文件(本对象,模板资源路径,模板资源缓存路径) 则
				如果 ZIP解压(模板资源缓存路径,文件输出结果) 则
				否则
					弹出错误提示("解压模板失败！")
				结束 如果
			否则
				弹出错误提示("将模板资源写入缓存出现的异常！")
			结束 如果
			//提示并退出
			弹出成功提示("项目创建成功！")
			关闭窗口()
		结束 如果
	结束 方法

结束 类


类 创建项目_列表 : 组件容器

	@布局配置([[根布局=真,高度=-2,宽度=-1]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度=0,背景颜色=-1,@外边距=0,高度DP=50,卡片阴影=0,圆角=0]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度DP=50,高度DP=50,对齐方式=17]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局3,宽度DP=35,高度DP=35,图片资源="../../资源库/图标/icon.png"]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局2,宽度=-1,高度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,宽度=-1,高度DP=20]])
	变量 线性布局6 : 线性布局
	@布局配置([[父布局=线性布局6,内容="分类名称",粗体=假,字体大小=16,字体颜色=-16777216]])
	变量 文本框1 : 文本框

	变量 设置_设定 : 设置_设定

	事件 创建项目_列表:创建完毕()
		//设置夜间模式
		如果 设置_设定.获取开关("NightMode") 则
			设置夜间模式()
		结束 如果
	结束 事件

	方法 设置夜间模式()
		卡片布局1.卡片背景颜色 = 0XFF333333
		线性布局2.背景颜色 = 0XFF333333
		文本框1.字体颜色 = 0XFFFFFFFF
	结束 方法

结束 类

类 创建项目_选择模板 : 窗口

	@布局配置([[根布局=真,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=50,对齐方式=8388627,背景颜色=-1]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度DP=15,高度DP=15,图片资源="../../资源库/图标/back/Back_black.png",@左外边距DP=10]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局2,字体大小=15,内容="创建项目",字体颜色=-16777216]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局2,宽度DP=2,高度DP=12,@左外边距DP=10,卡片阴影=0]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,背景颜色=-526087]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局2,@左外边距DP=10,粗体=真,字体大小=16,内容="模板选择",字体颜色=-16777216]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,@左外边距DP=10,@右外边距DP=10,背景颜色=16777215,左内边距DP=5,右内边距DP=5,字体大小=16,内容="",提示文本="查找内容..."]])
	变量 编辑框1 : 编辑框
	@布局配置([[父布局=线性布局1,宽度=-1,高度=-1]])
	变量 相对布局1 : 相对布局
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1]])
	变量 线性布局6 : 线性布局
	@布局配置([[父布局=线性布局6,宽度=-1,高度=-1,始终显示快速滚动条=真,列数=2,内边距DP=5]])
	变量 自定义宫格列表框1 : 自定义宫格列表框

	//声明
	变量 设置_设定 : 设置_设定
	变量 列表数组 : 文本集合
	变量 结束集合 : 文本集合

	//变量


	事件 创建项目_选择模板:创建完毕()
		//设置主题
		本对象.显示标题栏 = 假
		本对象.状态栏颜色 = 0XFFFFFFFF
		本对象.状态栏字体黑色 = 真
		//窗口切换动画
		播放默认切换动画(2)
		//退出按钮
		事件 图片框1:被单击()
			关闭窗口()
		结束 事件
		事件 文本框2:被单击()
			关闭窗口()
		结束 事件
		//加载方法
		变量 jsonlist : JSON数组 = 读入资源文件(本对象,"data/template.json")
		加载JSON列表(jsonlist)
		//设置夜间模式
		如果 设置_设定.获取开关("NightMode") 则
			设置夜间模式()
		结束 如果
		//设置背景
		变量 设置相关路径 : 文本 = 设置_设定.获取文本("PersonalityBackground")
		如果 设置相关路径.替换(" ","") == "" 则
		否则
			如果 文件是否存在(设置相关路径) 则
				设置_设置.设置布局背景(本对象,自定义宫格列表框1,设置相关路径)
			结束 如果
		结束 如果
		//订阅事件
		订阅事件()
	结束 事件

	方法 加载JSON列表(数组内容 : JSON数组)
		//初始化
		列表数组.清空()
		//循环
		循环(i, 0, 数组内容.长度)
			列表数组.添加成员(数组内容.取文本(i).到文本())
		结束 循环
		//加载列表
		事件 自定义宫格列表框1:加载布局(索引 : 整数,项目布局 : 组件容器) : 组件容器
			变量 布局 : 创建项目_选择模板_列表?
			如果 项目布局 == 空 则
				布局 = 创建 创建项目_选择模板_列表
			否则
				布局 = 项目布局
			结束 如果
			//设置列表内容
			变量 列表数据内容 : 文本 = 列表数组[索引]
			变量 json : JSON对象 = 列表数据内容
			设置_设置.资源目录显示图片(本对象,布局.图片框1,"icon/template/" + json["icon"].到文本())
			布局.文本框1.内容 = json["name"].到文本()
			布局.文本框2.内容 = json["author"].到文本()
			布局.文本框3.内容 = json["describe"].到文本()
			//列表被单击
			事件 布局.线性布局2:被单击()
				变量 信息 : 启动信息
				信息.置入("name", json["name"].到文本())
				信息.置入("path", json["path"].到文本())
				置返回数据(-1, 信息)
				关闭窗口()
			结束 事件
			返回 布局
		结束 事件
		//更新列表
		自定义宫格列表框1.更新项目(列表数组.长度)
		//搜索列表
		事件 编辑框1:内容被改变()
			列表数组.清空()
			循环(i, 0, 数组内容.长度)
				如果 数组内容[i].到文本() ? 编辑框1.内容 则
					列表数组.添加成员(数组内容[i].到文本())
				结束 如果
			结束 循环
			自定义宫格列表框1.更新项目(列表数组.长度)
		结束 事件
	结束 方法

	//设置功能按钮颜色
	方法 设置夜间模式()
		本对象.状态栏颜色 = 0XFF333333
		本对象.状态栏字体黑色 = 假
		线性布局2.背景颜色 = 0XFF333333
		线性布局3.背景颜色 = 0XFF222222
		卡片布局1.卡片背景颜色 = 0XFF222222
		文本框2.字体颜色 = 0XFFFFFFFF
		文本框3.字体颜色 = 0XFFFFFFFF
		编辑框1.字体颜色 = 0XFFFFFFFF
		编辑框1.提示文本颜色 = 0XFFDFDFDF
		图片框1.图片资源 = 其他_资源.白色返回图标
		自定义宫格列表框1.背景颜色 = 0XFF222222
	结束 方法

结束 类

类 创建项目_选择模板_列表 : 组件容器

	@布局配置([[根布局=真,宽度=-1,高度=-2]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=250,圆角=50,卡片阴影=0]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真,水波纹效果=真]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度DP=80,高度DP=80]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局2,对齐方式=17,@上外边距DP=5,粗体=真,字体大小=16,字体颜色=-16777216]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=线性布局2,对齐方式=17,@上外边距DP=3,字体颜色=-16777216]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局2,宽度DP=120,高度DP=60,@上外边距DP=5]])
	变量 滚动布局1 : 滚动布局
	@布局配置([[父布局=滚动布局1,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局3,@左外边距DP=5,@上外边距DP=5,@右外边距DP=5,@下外边距DP=5]])
	变量 文本框3 : 文本框

	变量 设置_设定 : 设置_设定

	事件 创建项目_选择模板_列表:创建完毕()
		//设置夜间模式
		如果 设置_设定.获取开关("NightMode") 则
			设置夜间模式()
		结束 如果
	结束 事件

	方法 设置夜间模式()
		卡片布局1.卡片背景颜色 = 0XFF333333
		线性布局2.背景颜色 = 0XFF333333
		文本框1.字体颜色 = 0XFFFFFFFF
		文本框2.字体颜色 = 0XFFFFFFFF
		文本框3.字体颜色 = 0XFFFFFFFF
	结束 方法

结束 类