类 项目管理 : 窗口

	@布局配置([[根布局=真,宽度=-1,高度=-1]])
	变量 自适应布局1 : 自适应布局
	@布局配置([[父布局=自适应布局1,宽度=-1,高度=-1,@横坐标比例=-9.0E-4,@纵坐标比例=-4.0E-4,纵向布局=真]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=50,背景颜色=-1,纵向布局=假]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度DP=50,高度DP=50,对齐方式=17]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局3,宽度DP=25,高度DP=25,水波纹效果=真,可获取焦点=真,图片资源="../../资源库/图标/back/default_backicon.png"]])
	变量 退出界面 : 图片框
	@布局配置([[父布局=线性布局2,高度DP=50,对齐方式=8388627,宽度=-1]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,字体大小=20,粗体=假,@左外边距DP=10,字体颜色=-16777216,内容="项目管理"]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=线性布局1,宽度=-1,高度=-1]])
	变量 滚动布局1 : 滚动布局
	@布局配置([[父布局=滚动布局1,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局6 : 线性布局
	@布局配置([[父布局=线性布局6,宽度=-1,高度DP=80,对齐方式=8388627]])
	变量 线性布局5 : 线性布局
	@布局配置([[父布局=线性布局5,宽度DP=65,高度DP=65,@左外边距DP=10,卡片阴影=0,圆角=15]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,对齐方式=17,背景颜色=-1]])
	变量 线性布局7 : 线性布局
	@布局配置([[父布局=线性布局7,宽度DP=45,高度DP=45,图片资源="../../资源库/图标/icon.png"]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局5,高度=-1,宽度=-1,纵向布局=真,对齐方式=8388627]])
	变量 线性布局8 : 线性布局
	@布局配置([[父布局=线性布局8,@左外边距DP=10,字体大小=20,字体颜色=-16777216,内容="项目名称"]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局8,@左外边距DP=10,@上外边距DP=5,内容="项目作者"]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局6,宽度=-1,高度DP=45,@左外边距DP=10,@右外边距DP=10,卡片阴影=0,圆角=15,可视=真]])
	变量 卡片布局2 : 卡片布局
	@布局配置([[父布局=卡片布局2,宽度=-1,高度=-1,背景颜色=-1]])
	变量 相对布局1 : 相对布局
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局9 : 线性布局
	@布局配置([[父布局=线性布局9,@左外边距DP=10,字体颜色=-16777216,内容="项目版本"]])
	变量 文本框4 : 文本框
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局10 : 线性布局
	@布局配置([[父布局=线性布局10,宽度DP=70,高度DP=30,@右外边距DP=10,卡片阴影=0,圆角=45]])
	变量 卡片布局3 : 卡片布局
	@布局配置([[父布局=卡片布局3,宽度=-1,高度=-1,对齐方式=17,背景颜色=-16735233]])
	变量 线性布局11 : 线性布局
	@布局配置([[父布局=线性布局11,内容="1, 0, 0",字体颜色=-1]])
	变量 文本框5 : 文本框
	@布局配置([[父布局=线性布局6,宽度=-1,高度DP=100,@左外边距DP=10,@右外边距DP=10,卡片阴影=0,圆角=15,@上外边距DP=10,可视=真]])
	变量 卡片布局4 : 卡片布局
	@布局配置([[父布局=卡片布局4,宽度=-1,高度=-1,纵向布局=真,背景颜色=-1]])
	变量 线性布局12 : 线性布局
	@布局配置([[父布局=线性布局12,宽度=-1,高度DP=40]])
	变量 相对布局2 : 相对布局
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局13 : 线性布局
	@布局配置([[父布局=线性布局13,@左外边距DP=10,内容="项目信息",粗体=真,字体大小=15,字体颜色=-16777216]])
	变量 文本框6 : 文本框
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局14 : 线性布局
	@布局配置([[父布局=线性布局14,@右外边距DP=10,字体大小=13,内容="刷新数据",水波纹效果=真]])
	变量 文本框7 : 文本框
	@布局配置([[父布局=线性布局12,宽度=-1,高度=-1]])
	变量 相对布局3 : 相对布局
	@布局配置([[父布局=相对布局3,宽度=-1,高度=-1]])
	变量 线性布局15 : 线性布局
	@布局配置([[父布局=线性布局15,高度=-1,宽度DP=100,对齐方式=8388627,纵向布局=真]])
	变量 线性布局16 : 线性布局
	@布局配置([[父布局=线性布局16,内容="0",粗体=真,字体颜色=-16777216,@左外边距DP=10]])
	变量 文本框8 : 文本框
	@布局配置([[父布局=线性布局16,@左外边距DP=10,内容="资源包"]])
	变量 文本框9 : 文本框
	@布局配置([[父布局=线性布局15,高度=-1,宽度DP=100,对齐方式=8388627,纵向布局=真]])
	变量 线性布局17 : 线性布局
	@布局配置([[父布局=线性布局17,内容="0",粗体=真,字体颜色=-16777216]])
	变量 文本框10 : 文本框
	@布局配置([[父布局=线性布局17,内容="行为包"]])
	变量 文本框11 : 文本框
	@布局配置([[父布局=相对布局3,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局18 : 线性布局
	@布局配置([[父布局=线性布局18,宽度DP=80,高度DP=25,圆角=15,卡片阴影=0,@右外边距DP=10]])
	变量 卡片布局5 : 卡片布局
	@布局配置([[父布局=卡片布局5,宽度=-1,高度=-1,对齐方式=17,背景颜色=-884206,水波纹效果=真]])
	变量 线性布局19 : 线性布局
	@布局配置([[父布局=线性布局19,字体颜色=-1,内容="项目管理"]])
	变量 文本框12 : 文本框
	@布局配置([[父布局=线性布局6,宽度=-1,@左外边距DP=10,@右外边距DP=10,卡片阴影=0,圆角=15,@上外边距DP=10,高度=-2,可视=真]])
	变量 卡片布局6 : 卡片布局
	@布局配置([[父布局=卡片布局6,宽度=-1,高度=-2,纵向布局=真,背景颜色=-1]])
	变量 线性布局20 : 线性布局
	@布局配置([[父布局=线性布局20,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局4 : 相对布局
	@布局配置([[父布局=相对布局4,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局21 : 线性布局
	@布局配置([[父布局=线性布局21,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/describe.xml"]])
	变量 图片框2 : 图片框
	@布局配置([[父布局=线性布局21,@左外边距DP=5,内容="项目描述",字体大小=15,字体颜色=-16777216]])
	变量 文本框13 : 文本框
	@布局配置([[父布局=相对布局4,对齐方式=8388629,宽度=-1,高度=-1,水波纹效果=真]])
	变量 线性布局22 : 线性布局
	@布局配置([[父布局=线性布局22,内容="内容",最大显示行数=2,省略显示=10,单行显示=真,显示行数=1,宽度=500,对齐方式=8388613,跑马灯效果=真]])
	变量 文本框14 : 文本框
	@布局配置([[父布局=线性布局22,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框3 : 图片框
	@布局配置([[父布局=线性布局20,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50]])
	变量 文本框15 : 文本框
	@布局配置([[父布局=线性布局20,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局5 : 相对布局
	@布局配置([[父布局=相对布局5,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局23 : 线性布局
	@布局配置([[父布局=线性布局23,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/type.xml"]])
	变量 图片框4 : 图片框
	@布局配置([[父布局=线性布局23,@左外边距DP=5,内容="项目类型",字体大小=15,字体颜色=-16777216]])
	变量 文本框16 : 文本框
	@布局配置([[父布局=相对布局5,对齐方式=8388629,宽度=-1,高度=-1,水波纹效果=真]])
	变量 线性布局24 : 线性布局
	@布局配置([[父布局=线性布局24,内容="内容",单行显示=真,宽度=200,对齐方式=8388629]])
	变量 文本框17 : 文本框
	@布局配置([[父布局=线性布局24,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框5 : 图片框
	@布局配置([[父布局=线性布局20,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50]])
	变量 文本框18 : 文本框
	@布局配置([[父布局=线性布局20,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局6 : 相对布局
	@布局配置([[父布局=相对布局6,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局25 : 线性布局
	@布局配置([[父布局=线性布局25,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/uuid.xml"]])
	变量 图片框6 : 图片框
	@布局配置([[父布局=线性布局25,@左外边距DP=5,内容="UUID",字体大小=15,字体颜色=-16777216,行距=0]])
	变量 文本框19 : 文本框
	@布局配置([[父布局=相对布局6,对齐方式=8388629,宽度=-1,高度=-1,水波纹效果=真]])
	变量 线性布局26 : 线性布局
	@布局配置([[父布局=线性布局26,内容="内容",单行显示=假,省略显示=10,跑马灯效果=真,宽度=500,@布局对齐方式=17,对齐方式=8388629,最大显示行数=1]])
	变量 文本框20 : 文本框
	@布局配置([[父布局=线性布局26,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框7 : 图片框
	@布局配置([[父布局=线性布局20,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50]])
	变量 文本框64 : 文本框
	@布局配置([[父布局=线性布局20,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局18 : 相对布局
	@布局配置([[父布局=相对布局18,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局58 : 线性布局
	@布局配置([[父布局=线性布局58,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/uuid.xml"]])
	变量 图片框36 : 图片框
	@布局配置([[父布局=线性布局58,@左外边距DP=5,内容="JS UUID",字体大小=15,字体颜色=-16777216,行距=0]])
	变量 文本框60 : 文本框
	@布局配置([[父布局=相对布局18,对齐方式=8388629,宽度=-1,高度=-1,水波纹效果=真]])
	变量 线性布局59 : 线性布局
	@布局配置([[父布局=线性布局59,内容="内容",单行显示=真,省略显示=100,跑马灯效果=真,宽度=500,对齐方式=8388629]])
	变量 文本框61 : 文本框
	@布局配置([[父布局=线性布局59,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框37 : 图片框
	@布局配置([[父布局=线性布局20,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50]])
	变量 文本框65 : 文本框
	@布局配置([[父布局=线性布局20,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局22 : 相对布局
	@布局配置([[父布局=相对布局22,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局60 : 线性布局
	@布局配置([[父布局=线性布局60,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/syntax_version.xml"]])
	变量 图片框38 : 图片框
	@布局配置([[父布局=线性布局60,@左外边距DP=5,内容="语法版本",字体大小=15,字体颜色=-16777216,行距=0]])
	变量 文本框62 : 文本框
	@布局配置([[父布局=相对布局22,对齐方式=8388629,宽度=-1,高度=-1,水波纹效果=真]])
	变量 线性布局61 : 线性布局
	@布局配置([[父布局=线性布局61,内容="内容",单行显示=真,省略显示=100,跑马灯效果=真,宽度=500,对齐方式=8388629]])
	变量 文本框63 : 文本框
	@布局配置([[父布局=线性布局61,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框39 : 图片框
	@布局配置([[父布局=线性布局20,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50]])
	变量 文本框66 : 文本框
	@布局配置([[父布局=线性布局20,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局23 : 相对布局
	@布局配置([[父布局=相对布局23,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局62 : 线性布局
	@布局配置([[父布局=线性布局62,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/game_version.xml"]])
	变量 图片框40 : 图片框
	@布局配置([[父布局=线性布局62,@左外边距DP=5,内容="游戏版本",字体大小=15,字体颜色=-16777216,行距=0]])
	变量 文本框67 : 文本框
	@布局配置([[父布局=相对布局23,对齐方式=8388629,宽度=-1,高度=-1,水波纹效果=真]])
	变量 线性布局63 : 线性布局
	@布局配置([[父布局=线性布局63,内容="内容",单行显示=真,省略显示=10,跑马灯效果=真,宽度=500,对齐方式=8388629]])
	变量 文本框68 : 文本框
	@布局配置([[父布局=线性布局63,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框41 : 图片框
	@布局配置([[父布局=线性布局6,宽度=-1,@左外边距DP=10,@右外边距DP=10,卡片阴影=0,圆角=15,@上外边距DP=10,高度=-2,可视=真]])
	变量 卡片布局7 : 卡片布局
	@布局配置([[父布局=卡片布局7,宽度=-1,高度=-2,纵向布局=真,背景颜色=-1]])
	变量 线性布局27 : 线性布局
	@布局配置([[父布局=线性布局27,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局7 : 相对布局
	@布局配置([[父布局=相对布局7,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局28 : 线性布局
	@布局配置([[父布局=线性布局28,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/manifest_config.xml"]])
	变量 图片框8 : 图片框
	@布局配置([[父布局=线性布局28,@左外边距DP=5,内容="清单配置",字体大小=15,字体颜色=-16777216]])
	变量 文本框21 : 文本框
	@布局配置([[父布局=相对布局7,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局30 : 线性布局
	@布局配置([[父布局=线性布局30,内容=""]])
	变量 文本框23 : 文本框
	@布局配置([[父布局=线性布局30,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框10 : 图片框
	@布局配置([[父布局=线性布局27,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50]])
	变量 文本框24 : 文本框
	@布局配置([[父布局=线性布局27,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局8 : 相对布局
	@布局配置([[父布局=相对布局8,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局29 : 线性布局
	@布局配置([[父布局=线性布局29,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/manifest_option.xml"]])
	变量 图片框11 : 图片框
	@布局配置([[父布局=线性布局29,@左外边距DP=5,内容="选项配置",字体大小=15,字体颜色=-16777216]])
	变量 文本框25 : 文本框
	@布局配置([[父布局=相对布局8,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局31 : 线性布局
	@布局配置([[父布局=线性布局31,内容=""]])
	变量 文本框26 : 文本框
	@布局配置([[父布局=线性布局31,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框12 : 图片框
	@布局配置([[父布局=线性布局27,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50]])
	变量 文本框40 : 文本框
	@布局配置([[父布局=线性布局27,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局15 : 相对布局
	@布局配置([[父布局=相对布局15,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局38 : 线性布局
	@布局配置([[父布局=线性布局38,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/resource_folder_preview.xml"]])
	变量 图片框17 : 图片框
	@布局配置([[父布局=线性布局38,@左外边距DP=5,内容="资源文件夹查看",字体大小=15,字体颜色=-16777216]])
	变量 文本框31 : 文本框
	@布局配置([[父布局=相对布局15,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局42 : 线性布局
	@布局配置([[父布局=线性布局42,内容=""]])
	变量 文本框34 : 文本框
	@布局配置([[父布局=线性布局42,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框21 : 图片框
	@布局配置([[父布局=线性布局27,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50]])
	变量 文本框46 : 文本框
	@布局配置([[父布局=线性布局27,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局16 : 相对布局
	@布局配置([[父布局=相对布局16,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局47 : 线性布局
	@布局配置([[父布局=线性布局47,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/behaviour_folder_preview.xml"]])
	变量 图片框26 : 图片框
	@布局配置([[父布局=线性布局47,@左外边距DP=5,内容="行为文件夹查看",字体大小=15,字体颜色=-16777216]])
	变量 文本框47 : 文本框
	@布局配置([[父布局=相对布局16,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局48 : 线性布局
	@布局配置([[父布局=线性布局48,内容=""]])
	变量 文本框48 : 文本框
	@布局配置([[父布局=线性布局48,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框27 : 图片框
	@布局配置([[父布局=线性布局27,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50,可视=假]])
	变量 文本框57 : 文本框
	@布局配置([[父布局=线性布局27,宽度=-1,高度DP=50,可视=假]])
	变量 相对布局17 : 相对布局
	@布局配置([[父布局=相对布局17,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局50 : 线性布局
	@布局配置([[父布局=线性布局50,宽度DP=25,高度DP=25,@左外边距DP=10]])
	变量 图片框28 : 图片框
	@布局配置([[父布局=线性布局50,@左外边距DP=5,内容="标题文本",字体大小=15,字体颜色=-16777216]])
	变量 文本框58 : 文本框
	@布局配置([[父布局=相对布局17,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局51 : 线性布局
	@布局配置([[父布局=线性布局51,内容=""]])
	变量 文本框59 : 文本框
	@布局配置([[父布局=线性布局51,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框29 : 图片框
	@布局配置([[父布局=线性布局6,宽度=-1,@左外边距DP=10,@右外边距DP=10,卡片阴影=0,圆角=15,@上外边距DP=10,高度=-2]])
	变量 卡片布局8 : 卡片布局
	@布局配置([[父布局=卡片布局8,宽度=-1,高度=-2,纵向布局=真,背景颜色=-1]])
	变量 线性布局32 : 线性布局
	@布局配置([[父布局=线性布局32,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局9 : 相对布局
	@布局配置([[父布局=相对布局9,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局33 : 线性布局
	@布局配置([[父布局=线性布局33,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/resource_editor.xml"]])
	变量 图片框9 : 图片框
	@布局配置([[父布局=线性布局33,@左外边距DP=5,内容="资源包编辑器",字体大小=15,字体颜色=-16777216]])
	变量 文本框22 : 文本框
	@布局配置([[父布局=相对布局9,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局34 : 线性布局
	@布局配置([[父布局=线性布局34,内容=""]])
	变量 文本框27 : 文本框
	@布局配置([[父布局=线性布局34,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框13 : 图片框
	@布局配置([[父布局=线性布局32,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50]])
	变量 文本框41 : 文本框
	@布局配置([[父布局=线性布局32,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局10 : 相对布局
	@布局配置([[父布局=相对布局10,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局35 : 线性布局
	@布局配置([[父布局=线性布局35,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/behavior_editor.xml"]])
	变量 图片框14 : 图片框
	@布局配置([[父布局=线性布局35,@左外边距DP=5,内容="行为包编辑器",字体大小=15,字体颜色=-16777216]])
	变量 文本框28 : 文本框
	@布局配置([[父布局=相对布局10,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局39 : 线性布局
	@布局配置([[父布局=线性布局39,内容=""]])
	变量 文本框35 : 文本框
	@布局配置([[父布局=线性布局39,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框18 : 图片框
	@布局配置([[父布局=线性布局32,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50]])
	变量 文本框42 : 文本框
	@布局配置([[父布局=线性布局32,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局11 : 相对布局
	@布局配置([[父布局=相对布局11,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局36 : 线性布局
	@布局配置([[父布局=线性布局36,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/code_editor.xml"]])
	变量 图片框15 : 图片框
	@布局配置([[父布局=线性布局36,内容="代码编辑器",字体大小=15,字体颜色=-16777216,@左外边距DP=5]])
	变量 文本框29 : 文本框
	@布局配置([[父布局=相对布局11,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局40 : 线性布局
	@布局配置([[父布局=线性布局40,内容=""]])
	变量 文本框32 : 文本框
	@布局配置([[父布局=线性布局40,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框19 : 图片框
	@布局配置([[父布局=线性布局32,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50,可视=真]])
	变量 文本框43 : 文本框
	@布局配置([[父布局=线性布局32,宽度=-1,高度DP=50,水波纹效果=真,可视=真]])
	变量 相对布局12 : 相对布局
	@布局配置([[父布局=相对布局12,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局37 : 线性布局
	@布局配置([[父布局=线性布局37,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/project_editor.xml"]])
	变量 图片框16 : 图片框
	@布局配置([[父布局=线性布局37,内容="项目编辑器",字体大小=15,字体颜色=-16777216,@左外边距DP=5]])
	变量 文本框30 : 文本框
	@布局配置([[父布局=相对布局12,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局41 : 线性布局
	@布局配置([[父布局=线性布局41,内容=""]])
	变量 文本框33 : 文本框
	@布局配置([[父布局=线性布局41,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框20 : 图片框
	@布局配置([[父布局=线性布局32,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50,可视=真]])
	变量 文本框44 : 文本框
	@布局配置([[父布局=线性布局32,宽度=-1,高度DP=50,水波纹效果=真,可视=真]])
	变量 相对布局13 : 相对布局
	@布局配置([[父布局=相对布局13,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局43 : 线性布局
	@布局配置([[父布局=线性布局43,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/function_editor.xml"]])
	变量 图片框22 : 图片框
	@布局配置([[父布局=线性布局43,内容="函数编辑器",字体大小=15,字体颜色=-16777216,@左外边距DP=5]])
	变量 文本框36 : 文本框
	@布局配置([[父布局=相对布局13,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局44 : 线性布局
	@布局配置([[父布局=线性布局44,内容=""]])
	变量 文本框37 : 文本框
	@布局配置([[父布局=线性布局44,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框23 : 图片框
	@布局配置([[父布局=线性布局32,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50,可视=假]])
	变量 文本框45 : 文本框
	@布局配置([[父布局=线性布局32,宽度=-1,高度DP=50,可视=假]])
	变量 相对布局14 : 相对布局
	@布局配置([[父布局=相对布局14,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局45 : 线性布局
	@布局配置([[父布局=线性布局45,宽度DP=25,高度DP=25,@左外边距DP=10]])
	变量 图片框24 : 图片框
	@布局配置([[父布局=线性布局45,内容="标题文本",字体大小=15,字体颜色=-16777216,@左外边距DP=5]])
	变量 文本框38 : 文本框
	@布局配置([[父布局=相对布局14,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局46 : 线性布局
	@布局配置([[父布局=线性布局46,内容=""]])
	变量 文本框39 : 文本框
	@布局配置([[父布局=线性布局46,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框25 : 图片框
	@布局配置([[父布局=线性布局6,宽度=-1,@左外边距DP=10,@右外边距DP=10,卡片阴影=0,圆角=15,@上外边距DP=10,高度=-2,@下外边距DP=15]])
	变量 卡片布局10 : 卡片布局
	@布局配置([[父布局=卡片布局10,宽度=-1,高度=-2,纵向布局=真,背景颜色=-1]])
	变量 线性布局64 : 线性布局
	@布局配置([[父布局=线性布局64,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局24 : 相对布局
	@布局配置([[父布局=相对布局24,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局65 : 线性布局
	@布局配置([[父布局=线性布局65,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/run.xml"]])
	变量 图片框42 : 图片框
	@布局配置([[父布局=线性布局65,内容="运行项目",字体大小=15,字体颜色=-16777216,@左外边距DP=5]])
	变量 文本框69 : 文本框
	@布局配置([[父布局=相对布局24,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局66 : 线性布局
	@布局配置([[父布局=线性布局66,内容=""]])
	变量 文本框70 : 文本框
	@布局配置([[父布局=线性布局66,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框43 : 图片框
	@布局配置([[父布局=线性布局64,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50]])
	变量 文本框71 : 文本框
	@布局配置([[父布局=线性布局64,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局25 : 相对布局
	@布局配置([[父布局=相对布局25,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局67 : 线性布局
	@布局配置([[父布局=线性布局67,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/pack.xml"]])
	变量 图片框44 : 图片框
	@布局配置([[父布局=线性布局67,内容="打包项目",字体大小=15,字体颜色=-16777216,@左外边距DP=5]])
	变量 文本框74 : 文本框
	@布局配置([[父布局=相对布局25,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局72 : 线性布局
	@布局配置([[父布局=线性布局72,内容=""]])
	变量 文本框77 : 文本框
	@布局配置([[父布局=线性布局72,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框49 : 图片框
	@布局配置([[父布局=线性布局64,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50]])
	变量 文本框73 : 文本框
	@布局配置([[父布局=线性布局64,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局26 : 相对布局
	@布局配置([[父布局=相对布局26,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局68 : 线性布局
	@布局配置([[父布局=线性布局68,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/global_run.xml"]])
	变量 图片框45 : 图片框
	@布局配置([[父布局=线性布局68,内容="全局资源",字体大小=15,字体颜色=-16777216,@左外边距DP=5]])
	变量 文本框75 : 文本框
	@布局配置([[父布局=相对布局26,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局71 : 线性布局
	@布局配置([[父布局=线性布局71,内容=""]])
	变量 文本框78 : 文本框
	@布局配置([[父布局=线性布局71,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框48 : 图片框
	@布局配置([[父布局=线性布局64,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50]])
	变量 文本框72 : 文本框
	@布局配置([[父布局=线性布局64,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局27 : 相对布局
	@布局配置([[父布局=相对布局27,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局69 : 线性布局
	@布局配置([[父布局=线性布局69,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/import.xml"]])
	变量 图片框46 : 图片框
	@布局配置([[父布局=线性布局69,内容="导入游戏",字体大小=15,字体颜色=-16777216,@左外边距DP=5]])
	变量 文本框76 : 文本框
	@布局配置([[父布局=相对布局27,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局70 : 线性布局
	@布局配置([[父布局=线性布局70,内容=""]])
	变量 文本框79 : 文本框
	@布局配置([[父布局=线性布局70,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框47 : 图片框
	@布局配置([[父布局=线性布局6,宽度=-1,@左外边距DP=10,@右外边距DP=10,卡片阴影=0,圆角=15,@上外边距DP=10,高度=-2,@下外边距DP=15]])
	变量 卡片布局9 : 卡片布局
	@布局配置([[父布局=卡片布局9,宽度=-1,高度=-2,纵向布局=真,背景颜色=-1]])
	变量 线性布局49 : 线性布局
	@布局配置([[父布局=线性布局49,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局19 : 相对布局
	@布局配置([[父布局=相对布局19,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局52 : 线性布局
	@布局配置([[父布局=线性布局52,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/backup.xml"]])
	变量 图片框30 : 图片框
	@布局配置([[父布局=线性布局52,内容="备份项目",字体大小=15,字体颜色=-16777216,@左外边距DP=5]])
	变量 文本框51 : 文本框
	@布局配置([[父布局=相对布局19,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局53 : 线性布局
	@布局配置([[父布局=线性布局53,内容=""]])
	变量 文本框52 : 文本框
	@布局配置([[父布局=线性布局53,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框31 : 图片框
	@布局配置([[父布局=线性布局49,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50]])
	变量 文本框49 : 文本框
	@布局配置([[父布局=线性布局49,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局20 : 相对布局
	@布局配置([[父布局=相对布局20,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局54 : 线性布局
	@布局配置([[父布局=线性布局54,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/share.xml"]])
	变量 图片框32 : 图片框
	@布局配置([[父布局=线性布局54,内容="分享项目",字体大小=15,字体颜色=-16777216,@左外边距DP=5]])
	变量 文本框53 : 文本框
	@布局配置([[父布局=相对布局20,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局57 : 线性布局
	@布局配置([[父布局=线性布局57,内容=""]])
	变量 文本框56 : 文本框
	@布局配置([[父布局=线性布局57,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框35 : 图片框
	@布局配置([[父布局=线性布局49,背景颜色=-855310,宽度=-1,高度=3,内容="",@左外边距DP=50,@右外边距DP=50]])
	变量 文本框50 : 文本框
	@布局配置([[父布局=线性布局49,宽度=-1,高度DP=50,水波纹效果=真]])
	变量 相对布局21 : 相对布局
	@布局配置([[父布局=相对布局21,对齐方式=8388627,宽度=-1,高度=-1]])
	变量 线性布局55 : 线性布局
	@布局配置([[父布局=线性布局55,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../资源库/图标/management/delete.xml"]])
	变量 图片框33 : 图片框
	@布局配置([[父布局=线性布局55,内容="删除项目",字体大小=15,字体颜色=-16777216,@左外边距DP=5]])
	变量 文本框54 : 文本框
	@布局配置([[父布局=相对布局21,对齐方式=8388629,宽度=-1,高度=-1]])
	变量 线性布局56 : 线性布局
	@布局配置([[父布局=线性布局56,内容=""]])
	变量 文本框55 : 文本框
	@布局配置([[父布局=线性布局56,宽度DP=20,高度DP=20,图片资源="../../资源库/图标/management/front.png",@右外边距DP=10]])
	变量 图片框34 : 图片框

	//声明
	变量 设置_设定 : 设置_设定
	变量 信息 : 启动信息

	//变量
	变量 项目名称 : 文本
	变量 是否打包 : 逻辑型 = 假

	事件 项目管理:创建完毕()
		//设置主题
		本对象.显示标题栏 = 假
		本对象.状态栏颜色 = 0XFFFFFFFF
		本对象.状态栏字体黑色 = 真
		//窗口切换动画
		播放默认切换动画(2)
		//加载退出按钮事件
		事件 退出界面:被单击()
			关闭窗口()
		结束 事件
		//获取项目名称
		变量 信息 : 启动信息 = 取启动信息()
		项目名称 = 信息.取文本("项目名称")
		//设置夜间模式
		如果 设置_设定.获取开关("NightMode") 则
			设置夜间模式()
		结束 如果
		//设置背景
		变量 设置相关路径 : 文本 = 设置_设定.获取文本("PersonalityBackground")
		如果 设置相关路径.替换(" ","") == "" 则
		否则
			如果 文件是否存在(设置相关路径) 则
				设置_设置.设置布局背景(本对象,线性布局6,设置相关路径)
			结束 如果
		结束 如果
		//是否自动备份
		如果 设置_设定.获取开关("BasicAutomaticBackup") 则
			变量 项目路径 : 文本 = 其他_变量.项目目录 + 项目名称
			如果 压缩操作.ZIP压缩(项目路径,其他_变量.备份目录 + 项目名称 + ".mcides") 则
				弹出成功提示("备份成功")
				文本框55.内容 = "请确保你已经自动备份了"
				文本框52.内容 = "最近:" + 取文件修改时间(其他_变量.备份目录 + 项目名称 + ".mcides")
			否则
				弹出错误提示("备份失败")
				文本框52.内容 = "备份失败!"
			结束 如果
		结束 如果
		//加载方法
		项目信息区域按钮事件()
		项目属性区域按钮事件()
		项目管理区域按钮事件()
		项目编辑器区域按钮事件()
		项目构建区域按钮事件()
		项目操作区域按钮事件()
		读取清单文件()
		//订阅事件
		订阅事件()
	结束 事件

	/*
	窗口被重新启动时触发该事件
	*/
	事件 项目管理:被重新启动()
		//刷新
		读取清单文件()
		//窗口切换动画
		播放默认切换动画(2)
		//设置是否打包
		是否打包 = 假
	结束 事件

	//项目信息区域按钮事件
	方法 项目信息区域按钮事件()
		//刷新数据
		事件 文本框7:被单击()
			读取清单文件()
		结束 事件
		//统计资源包和行为包数量
		变量 功能 : 其他_功能
		变量 R :文本 = 其他_变量.项目目录 + 项目名称 + "/resource"
		变量 B :文本 = 其他_变量.项目目录 + 项目名称 + "/behaviour"
		如果 文件是否存在(R) 则
			文本框8.内容 = 功能.统计文件夹内文件数量(R).到文本()
		结束 如果
		如果 文件是否存在(B) 则
			文本框10.内容 = 功能.统计文件夹内文件数量(B).到文本()
		结束 如果
		//查看项目管理
		事件 线性布局19:被单击()
			切换窗口(项目管理_项目管理)
		结束 事件
	结束 方法

	//项目属性区域按钮事件
	方法 项目属性区域按钮事件()
		//项目描述
		事件 相对布局4:被单击()
			变量 消息 : DX基础对话框
			消息.标题("描述")
			如果 设置_设定.获取开关("NightMode") 则
				消息.主题(DX主题.暗色)
			结束 如果
			消息.样式(DX样式.MIUI)
			消息.内容(文本框14.内容)
			消息.按钮1("关闭")
			消息.可取消(真)
			消息.显示()
		结束 事件
		//项目类型
		事件 相对布局5:被单击()
			变量 消息 : DX基础对话框
			消息.标题("类型")
			如果 设置_设定.获取开关("NightMode") 则
				消息.主题(DX主题.暗色)
			结束 如果
			消息.样式(DX样式.MIUI)
			消息.内容(文本框17.内容)
			消息.按钮1("关闭")
			消息.可取消(真)
			消息.显示()
		结束 事件
		//项目UUID
		事件 相对布局6:被单击()
			变量 消息 : DX基础对话框
			消息.标题("UUID")
			如果 设置_设定.获取开关("NightMode") 则
				消息.主题(DX主题.暗色)
			结束 如果
			消息.样式(DX样式.MIUI)
			消息.内容(文本框20.内容)
			消息.按钮1("关闭")
			消息.可取消(真)
			消息.显示()
		结束 事件
		//项目JS UUID
		事件 相对布局18:被单击()
			变量 消息 : DX基础对话框
			消息.标题("JavaScript UUID")
			如果 设置_设定.获取开关("NightMode") 则
				消息.主题(DX主题.暗色)
			结束 如果
			消息.样式(DX样式.MIUI)
			消息.内容(文本框61.内容)
			消息.按钮1("关闭")
			消息.可取消(真)
			消息.显示()
		结束 事件
		//项目语法版本
		事件 相对布局22:被单击()
			变量 消息 : DX基础对话框
			消息.标题("语法版本")
			如果 设置_设定.获取开关("NightMode") 则
				消息.主题(DX主题.暗色)
			结束 如果
			消息.样式(DX样式.MIUI)
			消息.内容("语法版本: " + 文本框63.内容 + "\n语法版本对应表:\n皮肤包: 1\n附加包: 2")
			消息.按钮1("关闭")
			消息.可取消(真)
			消息.显示()
		结束 事件
		//项目游戏版本
		事件 相对布局23:被单击()
			变量 项目属性游戏版本 : 文本 = 文本框68.内容
			变量 项目属性游戏版本A : 文本 = 项目属性游戏版本.截取文本("原版:[","] 基")
			变量 项目属性游戏版本B : 文本 = 项目属性游戏版本.截取文本("础版本:[","] 最低引擎")
			变量 项目属性游戏版本C : 文本 = 项目属性游戏版本.截取文本("引擎版本:[","]")
			变量 项目属性游戏版本S : 文本 = "原版:" + 项目属性游戏版本A + "\n基础版本:" + 项目属性游戏版本B + "\n最低引擎版本:" + 项目属性游戏版本C
			变量 消息 : DX基础对话框
			消息.标题("游戏版本")
			如果 设置_设定.获取开关("NightMode") 则
				消息.主题(DX主题.暗色)
			结束 如果
			消息.样式(DX样式.MIUI)
			消息.内容(项目属性游戏版本S)
			消息.按钮1("关闭")
			消息.可取消(真)
			消息.显示()
		结束 事件
	结束 方法

	//项目管理区域按钮事件
	方法 项目管理区域按钮事件()
		//清单编辑
		事件 相对布局7:被单击()
			变量 信息2 : 启动信息
			信息2.置入("项目名称",项目名称)
			切换窗口(项目管理_清单编辑,信息2)
		结束 事件
		//清单设定
		事件 相对布局8:被单击()
			其他_其他.写缓存("ProjectName",项目名称)
			切换窗口(项目管理_清单设定)
		结束 事件
		//资源包查看
		事件 相对布局15:被单击()
			变量 项目路径R : 文本 = 其他_变量.项目目录 + 项目名称 + "/resource"
			其他_其他.写缓存("ProjectFolderView",项目路径R)
			切换窗口(项目管理_文件管理)
		结束 事件
		//行为包查看
		事件 相对布局16:被单击()
			变量 项目路径B : 文本 = 其他_变量.项目目录 + 项目名称 + "/behaviour"
			其他_其他.写缓存("ProjectFolderView",项目路径B)
			切换窗口(项目管理_文件管理)
		结束 事件
	结束 方法

	//项目编辑器区域按钮事件
	方法 项目编辑器区域按钮事件()
		//资源编辑器
		事件 相对布局9:被单击()
			切换窗口(编辑器_资源编辑器_主页)
		结束 事件
		//行为编辑器
		事件 相对布局10:被单击()
			切换窗口(编辑器_行为编辑器_主页)
		结束 事件
		//代码编辑器
		事件 相对布局11:被单击()
			切换窗口(编辑器_代码编辑器_主页)
		结束 事件
		//项目编辑器
		事件 相对布局12:被单击()
			切换窗口(编辑器_项目编辑器_主页)
		结束 事件
		//函数编辑器
		事件 相对布局13:被单击()
			切换窗口(编辑器_函数编辑器_主页)
		结束 事件
	结束 方法

	//项目构建区域按钮事件
	方法 项目构建区域按钮事件()
		//运行
		事件 相对布局24:被单击()
			如果 是否打包 则
				变量 模块_运行 : 模块_运行
				模块_运行.检测()
			否则
				弹出警告提示("请提前打包！")
			结束 如果
		结束 事件
		//打包
		事件 相对布局25:被单击()
			变量 模块_打包 : 模块_打包
			模块_打包.开始()
			是否打包 = 真
		结束 事件
		//全局资源
		事件 相对布局26:被单击()
			如果 是否打包 则
				变量 模块_全局资源 : 模块_全局资源
				模块_全局资源.检测()
			否则
				弹出警告提示("请提前打包！")
			结束 如果
		结束 事件
		//导入
		事件 相对布局27:被单击()
			变量 项目路径 : 文本 = 其他_变量.项目目录 + 项目名称 + "/bin/" + 项目名称
			变量 模块_导入 : 模块_导入
			模块_导入.导入(项目路径)
		结束 事件
	结束 方法

	//项目操作区域按钮事件
	方法 项目操作区域按钮事件()
		变量 项目路径 : 文本 = 其他_变量.项目目录 + 项目名称
		//检查
		如果 文件是否存在(其他_变量.备份目录 + 项目名称 + ".mcides") 则
			文本框52.内容 = "上次:" + 取文件修改时间(其他_变量.备份目录 + 项目名称 + ".mcides")
			文本框55.内容 = "请确保你已经备份了"
		否则
			文本框52.内容 = "没有最近的备份记录"
			文本框55.内容 = "检测到你的项目没有备份"
		结束 如果
		如果 文件是否存在(其他_变量.缓存目录 + "shares/" + 项目名称 + ".mcides") 则
			文本框56.内容 = "上次于" + 取文件修改时间(其他_变量.缓存目录 + "shares/" + 项目名称 + ".mcides") + "时分享"
		否则
			文本框56.内容 = "没有任何的分享记录!"
		结束 如果
		//备份
		事件 相对布局19:被单击()
			如果 压缩操作.ZIP压缩(项目路径,其他_变量.备份目录 + 项目名称 + ".mcides") 则
				弹出成功提示("备份成功")
				文本框55.内容 = "请确保你已经备份了"
				文本框52.内容 = "最近:" + 取文件修改时间(其他_变量.备份目录 + 项目名称 + ".mcides")
			否则
				弹出错误提示("备份失败")
				文本框52.内容 = "备份失败!"
			结束 如果
		结束 事件
		//分享
		事件 相对布局20:被单击()
			写出文本文件(其他_变量.缓存目录 + "shares/null","")
			删除文件(其他_变量.缓存目录 + "shares/null")
			如果 压缩操作.ZIP压缩(项目路径,其他_变量.缓存目录 + "shares/" + 项目名称 + ".mcides") 则
				文本框56.内容 = 取文件修改时间(其他_变量.缓存目录 + "shares/" + 项目名称 + ".mcides") + "时分享"
				分享操作.分享文件(本对象,其他_变量.缓存目录 + "shares/" + 项目名称 + ".mcides")
			否则
				弹出错误提示("尝试分享失败")
			结束 如果
		结束 事件
		//删除
		事件 相对布局21:被单击()
			变量 删除提示 : DX基础对话框
			如果 设置_设定.获取开关("NightMode") 则
				删除提示.主题(DX主题.暗色)
			结束 如果
			删除提示.标题("删除")
			删除提示.内容("删除该项目?\n" + 项目名称)
			删除提示.按钮1("确定")
			删除提示.按钮2("取消")
			事件 删除提示:按钮1被单击() : 逻辑型
				如果 文件操作.删除文件(项目路径) 则
					弹出成功提示("删除项目成功")
					关闭窗口()
				否则
					弹出错误提示("删除项目失败")
				结束 如果
				返回 假
			结束 事件
			删除提示.显示()
		结束 事件
	结束 方法

	//读取清单文件
	方法 读取清单文件()
		//变量
		变量 图标文件 : 文本 = 其他_变量.项目目录 + 项目名称 + "/icon.png"
		变量 清单文件 : 文本 = 其他_变量.项目目录 + 项目名称 + "/manifest.json"
		//设置图标
		图片框1.图片路径 = 图标文件
		//读取清单文件
		变量 清单文件内容 : 文本 = 文件操作.读入文本文件(清单文件,"UTF-8")
		变量 json清单文件内容 : JSON对象 = 清单文件内容
		//获取设置基本json属性
		文本框2.内容 = json清单文件内容["Name"].到文本()
		文本框3.内容 = json清单文件内容["Author"].到文本()
		文本框5.内容 = json清单文件内容["Version"].到文本()
		文本框14.内容 = json清单文件内容["Describe"].到文本()
		文本框17.内容 = json清单文件内容["Type"].到文本()
		//获得设置UUIDjson属性
		变量 json清单文件内容UUID : JSON对象 = json清单文件内容["UUID"].到文本()
		变量 json清单文件内容UUID1 : 文本 = json清单文件内容UUID["uuid1"].到文本()
		变量 json清单文件内容UUID2 : 文本 = json清单文件内容UUID["uuid2"].到文本()
		变量 json清单文件内容UUID3 : 文本 = json清单文件内容UUID["uuid3"].到文本()
		变量 json清单文件内容UUID4 : 文本 = json清单文件内容UUID["uuid4"].到文本()
		变量 json清单文件内容UUID集合 : 文本 = "资源包UUID主:" + json清单文件内容UUID1 + "\n资源包UUID副:" + json清单文件内容UUID2 + "\n行为包UUID主:" + json清单文件内容UUID3 + "\n行为包UUID副:" + json清单文件内容UUID4
		文本框20.内容 = json清单文件内容UUID集合
		//获得设置JSUUID
		变量 json清单文件内容JSUUID : JSON对象 = json清单文件内容["JavaScript"].到文本()
		变量 json清单文件内容JSUUIDS : 文本 = json清单文件内容JSUUID["uuid"].到文本()
		文本框61.内容 = json清单文件内容JSUUIDS
		//游戏版本
		变量 json清单文件内容Edition : JSON对象 = json清单文件内容["Edition"].到文本()
		变量 json清单文件内容Edition1 : 文本 = json清单文件内容Edition["format_version"].到文本()
		文本框63.内容 = json清单文件内容Edition1
		变量 json清单文件内容Edition2 : 文本 = json清单文件内容Edition["vanilla"].到文本()
		变量 json清单文件内容Edition3 : 文本 = json清单文件内容Edition["base_game_version"].到文本()
		变量 json清单文件内容Edition4 : 文本 = json清单文件内容Edition["min_engine_version"].到文本()
		变量 json清单文件内容Edition集合 : 文本 = "原版:[" + json清单文件内容Edition2 + "] 基础版本:[" + json清单文件内容Edition3 + "] 最低引擎版本:[" + json清单文件内容Edition4 + "]"
		文本框68.内容 = json清单文件内容Edition集合
	结束 方法

	//设置功能按钮颜色
	方法 设置夜间模式()
		本对象.状态栏颜色 = 0XFF333333
		本对象.状态栏字体黑色 = 假
		线性布局2.背景颜色 = 0XFF333333
		文本框1.字体颜色 = 0XFFFFFFFF
		退出界面.图片资源 = 项目管理_资源.白色返回
		线性布局6.背景颜色 = 0XFF222222
		线性布局7.背景颜色 = 0XFF333333
		文本框2.字体颜色 = 0XFFFFFFFF
		文本框3.字体颜色 = 0XFFFFFFFF
		相对布局1.背景颜色 = 0XFF333333
		卡片布局1.卡片背景颜色 = 0XFF333333 
		卡片布局2.卡片背景颜色 = 0XFF333333
		卡片布局4.卡片背景颜色 = 0XFF333333
		文本框4.字体颜色 = 0XFFFFFFFF
		线性布局12.背景颜色 = 0XFF333333
		文本框6.字体颜色 = 0XFFFFFFFF
		文本框7.字体颜色 = 0XFFFFFFFF
		文本框8.字体颜色 = 0XFFFFFFFF
		文本框9.字体颜色 = 0XFFFFFFFF
		文本框10.字体颜色 = 0XFFFFFFFF
		文本框11.字体颜色 = 0XFFFFFFFF
		卡片布局6.卡片背景颜色 = 0XFF333333
		线性布局20.背景颜色 = 0XFF333333
		文本框13.字体颜色 = 0XFFFFFFFF
		文本框16.字体颜色 = 0XFFFFFFFF
		文本框19.字体颜色 = 0XFFFFFFFF
		文本框60.字体颜色 = 0XFFFFFFFF
		文本框62.字体颜色 = 0XFFFFFFFF
		文本框67.字体颜色 = 0XFFFFFFFF
		文本框15.背景颜色 = 0XFF222222
		文本框18.背景颜色 = 0XFF222222
		文本框64.背景颜色 = 0XFF222222
		文本框65.背景颜色 = 0XFF222222
		文本框66.背景颜色 = 0XFF222222
		文本框14.字体颜色 = 0XFFE0E0E0
		文本框17.字体颜色 = 0XFFE0E0E0
		文本框20.字体颜色 = 0XFFE0E0E0
		文本框61.字体颜色 = 0XFFE0E0E0
		文本框63.字体颜色 = 0XFFE0E0E0
		文本框68.字体颜色 = 0XFFE0E0E0
		卡片布局7.卡片背景颜色 = 0XFF333333
		线性布局27.背景颜色 = 0XFF333333
		文本框21.字体颜色 = 0XFFFFFFFF
		文本框25.字体颜色 = 0XFFFFFFFF
		文本框31.字体颜色 = 0XFFFFFFFF
		文本框47.字体颜色 = 0XFFFFFFFF
		文本框58.字体颜色 = 0XFFFFFFFF
		文本框24.背景颜色 = 0XFF222222
		文本框40.背景颜色 = 0XFF222222
		文本框46.背景颜色 = 0XFF222222
		文本框57.背景颜色 = 0XFF222222
		卡片布局8.卡片背景颜色 = 0XFF333333
		线性布局32.背景颜色 = 0XFF333333
		文本框22.字体颜色 = 0XFFFFFFFF
		文本框28.字体颜色 = 0XFFFFFFFF
		文本框29.字体颜色 = 0XFFFFFFFF
		文本框30.字体颜色 = 0XFFFFFFFF
		文本框36.字体颜色 = 0XFFFFFFFF
		文本框38.字体颜色 = 0XFFFFFFFF
		文本框41.背景颜色 = 0XFF222222
		文本框42.背景颜色 = 0XFF222222
		文本框43.背景颜色 = 0XFF222222
		文本框44.背景颜色 = 0XFF222222
		文本框45.背景颜色 = 0XFF222222
		卡片布局10.卡片背景颜色 = 0XFF333333
		线性布局64.背景颜色 = 0XFF333333
		文本框69.字体颜色 = 0XFFFFFFFF
		文本框74.字体颜色 = 0XFFFFFFFF
		文本框75.字体颜色 = 0XFFFFFFFF
		文本框76.字体颜色 = 0XFFFFFFFF
		文本框71.背景颜色 = 0XFF222222
		文本框73.背景颜色 = 0XFF222222
		文本框72.背景颜色 = 0XFF222222
		卡片布局9.卡片背景颜色 = 0XFF333333
		线性布局49.背景颜色 = 0XFF333333
		文本框51.字体颜色 = 0XFFFFFFFF
		文本框53.字体颜色 = 0XFFFFFFFF
		文本框54.字体颜色 = 0XFFFFFFFF
		文本框49.背景颜色 = 0XFF222222
		文本框50.背景颜色 = 0XFF222222
		文本框52.字体颜色 = 0XFFE0E0E0
		文本框56.字体颜色 = 0XFFE0E0E0
		文本框55.字体颜色 = 0XFFE0E0E0
		图片框2.图片资源 = 项目管理_资源.白色图标描述
		图片框4.图片资源 = 项目管理_资源.白色图标类型
		图片框6.图片资源 = 项目管理_资源.白色图标uuid
		图片框36.图片资源 = 项目管理_资源.白色图标uuid
		图片框38.图片资源 = 项目管理_资源.白色图标语法版本
		图片框40.图片资源 = 项目管理_资源.白色图标游戏版本
		图片框8.图片资源 = 项目管理_资源.白色图标清单配置
		图片框11.图片资源 = 项目管理_资源.白色图标清单设定
		图片框17.图片资源 = 项目管理_资源.白色图标资源文件查看
		图片框26.图片资源 = 项目管理_资源.白色图标行为文件查看
		图片框9.图片资源 = 项目管理_资源.白色图标资源包编辑器
		图片框14.图片资源 = 项目管理_资源.白色图标行为包编辑器
		图片框15.图片资源 = 项目管理_资源.白色图标代码编辑器
		图片框16.图片资源 = 项目管理_资源.白色图标项目编辑器
		图片框22.图片资源 = 项目管理_资源.白色图标函数编辑器
		图片框42.图片资源 = 项目管理_资源.白色图标运行项目
		图片框44.图片资源 = 项目管理_资源.白色图标打包项目
		图片框45.图片资源 = 项目管理_资源.白色图标全局资源
		图片框46.图片资源 = 项目管理_资源.白色图标导入游戏
		图片框30.图片资源 = 项目管理_资源.白色图标备份项目
		图片框32.图片资源 = 项目管理_资源.白色图标分享项目
		图片框33.图片资源 = 项目管理_资源.白色图标删除项目
	结束 方法

结束 类