类 其他_附件_传感器 : 窗口

	@布局配置([[根布局=真,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=50,对齐方式=8388627,背景颜色=-1]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度DP=15,高度DP=15,图片资源="../../../../资源库/图标/back/Back_black.png",@左外边距DP=10]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局2,字体大小=15,内容="项目",字体颜色=-16777216]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局2,宽度DP=2,高度DP=12,@左外边距DP=10,卡片阴影=0]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,背景颜色=-526087]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局2,@左外边距DP=10,粗体=真,字体大小=16,内容="传感器",字体颜色=-16777216]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局1,宽度=-1,高度=-1]])
	变量 滚动布局1 : 滚动布局
	@布局配置([[父布局=滚动布局1,宽度=-1,高度=-1,纵向布局=真,内边距DP=5]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-2,圆角=15,卡片阴影=0,可视=真]])
	变量 卡片布局2 : 卡片布局
	@布局配置([[父布局=卡片布局2,宽度=-1,高度=-1,背景颜色=-1,纵向布局=真]])
	变量 线性布局5 : 线性布局
	@布局配置([[父布局=线性布局5,宽度=-1,高度DP=35,对齐方式=8388627]])
	变量 线性布局6 : 线性布局
	@布局配置([[父布局=线性布局6,@左外边距DP=10,字体大小=14,字体颜色=-16777216,粗体=真,内容="方向传感器"]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=线性布局5,宽度=-1,高度=-2,纵向布局=真]])
	变量 线性布局7 : 线性布局
	@布局配置([[父布局=线性布局7,宽度=-1,高度DP=25,对齐方式=8388627]])
	变量 线性布局8 : 线性布局
	@布局配置([[父布局=线性布局8,@左外边距DP=10,字体颜色=-16777216,内容="偏航角："]])
	变量 文本框4 : 文本框
	@布局配置([[父布局=线性布局8]])
	变量 文本框5 : 文本框
	@布局配置([[父布局=线性布局7,宽度=-1,高度DP=25,对齐方式=8388627]])
	变量 线性布局29 : 线性布局
	@布局配置([[父布局=线性布局29,@左外边距DP=10,字体颜色=-16777216,内容="俯仰角："]])
	变量 文本框18 : 文本框
	@布局配置([[父布局=线性布局29]])
	变量 文本框20 : 文本框
	@布局配置([[父布局=线性布局7,宽度=-1,高度DP=25,对齐方式=8388627]])
	变量 线性布局30 : 线性布局
	@布局配置([[父布局=线性布局30,@左外边距DP=10,字体颜色=-16777216,内容="横滚角："]])
	变量 文本框19 : 文本框
	@布局配置([[父布局=线性布局30]])
	变量 文本框21 : 文本框
	@布局配置([[父布局=线性布局5,宽度=-1,高度DP=150]])
	变量 线性布局9 : 线性布局
	@布局配置([[父布局=线性布局9,宽度=-1,高度=-1,@左外边距DP=10,@右外边距DP=10,@下外边距DP=10,@上外边距DP=5]])
	变量 普通折线图1 : 普通折线图
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-2,圆角=15,卡片阴影=0,@上外边距DP=5,可视=真]])
	变量 卡片布局3 : 卡片布局
	@布局配置([[父布局=卡片布局3,宽度=-1,高度=-1,背景颜色=-1,纵向布局=真]])
	变量 线性布局10 : 线性布局
	@布局配置([[父布局=线性布局10,宽度=-1,高度DP=35,对齐方式=8388627]])
	变量 线性布局11 : 线性布局
	@布局配置([[父布局=线性布局11,@左外边距DP=10,字体大小=14,字体颜色=-16777216,粗体=真,内容="加速度传感器"]])
	变量 文本框6 : 文本框
	@布局配置([[父布局=线性布局10,宽度=-1,高度=-2,纵向布局=真]])
	变量 线性布局12 : 线性布局
	@布局配置([[父布局=线性布局12,宽度=-1,高度DP=25,对齐方式=8388627]])
	变量 线性布局13 : 线性布局
	@布局配置([[父布局=线性布局13,@左外边距DP=10,字体颜色=-16777216,内容="X："]])
	变量 文本框7 : 文本框
	@布局配置([[父布局=线性布局13]])
	变量 文本框8 : 文本框
	@布局配置([[父布局=线性布局12,宽度=-1,高度DP=25,对齐方式=8388627]])
	变量 线性布局31 : 线性布局
	@布局配置([[父布局=线性布局31,@左外边距DP=10,字体颜色=-16777216,内容="Y："]])
	变量 文本框22 : 文本框
	@布局配置([[父布局=线性布局31]])
	变量 文本框24 : 文本框
	@布局配置([[父布局=线性布局12,宽度=-1,高度DP=25,对齐方式=8388627]])
	变量 线性布局32 : 线性布局
	@布局配置([[父布局=线性布局32,@左外边距DP=10,字体颜色=-16777216,内容="Z："]])
	变量 文本框23 : 文本框
	@布局配置([[父布局=线性布局32]])
	变量 文本框25 : 文本框
	@布局配置([[父布局=线性布局10,宽度=-1,高度DP=150]])
	变量 线性布局14 : 线性布局
	@布局配置([[父布局=线性布局14,宽度=-1,高度=-1,@左外边距DP=10,@右外边距DP=10,@下外边距DP=10,@上外边距DP=5]])
	变量 普通折线图2 : 普通折线图
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-2,圆角=15,卡片阴影=0,@上外边距DP=5,可视=真]])
	变量 卡片布局4 : 卡片布局
	@布局配置([[父布局=卡片布局4,宽度=-1,高度=-1,背景颜色=-1,纵向布局=真]])
	变量 线性布局15 : 线性布局
	@布局配置([[父布局=线性布局15,宽度=-1,高度DP=35,对齐方式=8388627]])
	变量 线性布局17 : 线性布局
	@布局配置([[父布局=线性布局17,@左外边距DP=10,字体大小=14,字体颜色=-16777216,粗体=真,内容="光线传感器"]])
	变量 文本框9 : 文本框
	@布局配置([[父布局=线性布局15,宽度=-1,高度=-2,纵向布局=真]])
	变量 线性布局21 : 线性布局
	@布局配置([[父布局=线性布局21,宽度=-1,高度DP=25,对齐方式=8388627]])
	变量 线性布局24 : 线性布局
	@布局配置([[父布局=线性布局24,@左外边距DP=10,字体颜色=-16777216,内容="当前："]])
	变量 文本框12 : 文本框
	@布局配置([[父布局=线性布局24]])
	变量 文本框15 : 文本框
	@布局配置([[父布局=线性布局15,宽度=-1,高度DP=150]])
	变量 线性布局27 : 线性布局
	@布局配置([[父布局=线性布局27,宽度=-1,高度=-1,@左外边距DP=10,@右外边距DP=10,@下外边距DP=10,@上外边距DP=5]])
	变量 普通折线图3 : 普通折线图
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-2,圆角=15,卡片阴影=0,@上外边距DP=5,可视=真]])
	变量 卡片布局5 : 卡片布局
	@布局配置([[父布局=卡片布局5,宽度=-1,高度=-1,背景颜色=-1,纵向布局=真]])
	变量 线性布局16 : 线性布局
	@布局配置([[父布局=线性布局16,宽度=-1,高度DP=35,对齐方式=8388627]])
	变量 线性布局18 : 线性布局
	@布局配置([[父布局=线性布局18,@左外边距DP=10,字体大小=14,字体颜色=-16777216,粗体=真,内容="距离传感器"]])
	变量 文本框10 : 文本框
	@布局配置([[父布局=线性布局16,宽度=-1,高度=-2,纵向布局=真]])
	变量 线性布局22 : 线性布局
	@布局配置([[父布局=线性布局22,宽度=-1,高度DP=25,对齐方式=8388627]])
	变量 线性布局25 : 线性布局
	@布局配置([[父布局=线性布局25,@左外边距DP=10,字体颜色=-16777216,内容="当前："]])
	变量 文本框13 : 文本框
	@布局配置([[父布局=线性布局25]])
	变量 文本框16 : 文本框
	@布局配置([[父布局=线性布局16,宽度=-1,高度DP=150]])
	变量 线性布局28 : 线性布局
	@布局配置([[父布局=线性布局28,宽度=-1,高度=-1,@左外边距DP=10,@右外边距DP=10,@下外边距DP=10,@上外边距DP=5]])
	变量 普通折线图4 : 普通折线图
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-2,圆角=15,卡片阴影=0,@上外边距DP=5]])
	变量 卡片布局6 : 卡片布局
	@布局配置([[父布局=卡片布局6,宽度=-1,高度=-1,背景颜色=-1,纵向布局=真]])
	变量 线性布局19 : 线性布局
	@布局配置([[父布局=线性布局19,宽度=-1,高度DP=35,对齐方式=8388627]])
	变量 线性布局20 : 线性布局
	@布局配置([[父布局=线性布局20,@左外边距DP=10,字体大小=14,字体颜色=-16777216,粗体=真,内容="位置传感器"]])
	变量 文本框11 : 文本框
	@布局配置([[父布局=线性布局20,宽度DP=20,高度DP=20,@左外边距DP=10,颜色=-15237655]])
	变量 进度圈1 : 进度圈
	@布局配置([[父布局=线性布局19,宽度=-1,高度=-2,纵向布局=真,可视=假]])
	变量 线性布局23 : 线性布局
	@布局配置([[父布局=线性布局23,宽度=-1,高度DP=25,对齐方式=8388627]])
	变量 线性布局26 : 线性布局
	@布局配置([[父布局=线性布局26,@左外边距DP=10,字体颜色=-16777216,内容="纬度："]])
	变量 文本框14 : 文本框
	@布局配置([[父布局=线性布局26]])
	变量 文本框17 : 文本框
	@布局配置([[父布局=线性布局23,宽度=-1,高度DP=25,对齐方式=8388627]])
	变量 线性布局33 : 线性布局
	@布局配置([[父布局=线性布局33,@左外边距DP=10,字体颜色=-16777216,内容="经度："]])
	变量 文本框26 : 文本框
	@布局配置([[父布局=线性布局33]])
	变量 文本框33 : 文本框
	@布局配置([[父布局=线性布局23,宽度=-1,高度DP=25,对齐方式=8388627]])
	变量 线性布局34 : 线性布局
	@布局配置([[父布局=线性布局34,@左外边距DP=10,字体颜色=-16777216,内容="海拔："]])
	变量 文本框27 : 文本框
	@布局配置([[父布局=线性布局34]])
	变量 文本框34 : 文本框
	@布局配置([[父布局=线性布局23,宽度=-1,高度DP=25,对齐方式=8388627]])
	变量 线性布局35 : 线性布局
	@布局配置([[父布局=线性布局35,@左外边距DP=10,字体颜色=-16777216,内容="速度："]])
	变量 文本框28 : 文本框
	@布局配置([[父布局=线性布局35]])
	变量 文本框35 : 文本框
	@布局配置([[父布局=线性布局23,宽度=-1,高度DP=25,对齐方式=8388627]])
	变量 线性布局36 : 线性布局
	@布局配置([[父布局=线性布局36,@左外边距DP=10,字体颜色=-16777216,内容="方向："]])
	变量 文本框29 : 文本框
	@布局配置([[父布局=线性布局36]])
	变量 文本框36 : 文本框
	@布局配置([[父布局=线性布局23,宽度=-1,高度DP=25,对齐方式=8388627]])
	变量 线性布局37 : 线性布局
	@布局配置([[父布局=线性布局37,@左外边距DP=10,字体颜色=-16777216,内容="精度："]])
	变量 文本框30 : 文本框
	@布局配置([[父布局=线性布局37]])
	变量 文本框37 : 文本框
	@布局配置([[父布局=线性布局23,宽度=-1,高度DP=25,对齐方式=8388627]])
	变量 线性布局38 : 线性布局
	@布局配置([[父布局=线性布局38,@左外边距DP=10,字体颜色=-16777216,内容="时间："]])
	变量 文本框31 : 文本框
	@布局配置([[父布局=线性布局38]])
	变量 文本框38 : 文本框
	@布局配置([[父布局=线性布局23,宽度=-1,高度DP=25,对齐方式=8388627,@上外边距DP=5,水波纹效果=真]])
	变量 线性布局39 : 线性布局
	@布局配置([[父布局=线性布局39,字体颜色=-16777216,内容="打开定位权限设置",@左外边距DP=10]])
	变量 文本框32 : 文本框
	@布局配置([[父布局=线性布局19,宽度=-1,高度DP=150,对齐方式=17]])
	变量 线性布局40 : 线性布局
	@布局配置([[父布局=线性布局40,宽度DP=100,高度DP=40,对齐方式=17,水波纹效果=真]])
	变量 线性布局41 : 线性布局
	@布局配置([[父布局=线性布局41,内容="开启定位"]])
	变量 文本框39 : 文本框

	变量 设置_设定 : 设置_设定
	变量 申请定位权限 : 逻辑型
	
	变量 定位传感器 : 位置传感器

	事件 其他_附件_传感器:创建完毕()
		//设置主题
		本对象.显示标题栏 = 假
		本对象.状态栏颜色 = 0XFFFFFFFF
		本对象.状态栏字体黑色 = 真
		//窗口切换动画
		播放默认切换动画(2)
		//设置夜间模式
		如果 设置_设定.获取开关("NightMode") 则
			设置夜间模式()
		结束 如果
		//设置背景
		变量 设置相关路径 : 文本 = 设置_设定.获取文本("PersonalityBackground")
		如果 设置相关路径.替换(" ","") == "" 则
		否则
			如果 文件是否存在(设置相关路径) 则
				设置_设置.设置布局背景(本对象,线性布局4,设置相关路径)
			结束 如果
		结束 如果
		//加载方法
		初始化图表()
		位置传感器相关事件()
		传感器可用()
		//订阅事件
		订阅事件()
	结束 事件

	//退出界面
	事件 图片框1:被单击()
		关闭界面时操作()
		关闭窗口()
	结束 事件
	事件 文本框2:被单击()
		关闭界面时操作()
		关闭窗口()
	结束 事件

	/*
	窗口被重新启动时触发该事件
	*/
	事件 其他_附件_传感器:被重新启动()
		如果 其他_其他.缓存是否存在("申请定位权限") 则
			位置传感器()
			其他_其他.删除缓存("申请定位权限")
		结束 如果
	结束 事件
	
	//界面被关闭时
	事件 其他_附件_传感器:被销毁()
		关闭界面时操作()
	结束 事件
	
	方法 关闭界面时操作()
		//关闭定位监测
		如果 定位传感器.是否已开启 则
			定位传感器.停止监测()
		结束 如果
	结束 方法

	方法 初始化图表()
		//方向传感器
		普通折线图1.初始化()
		普通折线图1.设置图表是否可拖拽(真)
		普通折线图1.设置图表描述信息(假)
		普通折线图1.设置是否显示X轴(假)
		普通折线图1.设置是否显示Y轴(假)
		普通折线图1.添加折线("偏航角","#1899C8")
		普通折线图1.添加折线("俯仰角","#12A655")
		普通折线图1.添加折线("横滚角","#CB4141")
		普通折线图1.显示折线()
		//加速度传感器
		普通折线图2.初始化()
		普通折线图2.设置图表是否可拖拽(真)
		普通折线图2.设置图表描述信息(假)
		普通折线图2.设置是否显示X轴(假)
		普通折线图2.设置是否显示Y轴(假)
		普通折线图2.添加折线("X","#1899C8")
		普通折线图2.添加折线("Y","#12A655")
		普通折线图2.添加折线("Z","#CB4141")
		普通折线图2.显示折线()
		//光线传感器
		普通折线图3.初始化()
		普通折线图3.设置图表是否可拖拽(真)
		普通折线图3.设置图表描述信息(假)
		普通折线图3.设置是否显示X轴(假)
		普通折线图3.设置是否显示Y轴(假)
		普通折线图3.添加折线("当前","#CB4141")
		普通折线图3.显示折线()
		//距离传感器
		普通折线图4.初始化()
		普通折线图4.设置图表是否可拖拽(真)
		普通折线图4.设置图表描述信息(假)
		普通折线图4.设置是否显示X轴(假)
		普通折线图4.设置是否显示Y轴(假)
		普通折线图4.添加折线("当前","#CB4141")
		普通折线图4.显示折线()
	结束 方法

	//检测传感器是否可用
	方法 传感器可用()
		变量 传感器1 : 方向传感器
		变量 传感器2 : 加速度传感器
		变量 传感器3 : 光线传感器
		变量 传感器4 : 距离传感器
		变量 传感器5 : 位置传感器
		如果 传感器1.有效 则
			卡片布局2.可视 = 真
			方向传感器()
		否则
			卡片布局2.可视 = 假
			不可用对话框("方向传感器")
		结束 如果
		如果 传感器2.有效 则
			卡片布局3.可视 = 真
			加速度传感器()
		否则
			卡片布局3.可视 = 假
			不可用对话框("加速度传感器")
		结束 如果
		如果 传感器3.有效 则
			卡片布局4.可视 = 真
			光线传感器()
		否则
			卡片布局4.可视 = 假
			不可用对话框("光线传感器")
		结束 如果
		如果 传感器4.可用 则
			卡片布局5.可视 = 真
			距离传感器()
		否则
			卡片布局5.可视 = 假
			不可用对话框("距离传感器")
		结束 如果
		如果 传感器5.有效 则
			卡片布局6.可视 = 真
			位置传感器()
		否则
			卡片布局6.可视 = 假
			不可用对话框("位置传感器")
		结束 如果
		事件 线性布局39:被单击()
			XX权限.跳转到应用权限设置页(本对象)
		结束 事件
	结束 方法

	方法 方向传感器()
		变量 传感器 : 方向传感器
		传感器.可用 = 真
		事件 传感器:方向改变(偏航角 : 小数,俯仰角 : 小数,横滚角 : 小数)
			文本框5.内容 = 偏航角.到文本() + "°"
			文本框20.内容 = 俯仰角.到文本() + "°"
			文本框21.内容 = 横滚角.到文本() + "°"
			普通折线图1.添加数据(偏航角.到对象().单精度小数值,0)
			普通折线图1.添加数据(俯仰角.到对象().单精度小数值,1)
			普通折线图1.添加数据(横滚角.到对象().单精度小数值,2)
		结束 事件
	结束 方法

	方法 加速度传感器()
		变量 传感器 : 加速度传感器
		传感器.可用 = 真
		事件 传感器:加速度改变(X加速度 : 小数,Y加速度 : 小数,Z加速度 : 小数)
			文本框8.内容 = X加速度.到文本() + " m/s²"
			文本框24.内容 = Y加速度.到文本() + " m/s²"
			文本框25.内容 = Z加速度.到文本() + " m/s²"
			普通折线图2.添加数据(X加速度.到对象().单精度小数值,0)
			普通折线图2.添加数据(Y加速度.到对象().单精度小数值,1)
			普通折线图2.添加数据(Z加速度.到对象().单精度小数值,2)
		结束 事件
	结束 方法

	方法 光线传感器()
		变量 传感器 : 光线传感器
		事件 传感器:光线改变(光线强度 : 小数)
			文本框15.内容 = 光线强度.到文本() + " lx"
			普通折线图3.添加数据(光线强度.到对象().单精度小数值,0)
		结束 事件
	结束 方法

	方法 距离传感器()
		变量 传感器 : 距离传感器
		事件 传感器:距离改变(距离 : 小数)
			文本框16.内容 = 距离.到文本() + " cm"
			普通折线图4.添加数据(距离.到对象().单精度小数值,0)
		结束 事件
	结束 方法
	
	方法 位置传感器()
		如果 是否有定位权限() 则
			线性布局23.可视 = 真
			线性布局40.可视 = 假
			定位传感器.开始监测()
			事件 定位传感器:位置改变(纬度 : 小数,经度 : 小数,海拔 : 小数,速度 : 小数,方向 : 小数)
				文本框17.内容 = 纬度.到文本()
				文本框33.内容 = 经度.到文本()
				文本框34.内容 = 海拔.到文本()
				文本框35.内容 = 速度.到文本() + " km/h"
				文本框36.内容 = 方向.到文本()
				文本框37.内容 = 定位传感器.精度.到文本() + " m"
				文本框38.内容 = 定位传感器.时间
				进度圈1.可视 = 假
			结束 事件
			事件 定位传感器:状态改变(状态 : 整数)
				假如 状态
					是 0

					是 1
						弹出错误通知("GPS 不在服务区")
					是
						弹出错误通知("GPS 服务暂停")	
				结束 假如
			结束 事件
		否则
			线性布局23.可视 = 假
			线性布局40.可视 = 真
		结束 如果
	结束 方法

	方法 位置传感器相关事件()
		事件 线性布局41:被单击()
			弹出提示("请打开定位权限")
			其他_其他.写缓存("申请定位权限","")
			XX权限.跳转到应用权限设置页(本对象)
		结束 事件
	结束 方法

	方法 不可用对话框(内容 : 文本)
		变量 Dialog : AlertDialog
		Dialog.初始化 = 本对象
		Dialog.标题 = "警告"
		Dialog.内容 = 内容 + "无法使用，将不会在里面显示，有可能传感器损坏，也不排除没有权限"
		Dialog.按钮1 = "确定"
		Dialog.按钮颜色 = 0XFFFB0000
		Dialog.显示()
	结束 方法

	//是否有定位权限
	变量 是否合法 : 逻辑型 = 假
	方法 是否有定位权限() : 逻辑型
		开始俘获异常()
		变量 传感器0 : 位置传感器
		传感器0.开始监测()
		是否合法 = 真
		俘获所有异常()
		是否合法 = 假
		结束俘获异常()
		返回 是否合法
	结束 方法

	//设置功能按钮颜色
	方法 设置夜间模式()
		本对象.状态栏颜色 = 0XFF333333
		本对象.状态栏字体黑色 = 假
		线性布局2.背景颜色 = 0XFF333333
		线性布局3.背景颜色 = 0XFF222222
		卡片布局1.卡片背景颜色 = 0XFF222222
		文本框2.字体颜色 = 0XFFFFFFFF
		文本框3.字体颜色 = 0XFFFFFFFF
		图片框1.图片资源 = 其他_资源.白色返回图标
		线性布局4.背景颜色 = 0XFF222222
		滚动布局1.背景颜色 = 0XFF222222
		卡片布局2.卡片背景颜色 = 0XFF333333
		卡片布局3.卡片背景颜色 = 0XFF333333
		卡片布局4.卡片背景颜色 = 0XFF333333
		卡片布局5.卡片背景颜色 = 0XFF333333
		卡片布局6.卡片背景颜色 = 0XFF333333
		线性布局5.背景颜色 = 0XFF333333
		线性布局10.背景颜色 = 0XFF333333
		线性布局15.背景颜色 = 0XFF333333
		线性布局16.背景颜色 = 0XFF333333
		线性布局19.背景颜色 = 0XFF333333
		文本框1.字体颜色 = 0XFFFFFFFF
		文本框4.字体颜色 = 0XFFFFFFFF
		文本框5.字体颜色 = 0XFFFFFFFF
		文本框6.字体颜色 = 0XFFFFFFFF
		文本框7.字体颜色 = 0XFFFFFFFF
		文本框8.字体颜色 = 0XFFFFFFFF
		文本框9.字体颜色 = 0XFFFFFFFF
		文本框10.字体颜色 = 0XFFFFFFFF
		文本框11.字体颜色 = 0XFFFFFFFF
		文本框12.字体颜色 = 0XFFFFFFFF
		文本框13.字体颜色 = 0XFFFFFFFF
		文本框14.字体颜色 = 0XFFFFFFFF
		文本框15.字体颜色 = 0XFFFFFFFF
		文本框16.字体颜色 = 0XFFFFFFFF
		文本框17.字体颜色 = 0XFFFFFFFF
		文本框18.字体颜色 = 0XFFFFFFFF
		文本框19.字体颜色 = 0XFFFFFFFF
		文本框20.字体颜色 = 0XFFFFFFFF
		文本框21.字体颜色 = 0XFFFFFFFF
		文本框22.字体颜色 = 0XFFFFFFFF
		文本框23.字体颜色 = 0XFFFFFFFF
		文本框24.字体颜色 = 0XFFFFFFFF
		文本框25.字体颜色 = 0XFFFFFFFF
		文本框26.字体颜色 = 0XFFFFFFFF
		文本框27.字体颜色 = 0XFFFFFFFF
		文本框28.字体颜色 = 0XFFFFFFFF
		文本框29.字体颜色 = 0XFFFFFFFF
		文本框30.字体颜色 = 0XFFFFFFFF
		文本框31.字体颜色 = 0XFFFFFFFF
		文本框32.字体颜色 = 0XFFFFFFFF
		文本框33.字体颜色 = 0XFFFFFFFF
		文本框34.字体颜色 = 0XFFFFFFFF
		文本框35.字体颜色 = 0XFFFFFFFF
		文本框36.字体颜色 = 0XFFFFFFFF
		文本框37.字体颜色 = 0XFFFFFFFF
		文本框38.字体颜色 = 0XFFFFFFFF
		文本框39.字体颜色 = 0XFFFFFFFF
	结束 方法

结束 类