类 其他_附件_WebSocket : 窗口

	@布局配置([[根布局=真,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=50,对齐方式=8388627,背景颜色=-1]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度DP=15,高度DP=15,图片资源="../../../../资源库/图标/back/Back_black.png",@左外边距DP=10]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局2,字体大小=15,内容="项目",字体颜色=-16777216]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局2,宽度DP=2,高度DP=12,@左外边距DP=10,卡片阴影=0]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,背景颜色=-526087]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,对齐方式=8388627,背景颜色=-14050244]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,宽度DP=25,高度DP=25,@左外边距DP=10]])
	变量 图片框2 : 图片框
	@布局配置([[父布局=线性布局4,@左外边距DP=5,内容="启动",字体大小=15,粗体=真,字体颜色=-1]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=线性布局2,@左外边距DP=10,粗体=真,字体大小=16,内容="WebSocket",字体颜色=-16777216]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局1,宽度=-1,高度=-1]])
	变量 滚动布局1 : 滚动布局
	@布局配置([[父布局=滚动布局1,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局6 : 线性布局
	@布局配置([[父布局=线性布局6,宽度=-1,高度DP=150,对齐方式=17]])
	变量 线性布局7 : 线性布局
	@布局配置([[父布局=线性布局7,宽度DP=110,高度DP=45,圆角=15,卡片阴影=0]])
	变量 卡片布局2 : 卡片布局
	@布局配置([[父布局=卡片布局2,宽度=-1,高度=-1,对齐方式=8388627,背景颜色=-14050244,水波纹效果=真]])
	变量 线性布局14 : 线性布局
	@布局配置([[父布局=线性布局14,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/component/websocket/play.xml"]])
	变量 图片框4 : 图片框
	@布局配置([[父布局=线性布局14,@左外边距DP=5,内容="启动",字体大小=15,粗体=真,字体颜色=-1]])
	变量 文本框22 : 文本框
	@布局配置([[父布局=线性布局6,宽度=-1,高度=-2,纵向布局=真,背景颜色=-13813437]])
	变量 线性布局5 : 线性布局
	@布局配置([[父布局=线性布局5,宽度=-1,高度DP=40,对齐方式=8388627]])
	变量 线性布局9 : 线性布局
	@布局配置([[父布局=线性布局9,@左外边距DP=10,内容="服务器信息",字体颜色=-1,字体大小=18]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局5,宽度=-1,高度=-2,纵向布局=真,@左外边距DP=10,@右外边距DP=10,@下外边距DP=10,@上外边距DP=5,背景颜色=-1]])
	变量 线性布局10 : 线性布局
	@布局配置([[父布局=线性布局10,宽度=-1,高度DP=35]])
	变量 相对布局1 : 相对布局
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局11 : 线性布局
	@布局配置([[父布局=线性布局11,@左外边距=0,@左外边距DP=10,背景颜色=16777215,字体颜色=-13813437,粗体=真,内容="监听端口"]])
	变量 文本框4 : 文本框
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局12 : 线性布局
	@布局配置([[父布局=线性布局12,@右外边距DP=10,字体颜色=-13813437]])
	变量 文本框5 : 文本框
	@布局配置([[父布局=线性布局10,宽度=-1,高度DP=35]])
	变量 相对布局2 : 相对布局
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局13 : 线性布局
	@布局配置([[父布局=线性布局13,@左外边距DP=10,背景颜色=16777215,字体颜色=-13813437,粗体=真,内容="当前总在线人数"]])
	变量 文本框6 : 文本框
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局8 : 线性布局
	@布局配置([[父布局=线性布局8,@右外边距DP=10,字体颜色=-13813437]])
	变量 文本框10 : 文本框
	@布局配置([[父布局=线性布局10,宽度=-1,高度DP=35]])
	变量 相对布局3 : 相对布局
	@布局配置([[父布局=相对布局3,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局15 : 线性布局
	@布局配置([[父布局=线性布局15,@左外边距DP=10,背景颜色=16777215,字体颜色=-13813437,粗体=真,内容="当前所有连接"]])
	变量 文本框7 : 文本框
	@布局配置([[父布局=相对布局3,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局18 : 线性布局
	@布局配置([[父布局=线性布局18,@右外边距DP=10,字体颜色=-13813437]])
	变量 文本框11 : 文本框
	@布局配置([[父布局=线性布局10,宽度=-1,高度DP=35]])
	变量 相对布局4 : 相对布局
	@布局配置([[父布局=相对布局4,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局16 : 线性布局
	@布局配置([[父布局=线性布局16,@左外边距DP=10,背景颜色=16777215,字体颜色=-13813437,粗体=真,内容="客户端地址"]])
	变量 文本框8 : 文本框
	@布局配置([[父布局=相对布局4,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局19 : 线性布局
	@布局配置([[父布局=线性布局19,@右外边距DP=10,字体颜色=-13813437]])
	变量 文本框12 : 文本框
	@布局配置([[父布局=线性布局10,宽度=-1,高度DP=35]])
	变量 相对布局5 : 相对布局
	@布局配置([[父布局=相对布局5,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局17 : 线性布局
	@布局配置([[父布局=线性布局17,@左外边距DP=10,背景颜色=16777215,字体颜色=-13813437,粗体=真,内容="客户端端口"]])
	变量 文本框9 : 文本框
	@布局配置([[父布局=相对布局5,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局20 : 线性布局
	@布局配置([[父布局=线性布局20,@右外边距DP=10,字体颜色=-13813437]])
	变量 文本框13 : 文本框
	@布局配置([[父布局=线性布局6,宽度=-1,高度=-2,纵向布局=真,背景颜色=-13813437]])
	变量 线性布局21 : 线性布局
	@布局配置([[父布局=线性布局21,宽度=-1,高度DP=40,对齐方式=8388627]])
	变量 线性布局22 : 线性布局
	@布局配置([[父布局=线性布局22,@左外边距DP=10,内容="其他信息",字体颜色=-1,字体大小=18]])
	变量 文本框14 : 文本框
	@布局配置([[父布局=线性布局21,宽度=-1,高度=-2,纵向布局=真,@左外边距DP=10,@右外边距DP=10,@下外边距DP=10,@上外边距DP=5,背景颜色=-1]])
	变量 线性布局23 : 线性布局
	@布局配置([[父布局=线性布局23,宽度=-1,高度DP=35]])
	变量 相对布局6 : 相对布局
	@布局配置([[父布局=相对布局6,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局24 : 线性布局
	@布局配置([[父布局=线性布局24,@左外边距DP=10,背景颜色=16777215,字体颜色=-13813437,粗体=真,内容="运行时间"]])
	变量 文本框15 : 文本框
	@布局配置([[父布局=相对布局6,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局25 : 线性布局
	@布局配置([[父布局=线性布局25,@右外边距DP=10,字体颜色=-13813437,内容="00:00:00"]])
	变量 文本框16 : 文本框
	@布局配置([[父布局=线性布局23,宽度=-1,高度DP=35]])
	变量 相对布局7 : 相对布局
	@布局配置([[父布局=相对布局7,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局26 : 线性布局
	@布局配置([[父布局=线性布局26,@左外边距DP=10,背景颜色=16777215,字体颜色=-13813437,粗体=真,内容="保存日志总数"]])
	变量 文本框17 : 文本框
	@布局配置([[父布局=相对布局7,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局27 : 线性布局
	@布局配置([[父布局=线性布局27,@右外边距DP=10,字体颜色=-13813437]])
	变量 文本框18 : 文本框
	@布局配置([[父布局=线性布局6,宽度=-1,高度=-2,纵向布局=真,背景颜色=-13813437]])
	变量 线性布局28 : 线性布局
	@布局配置([[父布局=线性布局28,宽度=-1,高度DP=40,对齐方式=8388627]])
	变量 线性布局29 : 线性布局
	@布局配置([[父布局=线性布局29,@左外边距DP=10,内容="日志",字体颜色=-1,字体大小=18]])
	变量 文本框19 : 文本框
	@布局配置([[父布局=线性布局28,宽度=-1,高度=-2]])
	变量 线性布局30 : 线性布局
	@布局配置([[父布局=线性布局30,@左外边距DP=10,@上外边距DP=5,@右外边距DP=10,@下外边距DP=10,字体颜色=-1,内容="[0000-00-00 00:00:00:0] 日志生成器"]])
	变量 文本框20 : 文本框

	//声明
	变量 设置_设定 : 设置_设定
	变量 启动开关 : 逻辑型 = 假
	变量 WS服务端 : WS服务端
	变量 连接标识 : 整数

	变量 悬浮球布局 : 其他_附件_WebSocket_悬浮球布局
	变量 悬浮球1:悬浮窗?

	变量 悬浮窗布局 : 其他_附件_WebSocket_悬浮窗布局
	变量 悬浮窗1:悬浮窗?

	变量 菜单状态 : 逻辑型 = 假

	变量 计时毫 : 整数 = 0
	变量 计时秒 : 整数 = 0
	变量 计时分 : 整数 = 0
	变量 计时时 : 整数 = 0
	变量 计时 : 逻辑型 = 假

	事件 其他_附件_WebSocket:创建完毕()
		//设置主题
		本对象.显示标题栏 = 假
		本对象.状态栏颜色 = 0XFFFFFFFF
		本对象.状态栏字体黑色 = 真
		//窗口切换动画
		播放默认切换动画(2)
		//退出按钮
		事件 图片框1:被单击()
			关闭窗口()
		结束 事件
		事件 文本框2:被单击()
			关闭窗口()
		结束 事件
		//设置夜间模式
		如果 设置_设定.获取开关("NightMode") 则
			设置夜间模式()
		结束 如果
		//设置背景
		变量 设置相关路径 : 文本 = 设置_设定.获取文本("PersonalityBackground")
		如果 设置相关路径.替换(" ","") == "" 则
		否则
			如果 文件是否存在(设置相关路径) 则
				设置_设置.设置布局背景(本对象,滚动布局1,设置相关路径)
			结束 如果
		结束 如果
		//使服务器信息功能栏为圆角
		如果 设置_设定.获取开关("NightMode") 则
			置圆背景2(线性布局10,0XFF333333,5)
			置圆背景2(线性布局23,0XFF333333,5)
		否则
			置圆背景2(线性布局10,0XFFFFFFFF,5)
			置圆背景2(线性布局23,0XFFFFFFFF,5)
		结束 如果
		//设置图片
		图片框4.图片资源 = 其他_附件_WebSocket_资源.启动
		//订阅事件
		订阅事件()
	结束 事件

	//启动
	事件 线性布局14:被单击()
		如果 启动开关 则
			图片框4.图片资源 = 其他_附件_WebSocket_资源.启动
			线性布局14.背景颜色 = 0XFF1FD78D
			文本框22.内容 = "启动"
			启动开关 = 假
			停止()
			停止悬浮窗()
		否则
			图片框4.图片资源 = 其他_附件_WebSocket_资源.停止
			线性布局14.背景颜色 = 0XFFFE0000
			文本框22.内容 = "停止"
			启动开关 = 真
			启动()
			启动悬浮窗()
		结束 如果
	结束 事件

	方法 启动()
		//提示
		变量 对话框S : DX基础对话框
		对话框S.标题("帮助")
		对话框S.内容("WebSocket服务器已开启。请在客户端里面输入一下指令来连接服务器。\n/connect 127.0.0.1:" + 设置_设定.获取文本("BasicWebSocketPort") + "\n/connect 192.168.0.104:" + 设置_设定.获取文本("BasicWebSocketPort") + "\n/connect 10.141.110.183:" + 设置_设定.获取文本("BasicWebSocketPort") + "\n\n如果连接失败,重启WebSocket服务器和游戏客户端")
		对话框S.按钮1("取消")
		对话框S.按钮2("复制指令")
		//设置夜间模式
		如果 设置_设定.获取开关("NightMode") 则
			对话框S.主题(DX主题.暗色)
		结束 如果
		事件 对话框S:按钮2被单击() : 逻辑型
			对话框S.关闭()
			变量 对话框S2 : DX基础对话框
			变量 帮助布局 : 其他_附件_WebSocket_帮助
			//设置夜间模式
			如果 设置_设定.获取开关("NightMode") 则
				对话框S2.主题(DX主题.暗色)
				对话框S2.背景颜色("#333333")
			结束 如果
			对话框S2.标题("复制命令")
			对话框S2.自定义布局(帮助布局)
			帮助布局.文本框1.内容 = "/connect 127.0.0.1:" + 设置_设定.获取文本("BasicWebSocketPort")
			帮助布局.文本框2.内容 = "/connect 192.168.0.104:" + 设置_设定.获取文本("BasicWebSocketPort")
			帮助布局.文本框3.内容 = "/connect 10.141.110.183:" + 设置_设定.获取文本("BasicWebSocketPort")
			对话框S2.按钮1("关闭")
			对话框S2.按钮2("启动游戏")
			对话框S2.显示()
			//设置夜间模式
			如果 设置_设定.获取开关("NightMode") 则
				帮助布局.线性布局1.背景颜色 = 0XFF333333
				帮助布局.线性布局2.背景颜色 = 0XFF333333
				帮助布局.文本框1.字体颜色 = 0XFFFFFFFF
				帮助布局.文本框2.字体颜色 = 0XFFFFFFFF
				帮助布局.文本框3.字体颜色 = 0XFFFFFFFF
			结束 如果
			事件 帮助布局.线性布局2:被单击()
				置剪切板文本(本对象,帮助布局.文本框1.内容)
				弹出成功提示("复制成功!")
			结束 事件
			事件 帮助布局.线性布局3:被单击()
				置剪切板文本(本对象,帮助布局.文本框2.内容)
				弹出成功提示("复制成功!")
			结束 事件
			事件 帮助布局.线性布局4:被单击()
				置剪切板文本(本对象,帮助布局.文本框3.内容)
				弹出成功提示("复制成功!")
			结束 事件
			事件 对话框S2:按钮2被单击() : 逻辑型
				打开应用(本对象,设置_设定.获取文本("BasicGamePackName"))
				对话框S2.关闭()
				返回 假
			结束 事件
			返回 假
		结束 事件
		对话框S.显示()
		//开始监听
		WS服务端.开始监听(设置_设定.获取整数("BasicWebSocketPort"))
		//监听成功
		事件 WS服务端:监听成功()
			弹出成功提示("WebSocket 服务器启动成功")
			控制台日志("WebSocket 服务器启动成功")
			刷新数据()
		结束 事件
		//获取收到文本
		事件 WS服务端:收到文本(连接标识 : 整数,内容 : 文本)
			控制台日志(连接标识 + " : " + 内容)
			刷新数据()
		结束 事件
		//有新的连接
		事件 WS服务端:有新连接(连接标识 : 整数)
			连接标识 = 连接标识
			控制台日志(连接标识+" 连接成功!")
			刷新数据()
		结束 事件
		//加载数据
		刷新数据()
		//启动计时
		计时 = 真
		提交到新线程运行()
		循环(计时)
			延时(100)
			计时毫 = 计时毫 + 1
			如果 计时毫 >= 10 则
				计时秒 = 计时秒 + 1
				计时毫 = 0
			结束 如果
			如果 计时秒 >= 60 则
				计时分 = 计时分 + 1
				计时秒 = 0
			结束 如果
			如果 计时分 >= 60 则
				计时时 = 计时时 + 1
				计时分 = 0
			结束 如果
			提交到主线程运行(本对象)
			文本框16.内容 = 计时时 + ":" + 计时分 + ":" + 计时秒 + ":" + 计时毫
			结束提交到主线程()
		结束 循环
		结束提交到新线程()
	结束 方法

	方法 停止()
		计时 = 假
		计时毫 = 0
		计时秒 = 0
		计时分 = 0
		计时时 = 0
		文本框16.内容 = "00:00:00:00"
		WS服务端.关闭客户端连接(连接标识)
		控制台日志("成功关闭客户端连接")
		WS服务端.关闭监听()
		控制台日志("关闭服务器成功")
	结束 方法

	方法 刷新数据()
		写出文本文件(其他_变量.数据目录 + "logs/websockets/a","")
		删除文件(其他_变量.数据目录 + "logs/websockets/a")
		文本框5.内容 = WS服务端.监听端口.到文本()
		文本框10.内容 = WS服务端.当前总在线人数.到文本()
		文本框11.内容 = 取数组长度(WS服务端.当前所有连接).到文本()
		文本框12.内容 = WS服务端.取客户端地址(连接标识).到文本()
		文本框13.内容 = WS服务端.取客户端端口(连接标识).到文本()
		文本框18.内容 = 取数组长度(文件操作.取子文件列表(其他_变量.数据目录 + "logs/websockets")).到文本()
	结束 方法

	方法 启动悬浮窗()
		//悬浮球
		悬浮球1=悬浮窗.创建悬浮窗(悬浮球布局,"悬浮球")
		悬浮球1.全局悬浮 = 真
		悬浮球1.可移动 = 真
		悬浮球1.可显示到状态栏 = 设置_设定.获取开关("PersonalityFloatingWindowDisplaytoStatusBar")
		悬浮球1.可显示到屏幕外 = 设置_设定.获取开关("PersonalityFloatingWindowDisplayOffScreen")
		悬浮球1.边缘吸附 = 设置_设定.获取开关("PersonalityFloatingWindowEdgeAdsorption")
		悬浮球1.显示()
		//悬浮窗
		悬浮窗1=悬浮窗.创建悬浮窗(悬浮窗布局,"悬浮窗")
		悬浮窗1.全局悬浮 = 真
		悬浮窗1.可移动 = 真
		悬浮窗1.固定宽度 = -1
		悬浮窗1.固定高度 = -1
		//加载补全
		如果 设置_设定.获取开关("BasicWebSocketCommandCompletion") 则
			悬浮窗布局.自动补全编辑框1.设置补全内容(本对象,读入资源文件(本对象,"data/identifier2/command.txt").分割文本(" "))
		结束 如果

		//设置夜间模式
		如果 设置_设定.获取开关("NightMode") 则
			悬浮窗布局.相对布局1.背景颜色 = 0XFF333333
			悬浮窗布局.文本框1.字体颜色 = 0XFFFFFFFF
			悬浮窗布局.文本框2.字体颜色 = 0XFFFFFFFF
			悬浮窗布局.文本框3.字体颜色 = 0XFFFFFFFF
			悬浮窗布局.文本框4.字体颜色 = 0XFFFFFFFF
			悬浮窗布局.文本框5.字体颜色 = 0XFFFFFFFF
			悬浮窗布局.文本框6.字体颜色 = 0XFFFFFFFF
			悬浮窗布局.文本框7.字体颜色 = 0XFFFFFFFF
			悬浮窗布局.文本框8.字体颜色 = 0XFFFFFFFF
			悬浮窗布局.自动补全编辑框1.提示文本颜色 = 0XFFE6E6E6
			悬浮窗布局.自动补全编辑框1.字体颜色 = 0XFFFFFFFF
			悬浮窗布局.卡片布局1.卡片背景颜色 = 0XFF222222
			悬浮窗布局.线性布局14.背景颜色 = 0XFF222222
			悬浮窗布局.图片框2.图片资源 = 其他_附件_WebSocket_资源.白色菜单
			悬浮窗布局.图片框3.图片资源 = 其他_附件_WebSocket_资源.白色发送
		结束 如果

		//打开主菜单
		事件 悬浮球1:悬浮窗被单击(来源事件 : 触摸事件)
			悬浮窗1.X坐标 = 悬浮球1.X坐标
			悬浮窗1.Y坐标 = 悬浮球1.Y坐标
			悬浮窗1.显示()
			悬浮球1.隐藏()
		结束 事件

		//点击编辑框弹出键盘
		事件 悬浮窗布局.自动补全编辑框1:被单击()
			悬浮窗1.弹出输入法()
		结束 事件

		//菜单按钮
		事件 悬浮窗布局.线性布局8:被单击()
			如果 菜单状态 则
				悬浮窗布局.线性布局13.可视 = 假
				菜单状态 = 假
			否则
				悬浮窗布局.线性布局13.可视 = 真
				菜单状态 = 真
			结束 如果
		结束 事件

		//提交按钮
		事件 悬浮窗布局.线性布局12:被单击()
			变量 json : 文本 = 读入资源文件(本对象,"data/websocket/CommandRequest.json")
			变量 json2 : 文本 = json.替换("%command",悬浮窗布局.自动补全编辑框1.内容)
			变量 json3 : 文本 = json2.替换("00000000-0000-0000-0000-000000000000",随机类.UUID())
			WS服务端.发送文本(连接标识,json3)
			如果 悬浮窗布局.开关5.选中 则
				悬浮窗布局.自动补全编辑框1.内容 = ""
			结束 如果
		结束 事件

		//菜单相关事件
		事件 悬浮窗布局.开关1:选中状态改变(选中 : 逻辑型)
			如果 选中 则
				变量 json : 文本 = 读入资源文件(本对象,"data/websocket/subscribe.json")
				变量 jsons : 文本 = json.替换("00000000-0000-0000-0000-000000000000",随机类.UUID())
				WS服务端.发送文本(连接标识,jsons)
			否则
				变量 json : 文本 = 读入资源文件(本对象,"data/websocket/unsubscribe.json")
				变量 jsons : 文本 = json.替换("00000000-0000-0000-0000-000000000000",随机类.UUID())
				WS服务端.发送文本(连接标识,jsons)
			结束 如果
		结束 事件
		事件 悬浮窗布局.开关2:选中状态改变(选中 : 逻辑型)
			变量 类型数组 : 文本集合 = {"AdditionalContentLoaded","AgentCommand","AgentCreated","AppPaused","AppResumed","AppSuspended","AwardAchievement","BlockBroken","BlockPlaced","BossKilled","CameraUsed","CauldronUsed","ChunkLoaded","CraftingSessionCompleted","EndOfDay","EntitySpawned","FirstTimeClientOpen","ItemAcquired","ItemCrafted","ItemDestroyed","ItemDropped","ItemEnchanted","ItemUsed","JukeboxUsed","MobInteracted","MobKilled","PlayerBounced","PlayerDied","PlayerJoin","PlayerLeave","PlayerTeleported","PlayerTransform","PortalBuilt","PortalUsed","PotionBrewed","ScreenChanged","TextToSpeechToggled","WorldLoaded","VehicleExited"}
			如果 选中 则
				循环(i, 0, 类型数组.长度)
					变量 json : 文本 = 读入资源文件(本对象,"data/websocket/subscribe2.json")
					变量 json2 : 文本 = json.替换("%eventName",类型数组[i])
					变量 jsons : 文本 = json2.替换("00000000-0000-0000-0000-000000000000",随机类.UUID())
					WS服务端.发送文本(连接标识,jsons)
				结束 循环
			否则
				循环(i, 0, 类型数组.长度)
					变量 json : 文本 = 读入资源文件(本对象,"data/websocket/unsubscribe2.json")
					变量 json2 : 文本 = json.替换("%eventName",类型数组[i])
					变量 jsons : 文本 = json2.替换("00000000-0000-0000-0000-000000000000",随机类.UUID())
					WS服务端.发送文本(连接标识,jsons)
				结束 循环
			结束 如果
		结束 事件
		事件 悬浮窗布局.相对布局7:被单击()
			写出文本文件(其他_变量.数据目录 + "logs/websockets/" + 取格式时间("YYYY-MM-DD") + " " + 取格式时间("hh:mm:ss:ms") + ".txt",悬浮窗布局.文本框2.内容)
			控制台日志("日志已保存")
			弹出提示("保存成功!")
		结束 事件

		//隐藏悬浮窗
		事件 悬浮窗布局.相对布局2:被单击()
			悬浮窗1.隐藏()
			悬浮球1.显示()
		结束 事件

	结束 方法

	//关闭悬浮球
	方法 停止悬浮窗()
		悬浮球1.关闭()
		悬浮窗1.关闭()
	结束 方法

	//获取异常
	事件 WS服务端:发生异常(异常信息 : 异常)
		控制台日志("错误信息: " + 异常信息.取异常信息().到文本())
	结束 事件

	//生成控制台日志
	方法 控制台日志(内容 : 文本)
		如果 悬浮窗布局.开关3.选中 则
			变量 内容S1 : 文本 = 文本框20.内容
			变量 内容2 : 文本 = "[" + 取格式时间("YYYY-MM-DD") + " " + 取格式时间("hh:mm:ss:ms") + "] " + 内容
			变量 内容S2 : 文本 = 内容S1 + 内容2 + "\n"
			文本框20.内容 = 内容S2
		否则
			变量 内容S1 : 文本 = 悬浮窗布局.文本框2.内容
			变量 内容2 : 文本 = "[" + 取格式时间("YYYY-MM-DD") + " " + 取格式时间("hh:mm:ss:ms") + "] " + 内容
			变量 内容S2 : 文本 = 内容S1 + 内容2 + "\n"
			悬浮窗布局.文本框2.内容 = 内容S2
			文本框20.内容 = 内容S2
		结束 如果
	结束 方法

	//设置功能按钮颜色
	方法 设置夜间模式()
		本对象.状态栏颜色 = 0XFF333333
		本对象.状态栏字体黑色 = 假
		线性布局2.背景颜色 = 0XFF333333
		线性布局3.背景颜色 = 0XFF222222
		卡片布局1.卡片背景颜色 = 0XFF222222
		文本框2.字体颜色 = 0XFFFFFFFF
		文本框3.字体颜色 = 0XFFFFFFFF
		图片框1.图片资源 = 其他_资源.白色返回图标
		滚动布局1.背景颜色 = 0XFF222222
		线性布局10.背景颜色 = 0XFF333333
		线性布局23.背景颜色 = 0XFF333333
		文本框2.字体颜色 = 0XFFFFFFFF
		文本框4.字体颜色 = 0XFFFFFFFF
		文本框5.字体颜色 = 0XFFFFFFFF
		文本框6.字体颜色 = 0XFFFFFFFF
		文本框7.字体颜色 = 0XFFFFFFFF
		文本框8.字体颜色 = 0XFFFFFFFF
		文本框9.字体颜色 = 0XFFFFFFFF
		文本框10.字体颜色 = 0XFFFFFFFF
		文本框11.字体颜色 = 0XFFFFFFFF
		文本框12.字体颜色 = 0XFFFFFFFF
		文本框13.字体颜色 = 0XFFFFFFFF
		文本框15.字体颜色 = 0XFFFFFFFF
		文本框16.字体颜色 = 0XFFFFFFFF
		文本框17.字体颜色 = 0XFFFFFFFF
		文本框18.字体颜色 = 0XFFFFFFFF
	结束 方法

结束 类

类 其他_附件_WebSocket_帮助 : 组件容器

	@布局配置([[根布局=真,宽度=-1,高度=-2,背景颜色=-1,纵向布局=真]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=35,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,@左外边距DP=20,字体颜色=-16777216]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=35,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局3,@左外边距DP=20,字体颜色=-16777216]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=35,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,@左外边距DP=20,字体颜色=-16777216]])
	变量 文本框3 : 文本框

结束 类

类 其他_附件_WebSocket_悬浮球布局 : 组件容器

	@布局配置([[根布局=真,宽度=-2,高度=-2]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度DP=30,高度DP=30,图片资源="../../../../资源库/图标/component/websocket/icon.png"]])
	变量 圆形图片框1 : 圆形图片框

结束 类

类 其他_附件_WebSocket_悬浮窗布局 : 组件容器

	@布局配置([[根布局=真,宽度=-1,高度=-1,背景颜色=-1]])
	变量 相对布局1 : 相对布局
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=45]])
	变量 相对布局2 : 相对布局
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,@左外边距DP=10,内容="控制台",字体大小=18,字体颜色=-16777216]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=线性布局2,内容="<--- 点击此处可以关闭",@左外边距DP=10]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局3,宽度DP=25,高度DP=25,@右外边距DP=10]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-1,@左外边距DP=0,@上外边距DP=45,@下外边距DP=45]])
	变量 滚动布局1 : 滚动布局
	@布局配置([[父布局=滚动布局1,宽度=-1,高度=-1]])
	变量 线性布局5 : 线性布局
	@布局配置([[父布局=线性布局5,@左外边距DP=10,@上外边距DP=10,@下外边距DP=5,@右外边距DP=10,内容="[0000-00-00 00:00:00:0] 控制台生成器",字体颜色=-16777216]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1,对齐方式=81]])
	变量 线性布局6 : 线性布局
	@布局配置([[父布局=线性布局6,宽度=-1,高度DP=45]])
	变量 相对布局3 : 相对布局
	@布局配置([[父布局=相对布局3,宽度=-1,高度=-1]])
	变量 线性布局7 : 线性布局
	@布局配置([[父布局=线性布局7,宽度DP=45,高度DP=45,对齐方式=17]])
	变量 线性布局8 : 线性布局
	@布局配置([[父布局=线性布局8,宽度DP=25,高度DP=25,图片资源="../../../../资源库/图标/component/websocket/menu.xml"]])
	变量 图片框2 : 图片框
	@布局配置([[父布局=相对布局3,宽度=-1,高度=-1,对齐方式=17]])
	变量 线性布局9 : 线性布局
	@布局配置([[父布局=线性布局9,宽度=-1,高度=-1,@左外边距DP=45,@右外边距DP=45,对齐方式=17]])
	变量 线性布局10 : 线性布局
	@布局配置([[父布局=线性布局10,宽度=-1,高度=-1,提示文本="请输入指令",内容="",背景颜色=16777215,左内边距DP=5,右内边距DP=5,最低补全字数=1]])
	变量 自动补全编辑框1 : 自动补全编辑框
	@布局配置([[父布局=相对布局3,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局11 : 线性布局
	@布局配置([[父布局=线性布局11,宽度DP=45,高度DP=45,对齐方式=17]])
	变量 线性布局12 : 线性布局
	@布局配置([[父布局=线性布局12,宽度DP=25,高度DP=25,图片资源="../../../../资源库/图标/component/websocket/submit.xml"]])
	变量 图片框3 : 图片框
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1,对齐方式=8388691,可视=假]])
	变量 线性布局13 : 线性布局
	@布局配置([[父布局=线性布局13,宽度DP=150,高度=-2,圆角=15,卡片阴影=0,@左外边距DP=10,@下外边距DP=50,背景颜色=16777215]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,纵向布局=真,背景颜色=-1]])
	变量 线性布局14 : 线性布局
	@布局配置([[父布局=线性布局14,宽度=-1,高度DP=40]])
	变量 相对布局4 : 相对布局
	@布局配置([[父布局=相对布局4,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局15 : 线性布局
	@布局配置([[父布局=线性布局15,@左外边距DP=10,字体颜色=-16777216,字体大小=15,内容="订阅聊天信息"]])
	变量 文本框4 : 文本框
	@布局配置([[父布局=相对布局4,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局16 : 线性布局
	@布局配置([[父布局=线性布局16,文本_打开="",文本_关闭="",内容="",@左外边距DP=0,@右外边距DP=10]])
	变量 开关1 : 开关
	@布局配置([[父布局=线性布局14,宽度=-1,高度DP=40]])
	变量 相对布局5 : 相对布局
	@布局配置([[父布局=相对布局5,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局17 : 线性布局
	@布局配置([[父布局=线性布局17,@左外边距DP=10,字体颜色=-16777216,字体大小=15,内容="订阅事件"]])
	变量 文本框5 : 文本框
	@布局配置([[父布局=相对布局5,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局18 : 线性布局
	@布局配置([[父布局=线性布局18,文本_打开="",文本_关闭="",内容="",@右外边距DP=10]])
	变量 开关2 : 开关
	@布局配置([[父布局=线性布局14,宽度=-1,高度DP=40]])
	变量 相对布局6 : 相对布局
	@布局配置([[父布局=相对布局6,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局19 : 线性布局
	@布局配置([[父布局=线性布局19,@左外边距DP=10,字体颜色=-16777216,字体大小=15,内容="禁止日志生成"]])
	变量 文本框6 : 文本框
	@布局配置([[父布局=相对布局6,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局20 : 线性布局
	@布局配置([[父布局=线性布局20,文本_打开="",文本_关闭="",内容="",@右外边距DP=10]])
	变量 开关3 : 开关
	@布局配置([[父布局=线性布局14,宽度=-1,高度DP=40]])
	变量 相对布局7 : 相对布局
	@布局配置([[父布局=相对布局7,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局21 : 线性布局
	@布局配置([[父布局=线性布局21,@左外边距DP=10,字体颜色=-16777216,字体大小=15,内容="保存日志"]])
	变量 文本框7 : 文本框
	@布局配置([[父布局=线性布局14,宽度=-1,高度DP=40,可视=真]])
	变量 相对布局8 : 相对布局
	@布局配置([[父布局=相对布局8,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局22 : 线性布局
	@布局配置([[父布局=线性布局22,@左外边距DP=10,字体颜色=-16777216,字体大小=15,内容="发送后输\n入框清空"]])
	变量 文本框8 : 文本框
	@布局配置([[父布局=相对布局8,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局26 : 线性布局
	@布局配置([[父布局=线性布局26,文本_打开="",文本_关闭="",内容="",@右外边距DP=10]])
	变量 开关5 : 开关

结束 类

类 其他_附件_WebSocket_资源

	@静态
	变量 启动 : 图片资源 = "../../../../资源库/图标/component/websocket/play.xml"

	@静态
	变量 停止 : 图片资源 = "../../../../资源库/图标/component/websocket/stop.xml"

	@静态
	变量 白色菜单 : 图片资源 = "../../../../资源库/图标/component/websocket/menu2.xml"

	@静态
	变量 白色发送 : 图片资源 = "../../../../资源库/图标/component/websocket/submit2.xml"

结束 类