类 项目管理_清单编辑 : 窗口

	@布局配置([[根布局=真,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局01 : 线性布局
	@布局配置([[父布局=线性布局01,高度DP=50,宽度=-1]])
	变量 相对布局01 : 相对布局
	@布局配置([[父布局=相对布局01,宽度=-1,高度DP=50,对齐方式=8388627,背景颜色=-1]])
	变量 线性布局02 : 线性布局
	@布局配置([[父布局=线性布局02,宽度DP=15,高度DP=15,图片资源="../../../../资源库/图标/back/Back_black.png",@左外边距DP=10]])
	变量 图片框01 : 图片框
	@布局配置([[父布局=线性布局02,字体大小=15,内容="项目",字体颜色=-16777216]])
	变量 文本框02 : 文本框
	@布局配置([[父布局=线性布局02,宽度DP=2,高度DP=12,@左外边距DP=10,卡片阴影=0]])
	变量 卡片布局01 : 卡片布局
	@布局配置([[父布局=卡片布局01,宽度=-1,高度=-1,背景颜色=-526087]])
	变量 线性布局03 : 线性布局
	@布局配置([[父布局=线性布局02,@左外边距DP=10,粗体=真,字体大小=16,内容="清单修改",字体颜色=-16777216]])
	变量 文本框03 : 文本框
	@布局配置([[父布局=相对布局01,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,高度DP=50,宽度DP=50,纵向布局=真,对齐方式=17,水波纹效果=真]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度DP=25,高度DP=25,图片资源="../../../../资源库/图标/management/res/manifest_save.png"]])
	变量 图片框2 : 图片框
	@布局配置([[父布局=线性布局2,字体大小=12,字体颜色=-16777216,内容="保存",对齐方式=17]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=线性布局01,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局5 : 线性布局
	@布局配置([[父布局=线性布局5,宽度=-1,高度DP=120,对齐方式=17]])
	变量 线性布局6 : 线性布局
	@布局配置([[父布局=线性布局6,宽度DP=90,高度DP=90,卡片阴影=0,圆角=30]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,对齐方式=17,背景颜色=-1,水波纹效果=真]])
	变量 线性布局7 : 线性布局
	@布局配置([[父布局=线性布局7,宽度DP=70,高度DP=70,图片资源="../../../../资源库/图标/icon.png"]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局5,宽度=-1,高度=-1,背景颜色=-1,@下外边距DP=0]])
	变量 滚动布局2 : 滚动布局
	@布局配置([[父布局=滚动布局2,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局13 : 线性布局
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=80,对齐方式=8388627,纵向布局=真]])
	变量 线性布局14 : 线性布局
	@布局配置([[父布局=线性布局14,@左外边距DP=10,粗体=真,字体颜色=-16777216,内容="项目名称"]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局14,宽度=-1,高度DP=45,卡片阴影=0,圆角=15,@左外边距DP=10,@右外边距DP=10,@上外边距DP=5]])
	变量 卡片布局2 : 卡片布局
	@布局配置([[父布局=卡片布局2,宽度=-1,高度=-1,对齐方式=17,背景颜色=-526343]])
	变量 线性布局8 : 线性布局
	@布局配置([[父布局=线性布局8,宽度=-1,高度=-1,@左外边距DP=5,@右外边距DP=5,背景颜色=16777215,提示文本颜色=-7566196,提示文本="No value",内容="",字体颜色=-16777216,单行显示=真]])
	变量 编辑框1 : 编辑框
	@布局配置([[父布局=线性布局13,宽度=-1,高度=2,背景颜色=-1513240,对齐方式=80]])
	变量 文本框4 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=80,对齐方式=8388627,纵向布局=真]])
	变量 线性布局9 : 线性布局
	@布局配置([[父布局=线性布局9,@左外边距DP=10,粗体=真,字体颜色=-16777216,内容="项目作者"]])
	变量 文本框16 : 文本框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=45,卡片阴影=0,圆角=15,@左外边距DP=10,@右外边距DP=10,@上外边距DP=5]])
	变量 卡片布局3 : 卡片布局
	@布局配置([[父布局=卡片布局3,宽度=-1,高度=-1,对齐方式=17,背景颜色=-526343]])
	变量 线性布局24 : 线性布局
	@布局配置([[父布局=线性布局24,宽度=-1,高度=-1,@左外边距DP=5,@右外边距DP=5,背景颜色=16777215,提示文本="No value",提示文本颜色=-7566196,内容="",单行显示=真]])
	变量 编辑框2 : 编辑框
	@布局配置([[父布局=线性布局13,宽度=-1,高度=2,背景颜色=-1513240,对齐方式=80]])
	变量 文本框8 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=80,对齐方式=8388627,纵向布局=真]])
	变量 线性布局10 : 线性布局
	@布局配置([[父布局=线性布局10,@左外边距DP=10,粗体=真,字体颜色=-16777216,内容="项目版本"]])
	变量 文本框17 : 文本框
	@布局配置([[父布局=线性布局10,宽度=-1,高度DP=45,卡片阴影=0,圆角=15,@左外边距DP=10,@右外边距DP=10,@上外边距DP=5]])
	变量 卡片布局4 : 卡片布局
	@布局配置([[父布局=卡片布局4,宽度=-1,高度=-1,对齐方式=17,背景颜色=-526343]])
	变量 线性布局23 : 线性布局
	@布局配置([[父布局=线性布局23,宽度=-1,高度=-1,@左外边距DP=5,@右外边距DP=5,背景颜色=16777215,提示文本="No value",提示文本颜色=-7566196,内容="",单行显示=真]])
	变量 编辑框3 : 编辑框
	@布局配置([[父布局=线性布局13,宽度=-1,高度=2,背景颜色=-1513240,对齐方式=80]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=80,对齐方式=8388627,纵向布局=真]])
	变量 线性布局11 : 线性布局
	@布局配置([[父布局=线性布局11,@左外边距DP=10,粗体=真,字体颜色=-16777216,内容="项目描述"]])
	变量 文本框18 : 文本框
	@布局配置([[父布局=线性布局11,宽度=-1,高度DP=45,卡片阴影=0,圆角=15,@左外边距DP=10,@右外边距DP=10,@上外边距DP=5]])
	变量 卡片布局5 : 卡片布局
	@布局配置([[父布局=卡片布局5,宽度=-1,高度=-1,对齐方式=17,背景颜色=-526343]])
	变量 线性布局25 : 线性布局
	@布局配置([[父布局=线性布局25,宽度=-1,高度=-1,@左外边距DP=5,@右外边距DP=5,背景颜色=16777215,内容="",提示文本="No value",提示文本颜色=-7566196]])
	变量 编辑框4 : 编辑框
	@布局配置([[父布局=线性布局13,宽度=-1,高度=2,背景颜色=-1513240,对齐方式=80]])
	变量 文本框5 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=80,对齐方式=8388627,纵向布局=真]])
	变量 线性布局12 : 线性布局
	@布局配置([[父布局=线性布局12,@左外边距DP=10,粗体=真,字体颜色=-16777216,内容="语法版本(皮肤包:1 ,附加包:2)"]])
	变量 文本框19 : 文本框
	@布局配置([[父布局=线性布局12,宽度=-1,高度DP=45,卡片阴影=0,圆角=15,@左外边距DP=10,@右外边距DP=10,@上外边距DP=5]])
	变量 卡片布局6 : 卡片布局
	@布局配置([[父布局=卡片布局6,宽度=-1,高度=-1,对齐方式=17,背景颜色=-526343]])
	变量 线性布局26 : 线性布局
	@布局配置([[父布局=线性布局26,宽度=-1,高度=-1,@左外边距DP=5,@右外边距DP=5,背景颜色=16777215,提示文本="No value",提示文本颜色=-7566196,内容="",单行显示=真]])
	变量 编辑框5 : 编辑框
	@布局配置([[父布局=线性布局13,宽度=-1,高度=2,背景颜色=-1513240,对齐方式=80]])
	变量 文本框6 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=80,对齐方式=8388627,纵向布局=真]])
	变量 线性布局15 : 线性布局
	@布局配置([[父布局=线性布局15,@左外边距DP=10,粗体=真,字体颜色=-16777216,内容="原版"]])
	变量 文本框20 : 文本框
	@布局配置([[父布局=线性布局15,宽度=-1,高度DP=45,卡片阴影=0,圆角=15,@左外边距DP=10,@右外边距DP=10,@上外边距DP=5]])
	变量 卡片布局7 : 卡片布局
	@布局配置([[父布局=卡片布局7,宽度=-1,高度=-1,对齐方式=17,背景颜色=-526343]])
	变量 线性布局27 : 线性布局
	@布局配置([[父布局=线性布局27,宽度=-1,高度=-1,@左外边距DP=5,@右外边距DP=5,背景颜色=16777215,提示文本="No value",提示文本颜色=-7566196,内容="",单行显示=真]])
	变量 编辑框6 : 编辑框
	@布局配置([[父布局=线性布局13,宽度=-1,高度=2,背景颜色=-1513240,对齐方式=80]])
	变量 文本框7 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=80,对齐方式=8388627,纵向布局=真]])
	变量 线性布局16 : 线性布局
	@布局配置([[父布局=线性布局16,@左外边距DP=10,粗体=真,字体颜色=-16777216,内容="基础游戏版本"]])
	变量 文本框21 : 文本框
	@布局配置([[父布局=线性布局16,宽度=-1,高度DP=45,卡片阴影=0,圆角=15,@左外边距DP=10,@右外边距DP=10,@上外边距DP=5]])
	变量 卡片布局8 : 卡片布局
	@布局配置([[父布局=卡片布局8,宽度=-1,高度=-1,对齐方式=17,背景颜色=-526343]])
	变量 线性布局28 : 线性布局
	@布局配置([[父布局=线性布局28,宽度=-1,高度=-1,@左外边距DP=5,@右外边距DP=5,背景颜色=16777215,单行显示=真,提示文本="No value",提示文本颜色=-7566196,内容=""]])
	变量 编辑框7 : 编辑框
	@布局配置([[父布局=线性布局13,宽度=-1,高度=2,背景颜色=-1513240,对齐方式=80]])
	变量 文本框9 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=80,对齐方式=8388627,纵向布局=真]])
	变量 线性布局17 : 线性布局
	@布局配置([[父布局=线性布局17,@左外边距DP=10,粗体=真,字体颜色=-16777216,内容="最低引擎版本"]])
	变量 文本框22 : 文本框
	@布局配置([[父布局=线性布局17,宽度=-1,高度DP=45,卡片阴影=0,圆角=15,@左外边距DP=10,@右外边距DP=10,@上外边距DP=5]])
	变量 卡片布局9 : 卡片布局
	@布局配置([[父布局=卡片布局9,宽度=-1,高度=-1,对齐方式=17,背景颜色=-526343]])
	变量 线性布局29 : 线性布局
	@布局配置([[父布局=线性布局29,宽度=-1,高度=-1,@左外边距DP=5,@右外边距DP=5,背景颜色=16777215,提示文本="No value",提示文本颜色=-7566196,单行显示=真]])
	变量 编辑框8 : 编辑框
	@布局配置([[父布局=线性布局13,宽度=-1,高度=2,背景颜色=-1513240,对齐方式=80]])
	变量 文本框10 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=80,对齐方式=8388627,纵向布局=真]])
	变量 线性布局18 : 线性布局
	@布局配置([[父布局=线性布局18,@左外边距DP=10,粗体=真,字体颜色=-16777216,内容="通行证"]])
	变量 文本框23 : 文本框
	@布局配置([[父布局=线性布局18,宽度=-1,高度DP=45,卡片阴影=0,圆角=15,@左外边距DP=10,@右外边距DP=10,@上外边距DP=5]])
	变量 卡片布局10 : 卡片布局
	@布局配置([[父布局=卡片布局10,宽度=-1,高度=-1,对齐方式=17,背景颜色=-526343]])
	变量 线性布局30 : 线性布局
	@布局配置([[父布局=线性布局30,宽度=-1,高度=-1,@左外边距DP=5,@右外边距DP=5,背景颜色=16777215,提示文本="No value",提示文本颜色=-7566196,单行显示=真]])
	变量 编辑框9 : 编辑框
	@布局配置([[父布局=线性布局13,宽度=-1,高度=2,背景颜色=-1513240,对齐方式=80]])
	变量 文本框11 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=80,对齐方式=8388627,纵向布局=真]])
	变量 线性布局19 : 线性布局
	@布局配置([[父布局=线性布局19,@左外边距DP=10,粗体=真,字体颜色=-16777216,内容="网址"]])
	变量 文本框24 : 文本框
	@布局配置([[父布局=线性布局19,宽度=-1,高度DP=45,卡片阴影=0,圆角=15,@左外边距DP=10,@右外边距DP=10,@上外边距DP=5]])
	变量 卡片布局11 : 卡片布局
	@布局配置([[父布局=卡片布局11,宽度=-1,高度=-1,对齐方式=17,背景颜色=-526343]])
	变量 线性布局31 : 线性布局
	@布局配置([[父布局=线性布局31,宽度=-1,高度=-1,@左外边距DP=5,@右外边距DP=5,背景颜色=16777215,提示文本="NO url",提示文本颜色=-7566196,单行显示=真]])
	变量 编辑框10 : 编辑框
	@布局配置([[父布局=线性布局13,宽度=-1,高度=2,背景颜色=-1513240,对齐方式=80]])
	变量 文本框12 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=80,对齐方式=8388627,纵向布局=真]])
	变量 线性布局20 : 线性布局
	@布局配置([[父布局=线性布局20,@左外边距DP=10,粗体=真,字体颜色=-16777216,内容="脚本描述"]])
	变量 文本框25 : 文本框
	@布局配置([[父布局=线性布局20,宽度=-1,高度DP=45,卡片阴影=0,圆角=15,@左外边距DP=10,@右外边距DP=10,@上外边距DP=5]])
	变量 卡片布局12 : 卡片布局
	@布局配置([[父布局=卡片布局12,宽度=-1,高度=-1,对齐方式=17,背景颜色=-526343]])
	变量 线性布局32 : 线性布局
	@布局配置([[父布局=线性布局32,宽度=-1,高度=-1,@左外边距DP=5,@右外边距DP=5,背景颜色=16777215,提示文本="No value",提示文本颜色=-7566196]])
	变量 编辑框11 : 编辑框
	@布局配置([[父布局=线性布局13,宽度=-1,高度=2,背景颜色=-1513240,对齐方式=80]])
	变量 文本框13 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=80,对齐方式=8388627,纵向布局=真]])
	变量 线性布局21 : 线性布局
	@布局配置([[父布局=线性布局21,@左外边距DP=10,粗体=真,字体颜色=-16777216,内容="脚本版本"]])
	变量 文本框26 : 文本框
	@布局配置([[父布局=线性布局21,宽度=-1,高度DP=45,卡片阴影=0,圆角=15,@左外边距DP=10,@右外边距DP=10,@上外边距DP=5]])
	变量 卡片布局13 : 卡片布局
	@布局配置([[父布局=卡片布局13,宽度=-1,高度=-1,对齐方式=17,背景颜色=-526343]])
	变量 线性布局33 : 线性布局
	@布局配置([[父布局=线性布局33,宽度=-1,高度=-1,@左外边距DP=5,@右外边距DP=5,背景颜色=16777215,提示文本="No value",提示文本颜色=-7566196,单行显示=真]])
	变量 编辑框12 : 编辑框
	@布局配置([[父布局=线性布局13,宽度=-1,高度=2,背景颜色=-1513240,对齐方式=80]])
	变量 文本框14 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=80,对齐方式=8388627,纵向布局=真]])
	变量 线性布局22 : 线性布局
	@布局配置([[父布局=线性布局22,@左外边距DP=10,粗体=真,字体颜色=-16777216,内容="脚本入口"]])
	变量 文本框27 : 文本框
	@布局配置([[父布局=线性布局22,宽度=-1,高度DP=45,卡片阴影=0,圆角=15,@左外边距DP=10,@右外边距DP=10,@上外边距DP=5]])
	变量 卡片布局14 : 卡片布局
	@布局配置([[父布局=卡片布局14,宽度=-1,高度=-1,对齐方式=17,背景颜色=-526343]])
	变量 线性布局34 : 线性布局
	@布局配置([[父布局=线性布局34,宽度=-1,高度=-1,@左外边距DP=5,@右外边距DP=5,背景颜色=16777215,提示文本颜色=-7566196,提示文本="Default: scripts/Main.js ",单行显示=真]])
	变量 编辑框13 : 编辑框

	//变量
	变量 图片位置 : 文本
	变量 项目名称 : 文本

	//声明
	变量 设置_设定 : 设置_设定
	变量 图片选择器:文件选择器
	变量 信息 : 启动信息

	事件 项目管理_清单编辑:创建完毕()
		//设置主题
		本对象.显示标题栏 = 假
		本对象.状态栏颜色 = 0XFFFFFFFF
		本对象.状态栏字体黑色 = 真
		//窗口切换动画
		播放默认切换动画(2)
		//加载夜间模试
		如果 设置_设定.获取开关("NightMode") 则
			设置夜间模式()
		结束 如果
		//设置背景
		变量 设置相关路径 : 文本 = 设置_设定.获取文本("PersonalityBackground")
		如果 设置相关路径.替换(" ","") == "" 则
		否则
			如果 文件是否存在(设置相关路径) 则
				设置_设置.设置布局背景(本对象,线性布局5,设置相关路径)
			结束 如果
		结束 如果
		//退出按钮
		事件 图片框01:被单击()
			关闭窗口()
		结束 事件
		事件 文本框02:被单击()
			关闭窗口()
		结束 事件
		//获取项目名称
		变量 信息 : 启动信息 = 取启动信息()
		项目名称 = 信息.取文本("项目名称")
		//加载图标
		图片框1.图片路径 = 其他_变量.项目目录 + 项目名称 + "/icon.png"
		//加载清单
		变量 清单文件内容 : 文本 = 读入文本文件(其他_变量.项目目录 + 项目名称 + "/manifest.json","utf-8")
		变量 json清单文件内容 : JSON对象 = 清单文件内容
		//获取设置基本json属性
		编辑框1.内容 = json清单文件内容["Name"].到文本()
		编辑框2.内容 = json清单文件内容["Author"].到文本()
		编辑框3.内容 = json清单文件内容["Version"].到文本()
		编辑框4.内容 = json清单文件内容["Describe"].到文本()
		//游戏版本
		变量 json清单文件内容Edition : JSON对象 = json清单文件内容["Edition"].到文本()
		编辑框5.内容 = json清单文件内容Edition["format_version"].到文本()
		编辑框6.内容 = json清单文件内容Edition["vanilla"].到文本()
		编辑框7.内容 = json清单文件内容Edition["base_game_version"].到文本()
		编辑框8.内容 = json清单文件内容Edition["min_engine_version"].到文本()
		//元数据
		变量 json清单文件内容Metadata : JSON对象 = json清单文件内容["Metadata"].到文本()
		编辑框9.内容 = json清单文件内容Metadata["license"].到文本()
		编辑框10.内容 = json清单文件内容Metadata["url"].到文本()
		//获得设置JS
		变量 json清单文件内容JS : JSON对象 = json清单文件内容["JavaScript"].到文本()
		编辑框11.内容 = json清单文件内容JS["description"].到文本()
		编辑框12.内容 = json清单文件内容JS["version"].到文本()
		编辑框13.内容 = json清单文件内容JS["entry"].到文本()
		//订阅事件
		订阅事件()
	结束 事件

	//窗口被重新启动时触发该事件
	事件 项目管理_清单编辑:被重新启动()
		//窗口切换动画
		播放默认切换动画(2)
	结束 事件

	//设置功能按钮颜色
	方法 设置夜间模式()
		本对象.状态栏颜色 = 0XFF333333
		本对象.状态栏字体黑色 = 假
		线性布局02.背景颜色 = 0XFF333333
		线性布局03.背景颜色 = 0XFF222222
		卡片布局01.卡片背景颜色 = 0XFF222222
		文本框02.字体颜色 = 0XFFFFFFFF
		文本框03.字体颜色 = 0XFFFFFFFF
		图片框01.图片资源 = 其他_资源.白色返回图标
		线性布局5.背景颜色 = 0XFF222222
		文本框2.字体颜色 = 0XFFFFFFFF
		文本框16.字体颜色 = 0XFFFFFFFF
		文本框17.字体颜色 = 0XFFFFFFFF
		文本框18.字体颜色 = 0XFFFFFFFF
		文本框19.字体颜色 = 0XFFFFFFFF
		文本框20.字体颜色 = 0XFFFFFFFF
		文本框21.字体颜色 = 0XFFFFFFFF
		文本框22.字体颜色 = 0XFFFFFFFF
		文本框23.字体颜色 = 0XFFFFFFFF
		文本框24.字体颜色 = 0XFFFFFFFF
		文本框25.字体颜色 = 0XFFFFFFFF
		文本框26.字体颜色 = 0XFFFFFFFF
		文本框27.字体颜色 = 0XFFFFFFFF
		线性布局7.背景颜色 = 0XFF333333
		卡片布局1.卡片背景颜色 = 0XFF333333
		线性布局14.背景颜色 = 0XFF333333
		线性布局9.背景颜色 = 0XFF333333
		线性布局10.背景颜色 = 0XFF333333
		线性布局11.背景颜色 = 0XFF333333
		线性布局12.背景颜色 = 0XFF333333
		线性布局13.背景颜色 = 0XFF333333
		线性布局14.背景颜色 = 0XFF333333
		线性布局15.背景颜色 = 0XFF333333
		线性布局16.背景颜色 = 0XFF333333
		线性布局17.背景颜色 = 0XFF333333
		线性布局18.背景颜色 = 0XFF333333
		线性布局19.背景颜色 = 0XFF333333
		线性布局20.背景颜色 = 0XFF333333
		线性布局21.背景颜色 = 0XFF333333
		线性布局22.背景颜色 = 0XFF333333
		文本框4.背景颜色 = 0XFF222222
		文本框8.背景颜色 = 0XFF222222
		文本框3.背景颜色 = 0XFF222222
		文本框4.背景颜色 = 0XFF222222
		文本框5.背景颜色 = 0XFF222222
		文本框6.背景颜色 = 0XFF222222
		文本框7.背景颜色 = 0XFF222222
		文本框8.背景颜色 = 0XFF222222
		文本框9.背景颜色 = 0XFF222222
		文本框10.背景颜色 = 0XFF222222
		文本框11.背景颜色 = 0XFF222222
		文本框12.背景颜色 = 0XFF222222
		文本框13.背景颜色 = 0XFF222222
		文本框14.背景颜色 = 0XFF222222
		图片框2.图片资源 = 项目管理_资源.白色图标保存清单
		文本框1.字体颜色 = 0XFFFFFFFF
		卡片布局2.卡片背景颜色 = 0X00FFFFFF
		卡片布局3.卡片背景颜色 = 0X00FFFFFF
		卡片布局4.卡片背景颜色 = 0X00FFFFFF
		卡片布局5.卡片背景颜色 = 0X00FFFFFF
		卡片布局6.卡片背景颜色 = 0X00FFFFFF
		卡片布局7.卡片背景颜色 = 0X00FFFFFF
		卡片布局8.卡片背景颜色 = 0X00FFFFFF
		卡片布局9.卡片背景颜色 = 0X00FFFFFF
		卡片布局10.卡片背景颜色 = 0X00FFFFFF
		卡片布局11.卡片背景颜色 = 0X00FFFFFF
		卡片布局12.卡片背景颜色 = 0X00FFFFFF
		卡片布局13.卡片背景颜色 = 0X00FFFFFF
		卡片布局14.卡片背景颜色 = 0X00FFFFFF
		组件样式操作.置圆角背景边框(线性布局8,0XFF333333,2,0XFF222222,15,15,15,15)
		组件样式操作.置圆角背景边框(线性布局24,0XFF333333,2,0XFF222222,15,15,15,15)
		组件样式操作.置圆角背景边框(线性布局23,0XFF333333,2,0XFF222222,15,15,15,15)
		组件样式操作.置圆角背景边框(线性布局25,0XFF333333,2,0XFF222222,15,15,15,15)
		组件样式操作.置圆角背景边框(线性布局26,0XFF333333,2,0XFF222222,15,15,15,15)
		组件样式操作.置圆角背景边框(线性布局27,0XFF333333,2,0XFF222222,15,15,15,15)
		组件样式操作.置圆角背景边框(线性布局28,0XFF333333,2,0XFF222222,15,15,15,15)
		组件样式操作.置圆角背景边框(线性布局29,0XFF333333,2,0XFF222222,15,15,15,15)
		组件样式操作.置圆角背景边框(线性布局30,0XFF333333,2,0XFF222222,15,15,15,15)
		组件样式操作.置圆角背景边框(线性布局31,0XFF333333,2,0XFF222222,15,15,15,15)
		组件样式操作.置圆角背景边框(线性布局32,0XFF333333,2,0XFF222222,15,15,15,15)
		组件样式操作.置圆角背景边框(线性布局33,0XFF333333,2,0XFF222222,15,15,15,15)
		组件样式操作.置圆角背景边框(线性布局34,0XFF333333,2,0XFF222222,15,15,15,15)
		编辑框1.字体颜色 = 0XFFFFFFFF
		编辑框2.字体颜色 = 0XFFFFFFFF
		编辑框3.字体颜色 = 0XFFFFFFFF
		编辑框4.字体颜色 = 0XFFFFFFFF
		编辑框5.字体颜色 = 0XFFFFFFFF
		编辑框6.字体颜色 = 0XFFFFFFFF
		编辑框7.字体颜色 = 0XFFFFFFFF
		编辑框8.字体颜色 = 0XFFFFFFFF
		编辑框9.字体颜色 = 0XFFFFFFFF
		编辑框10.字体颜色 = 0XFFFFFFFF
		编辑框11.字体颜色 = 0XFFFFFFFF
		编辑框12.字体颜色 = 0XFFFFFFFF
		编辑框13.字体颜色 = 0XFFFFFFFF
	结束 方法

	//选择图片
	事件 线性布局7:被单击()
		图片选择器.选择图片(本对象,1234)
	结束 事件
	//保存文件
	事件 线性布局2:被单击()
		保存清单文件(图片位置)
	结束 事件

	//代码回调(获得图标路径)
	事件 项目管理_清单编辑:获得返回数据(请求码 : 整数,结果码 : 整数,数据 : 启动信息)
		图片位置 = 图片选择器.解析图片地址(本对象,数据)
		图片框1.图片路径 = 图片位置
	结束 事件

	//方法
	方法 保存清单文件(图标路径 : 文本)
		变量 清单文件内容 : 文本 = 读入文本文件(其他_变量.项目目录 + 项目名称 + "/manifest.json","utf-8")
		变量 json清单文件内容 : JSON对象 = 清单文件内容
		变量 json : JSON对象 = 读入文本文件(其他_变量.项目目录 + 项目名称 + "/manifest.json","utf-8")
		变量 jsonversion : JSON对象 = [[{}]]
		变量 jsonmetadata : JSON对象 = [[{}]]
		变量 jsonjavascript : JSON对象 = [[{}]]
		//替换图标
		复制文件(图标路径,其他_变量.项目目录 + 项目名称 + "/icon.png")
		//基础
		json["Icon"] = 图标路径
		json["Name"] = 编辑框1.内容
		json["Author"] = 编辑框2.内容
		json["Version"] = 编辑框3.内容
		json["Describe"] = 编辑框4.内容
		//版本
		jsonversion["format_version"] = 编辑框5.内容
		jsonversion["vanilla"] = 编辑框6.内容
		jsonversion["base_game_version"] = 编辑框7.内容
		jsonversion["min_engine_version"] = 编辑框8.内容
		//元数据
		jsonmetadata["authors"] = 编辑框2.内容
		jsonmetadata["license"] = 编辑框9.内容
		jsonmetadata["url"] = 编辑框10.内容
		//generated_with子原数据
		变量 generatedwith: JSON对象 = [[{}]]
		generatedwith["example_tool"] = "【1.0.0,1.0.1】"
		变量 新对象generatedwith : JSON对象 = generatedwith
		jsonmetadata["generated_with"] = 新对象generatedwith
		//javascript Java脚本
		变量 json清单文件内容JSUUID : JSON对象 = json清单文件内容["JavaScript"].到文本()
		jsonjavascript["description"] = 编辑框11.内容
		jsonjavascript["version"] = 编辑框12.内容
		jsonjavascript["entry"] = 编辑框13.内容
		jsonjavascript["uuid"] = json清单文件内容JSUUID["uuid"].到文本()
		//设置JSON对象变量
		变量 新对象version : JSON对象 = jsonversion
		变量 新对象metadata : JSON对象 = jsonmetadata
		变量 新对象jsonjavascript : JSON对象 = jsonjavascript
		//添加
		json["Edition"] = 新对象version
		json["Metadata"] = 新对象metadata
		json["JavaScript"] = 新对象jsonjavascript
		变量 jsonout = json.到文本(4)
		写出文本文件(其他_变量.项目目录 + 项目名称 + "/manifest.json",jsonout)
		//提示
		弹出成功提示("清单保存完毕")
	结束 方法

结束 类