类 编辑器_项目编辑器_新建 : 组件容器

	@布局配置([[根布局=真,宽度=-1,高度=-2,背景颜色=-1,纵向布局=真]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=45]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度=-1,高度=-1]])
	变量 相对布局1 : 相对布局
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局3,宽度DP=80,高度DP=30,@左外边距DP=20,圆角=15,卡片阴影=0]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,对齐方式=17,背景颜色=-14575885,水波纹效果=真]])
	变量 帮助菜单按钮 : 线性布局
	@布局配置([[父布局=帮助菜单按钮,字体颜色=-1,内容="帮助"]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局5 : 线性布局
	@布局配置([[父布局=线性布局5,宽度DP=80,高度DP=30,圆角=15,卡片阴影=0,@右外边距DP=20]])
	变量 卡片布局2 : 卡片布局
	@布局配置([[父布局=卡片布局2,宽度=-1,高度=-1,对齐方式=17,背景颜色=-44462,水波纹效果=真]])
	变量 关闭菜单按钮 : 线性布局
	@布局配置([[父布局=关闭菜单按钮,字体颜色=-1,内容="关闭"]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局1,宽度=-1,纵向布局=真,高度=-2]])
	变量 线性布局7 : 线性布局
	@布局配置([[父布局=线性布局7,高度DP=90,对齐方式=17,宽度=-1,背景颜色=-855051]])
	变量 线性布局8 : 线性布局
	@布局配置([[父布局=线性布局8,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15]])
	变量 卡片布局3 : 卡片布局
	@布局配置([[父布局=卡片布局3,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真,水波纹效果=真]])
	变量 线性布局9 : 线性布局
	@布局配置([[父布局=线性布局9,宽度DP=35,高度DP=35]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局9,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216,内容="物品"]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局8,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局4 : 卡片布局
	@布局配置([[父布局=卡片布局4,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真,水波纹效果=真]])
	变量 线性布局10 : 线性布局
	@布局配置([[父布局=线性布局10,宽度DP=35,高度DP=35]])
	变量 图片框2 : 图片框
	@布局配置([[父布局=线性布局10,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216,内容="标题"]])
	变量 文本框4 : 文本框
	@布局配置([[父布局=线性布局8,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局5 : 卡片布局
	@布局配置([[父布局=卡片布局5,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真,水波纹效果=真]])
	变量 线性布局11 : 线性布局
	@布局配置([[父布局=线性布局11,宽度DP=35,高度DP=35]])
	变量 图片框3 : 图片框
	@布局配置([[父布局=线性布局11,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216,内容="标题"]])
	变量 文本框5 : 文本框
	@布局配置([[父布局=线性布局8,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局6 : 卡片布局
	@布局配置([[父布局=卡片布局6,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真,水波纹效果=真]])
	变量 线性布局12 : 线性布局
	@布局配置([[父布局=线性布局12,宽度DP=35,高度DP=35]])
	变量 图片框4 : 图片框
	@布局配置([[父布局=线性布局12,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216,内容="标题"]])
	变量 文本框6 : 文本框
	@布局配置([[父布局=线性布局7,高度DP=90,对齐方式=17,宽度=-1,背景颜色=-855051,可视=假]])
	变量 线性布局13 : 线性布局
	@布局配置([[父布局=线性布局13,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15]])
	变量 卡片布局7 : 卡片布局
	@布局配置([[父布局=卡片布局7,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局17 : 线性布局
	@布局配置([[父布局=线性布局17,宽度DP=35,高度DP=35]])
	变量 图片框5 : 图片框
	@布局配置([[父布局=线性布局17,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框10 : 文本框
	@布局配置([[父布局=线性布局13,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局8 : 卡片布局
	@布局配置([[父布局=卡片布局8,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局16 : 线性布局
	@布局配置([[父布局=线性布局16,宽度DP=35,高度DP=35]])
	变量 图片框6 : 图片框
	@布局配置([[父布局=线性布局16,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框9 : 文本框
	@布局配置([[父布局=线性布局13,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局9 : 卡片布局
	@布局配置([[父布局=卡片布局9,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真,水波纹效果=真]])
	变量 配方按钮 : 线性布局
	@布局配置([[父布局=配方按钮,宽度DP=35,高度DP=35]])
	变量 图片框7 : 图片框
	@布局配置([[父布局=配方按钮,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216,内容="配方"]])
	变量 文本框8 : 文本框
	@布局配置([[父布局=线性布局13,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局10 : 卡片布局
	@布局配置([[父布局=卡片布局10,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真,水波纹效果=真]])
	变量 函数按钮 : 线性布局
	@布局配置([[父布局=函数按钮,宽度DP=35,高度DP=35]])
	变量 图片框8 : 图片框
	@布局配置([[父布局=函数按钮,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216,内容="函数"]])
	变量 文本框7 : 文本框
	@布局配置([[父布局=线性布局7,高度DP=90,对齐方式=17,宽度=-1,背景颜色=-855051,可视=假]])
	变量 线性布局18 : 线性布局
	@布局配置([[父布局=线性布局18,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15]])
	变量 卡片布局11 : 卡片布局
	@布局配置([[父布局=卡片布局11,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真,水波纹效果=真]])
	变量 结构按钮 : 线性布局
	@布局配置([[父布局=结构按钮,宽度DP=35,高度DP=35]])
	变量 图片框9 : 图片框
	@布局配置([[父布局=结构按钮,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216,内容="结构"]])
	变量 文本框14 : 文本框
	@布局配置([[父布局=线性布局18,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局12 : 卡片布局
	@布局配置([[父布局=卡片布局12,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局21 : 线性布局
	@布局配置([[父布局=线性布局21,宽度DP=35,高度DP=35]])
	变量 图片框10 : 图片框
	@布局配置([[父布局=线性布局21,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框13 : 文本框
	@布局配置([[父布局=线性布局18,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局13 : 卡片布局
	@布局配置([[父布局=卡片布局13,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局20 : 线性布局
	@布局配置([[父布局=线性布局20,宽度DP=35,高度DP=35]])
	变量 图片框11 : 图片框
	@布局配置([[父布局=线性布局20,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框12 : 文本框
	@布局配置([[父布局=线性布局18,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局14 : 卡片布局
	@布局配置([[父布局=卡片布局14,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局19 : 线性布局
	@布局配置([[父布局=线性布局19,宽度DP=35,高度DP=35]])
	变量 图片框12 : 图片框
	@布局配置([[父布局=线性布局19,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框11 : 文本框
	@布局配置([[父布局=线性布局7,高度DP=90,对齐方式=17,宽度=-1,背景颜色=-855051,可视=假]])
	变量 线性布局23 : 线性布局
	@布局配置([[父布局=线性布局23,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15]])
	变量 卡片布局15 : 卡片布局
	@布局配置([[父布局=卡片布局15,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局37 : 线性布局
	@布局配置([[父布局=线性布局37,宽度DP=35,高度DP=35]])
	变量 图片框24 : 图片框
	@布局配置([[父布局=线性布局37,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框26 : 文本框
	@布局配置([[父布局=线性布局23,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局20 : 卡片布局
	@布局配置([[父布局=卡片布局20,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局36 : 线性布局
	@布局配置([[父布局=线性布局36,宽度DP=35,高度DP=35]])
	变量 图片框23 : 图片框
	@布局配置([[父布局=线性布局36,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框25 : 文本框
	@布局配置([[父布局=线性布局23,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局21 : 卡片布局
	@布局配置([[父布局=卡片布局21,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局35 : 线性布局
	@布局配置([[父布局=线性布局35,宽度DP=35,高度DP=35]])
	变量 图片框22 : 图片框
	@布局配置([[父布局=线性布局35,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框24 : 文本框
	@布局配置([[父布局=线性布局23,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局22 : 卡片布局
	@布局配置([[父布局=卡片布局22,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局34 : 线性布局
	@布局配置([[父布局=线性布局34,宽度DP=35,高度DP=35]])
	变量 图片框21 : 图片框
	@布局配置([[父布局=线性布局34,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框23 : 文本框
	@布局配置([[父布局=线性布局7,高度DP=90,对齐方式=17,宽度=-1,背景颜色=-855051,可视=假]])
	变量 线性布局24 : 线性布局
	@布局配置([[父布局=线性布局24,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15]])
	变量 卡片布局16 : 卡片布局
	@布局配置([[父布局=卡片布局16,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局33 : 线性布局
	@布局配置([[父布局=线性布局33,宽度DP=35,高度DP=35]])
	变量 图片框20 : 图片框
	@布局配置([[父布局=线性布局33,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框22 : 文本框
	@布局配置([[父布局=线性布局24,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局19 : 卡片布局
	@布局配置([[父布局=卡片布局19,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局32 : 线性布局
	@布局配置([[父布局=线性布局32,宽度DP=35,高度DP=35]])
	变量 图片框19 : 图片框
	@布局配置([[父布局=线性布局32,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框21 : 文本框
	@布局配置([[父布局=线性布局24,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局23 : 卡片布局
	@布局配置([[父布局=卡片布局23,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局31 : 线性布局
	@布局配置([[父布局=线性布局31,宽度DP=35,高度DP=35]])
	变量 图片框18 : 图片框
	@布局配置([[父布局=线性布局31,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框20 : 文本框
	@布局配置([[父布局=线性布局24,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局24 : 卡片布局
	@布局配置([[父布局=卡片布局24,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局30 : 线性布局
	@布局配置([[父布局=线性布局30,宽度DP=35,高度DP=35]])
	变量 图片框17 : 图片框
	@布局配置([[父布局=线性布局30,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框19 : 文本框
	@布局配置([[父布局=线性布局7,高度DP=90,对齐方式=17,宽度=-1,背景颜色=-855051,可视=假]])
	变量 线性布局25 : 线性布局
	@布局配置([[父布局=线性布局25,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15]])
	变量 卡片布局17 : 卡片布局
	@布局配置([[父布局=卡片布局17,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局29 : 线性布局
	@布局配置([[父布局=线性布局29,宽度DP=35,高度DP=35]])
	变量 图片框16 : 图片框
	@布局配置([[父布局=线性布局29,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框18 : 文本框
	@布局配置([[父布局=线性布局25,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局18 : 卡片布局
	@布局配置([[父布局=卡片布局18,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局28 : 线性布局
	@布局配置([[父布局=线性布局28,宽度DP=35,高度DP=35]])
	变量 图片框15 : 图片框
	@布局配置([[父布局=线性布局28,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框17 : 文本框
	@布局配置([[父布局=线性布局25,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局25 : 卡片布局
	@布局配置([[父布局=卡片布局25,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局27 : 线性布局
	@布局配置([[父布局=线性布局27,宽度DP=35,高度DP=35]])
	变量 图片框14 : 图片框
	@布局配置([[父布局=线性布局27,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框16 : 文本框
	@布局配置([[父布局=线性布局25,宽度DP=75,高度DP=75,卡片阴影=0,圆角=15,@左外边距DP=10]])
	变量 卡片布局26 : 卡片布局
	@布局配置([[父布局=卡片布局26,宽度=-1,高度=-1,背景颜色=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局26 : 线性布局
	@布局配置([[父布局=线性布局26,宽度DP=35,高度DP=35]])
	变量 图片框13 : 图片框
	@布局配置([[父布局=线性布局26,对齐方式=17,@上外边距DP=3,字体大小=13,字体颜色=-16777216]])
	变量 文本框15 : 文本框

结束 类