类 编辑器_项目编辑器_附属_动画编辑器 : 窗口

	@布局配置([[根布局=真,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=50,对齐方式=8388627,背景颜色=-1]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度DP=15,高度DP=15,图片资源="../../../../../资源库/图标/back/Back_black.png",@左外边距DP=10]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局2,字体大小=15,内容="项目",字体颜色=-16777216]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局2,宽度DP=2,高度DP=12,@左外边距DP=10,卡片阴影=0]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,背景颜色=-526087]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局2,@左外边距DP=10,粗体=真,字体大小=16,内容="动画编辑器",字体颜色=-16777216]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局1,宽度=-1,高度=-1,纵向布局=真,内边距DP=5]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,宽度=-1,高度DP=45,背景颜色=-1]])
	变量 相对布局1 : 相对布局
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局7 : 线性布局
	@布局配置([[父布局=线性布局7,@左外边距DP=10,字体大小=15,粗体=真,内容="ID：",字体颜色=-16777216]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局5 : 线性布局
	@布局配置([[父布局=线性布局5,@左外边距DP=0,@右外边距DP=10,字体颜色=-16777216,字体大小=14]])
	变量 文本框4 : 文本框
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-1]])
	变量 相对布局3 : 相对布局
	@布局配置([[父布局=相对布局3,宽度=-1,高度=-1,对齐方式=17,纵向布局=真]])
	变量 线性布局9 : 线性布局
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=45,背景颜色=-1]])
	变量 相对布局4 : 相对布局
	@布局配置([[父布局=相对布局4,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局14 : 线性布局
	@布局配置([[父布局=线性布局14,字体大小=15,粗体=真,内容="动画：",@左外边距DP=10,字体颜色=-16777216]])
	变量 文本框11 : 文本框
	@布局配置([[父布局=相对布局4,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局10 : 线性布局
	@布局配置([[父布局=线性布局10,@右外边距DP=5,宽度DP=150,对齐方式=8388629,内容="default"]])
	变量 文本框7 : 文本框
	@布局配置([[父布局=线性布局10,宽度DP=80,高度DP=30,@左外边距DP=0,对齐方式=17,水波纹效果=真,背景颜色=-14079703,@右外边距DP=10]])
	变量 线性布局16 : 线性布局
	@布局配置([[父布局=线性布局16,字体颜色=-1,内容="选择"]])
	变量 文本框13 : 文本框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=45,背景颜色=-1]])
	变量 相对布局2 : 相对布局
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局11 : 线性布局
	@布局配置([[父布局=线性布局11,字体大小=15,粗体=假,内容="第一人称 (first_person)",@左外边距DP=10,字体颜色=-16777216]])
	变量 文本框8 : 文本框
	@布局配置([[父布局=相对布局2,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局13 : 线性布局
	@布局配置([[父布局=线性布局13,@右外边距DP=10,宽度DP=100,对齐方式=8388613,内容="测试1"]])
	变量 文本框10 : 文本框
	@布局配置([[父布局=线性布局13,宽度DP=60,高度DP=30,对齐方式=17,水波纹效果=真,背景颜色=-14510092,@右外边距DP=10]])
	变量 线性布局17 : 线性布局
	@布局配置([[父布局=线性布局17,字体颜色=-1,内容="选择"]])
	变量 文本框14 : 文本框
	@布局配置([[父布局=线性布局9,宽度=-1,高度DP=45,背景颜色=-1]])
	变量 相对布局5 : 相对布局
	@布局配置([[父布局=相对布局5,宽度=-1,高度=-1,对齐方式=8388627]])
	变量 线性布局12 : 线性布局
	@布局配置([[父布局=线性布局12,字体大小=15,粗体=假,内容="第三人称 (third_person)",@左外边距DP=10,字体颜色=-16777216]])
	变量 文本框9 : 文本框
	@布局配置([[父布局=相对布局5,宽度=-1,高度=-1,对齐方式=8388629]])
	变量 线性布局15 : 线性布局
	@布局配置([[父布局=线性布局15,@右外边距DP=10,对齐方式=8388629,宽度DP=100,内容="测试2"]])
	变量 文本框12 : 文本框
	@布局配置([[父布局=线性布局15,宽度DP=60,高度DP=30,对齐方式=17,水波纹效果=真,背景颜色=-14510092,@右外边距DP=10]])
	变量 线性布局18 : 线性布局
	@布局配置([[父布局=线性布局18,字体颜色=-1,内容="选择"]])
	变量 文本框15 : 文本框

	//声明
	变量 设置_设定 : 设置_设定
	变量 信息 : 启动信息
	变量 文件选择 : 文件选择器
	
	//变量
	变量 ID : 文本 = ""
	变量 JSON内容 : 文本 = ""
	变量 first_person_int : 整数 = 0
	变量 third_person_int : 整数 = 0

	事件 编辑器_项目编辑器_附属_动画编辑器:创建完毕()
		//设置主题
		本对象.显示标题栏 = 假
		本对象.状态栏颜色 = 0XFFFFFFFF
		本对象.状态栏字体黑色 = 真
		//窗口切换动画
		播放默认切换动画(2)
		//退出按钮
		事件 图片框1:被单击()
			保存()
		结束 事件
		事件 文本框2:被单击()
			保存()
		结束 事件
		//设置夜间模式
		如果 设置_设定.获取开关("NightMode") 则
			设置夜间模式()
		结束 如果
		//设置背景
		变量 设置相关路径 : 文本 = 设置_设定.获取文本("PersonalityBackground")
		如果 设置相关路径.替换(" ","") == "" 则
		否则
			如果 文件是否存在(设置相关路径) 则
				设置_设置.设置布局背景(本对象,线性布局4,设置相关路径)
			结束 如果
		结束 如果
		//设置
		ID = 其他_其他.读缓存("project_editor_animation_id")
		JSON内容 = 读入附加资源文件("editor/project_editor/animation_default.json")
		文本框4.内容 = ID
		//设置选择动画
		文本框10.内容 = "animation." + ID.替换(":","_") + ".first_person"
		文本框12.内容 = "animation." + ID.替换(":","_") + ".third_person"
		//加载方法

		//订阅事件
		订阅事件()
	结束 事件

	//选择动画文件
	事件 线性布局16:被单击()
		文件选择.选择文件(本对象,114514)
	结束 事件
	
	//first_person
	事件 线性布局17:被单击()
		人称选择列表(文本框10,first_person_int,"f")
	结束 事件
	//third_person
	事件 线性布局18:被单击()
		人称选择列表(文本框12,third_person_int,"t")
	结束 事件

	/*
	当窗口要求另一个窗口返回数据成功时，会触发该事件用于接收返回数据
	*/
	事件 编辑器_项目编辑器_附属_动画编辑器:获得返回数据(请求码 : 整数,结果码 : 整数,数据 : 启动信息)
		假如 请求码
			是 114514
				变量 PATH : 文本 = 文件选择.解析文件地址(本对象,数据)
				如果 取文件后缀名(PATH).到小写() == "json" 则
					变量 检查 : 文本 = 读入文本文件(PATH)
					如果 检查 ? "animations" 则
						JSON内容 = 读入文本文件(PATH)
						否则
							弹出错误提示("你选择的json，不是动画文件！")
					结束 如果
					否则
						弹出错误提示("请选择json格式的动画文件！")
				结束 如果
		结束 假如
	结束 事件

	@虚拟方法
	方法 返回键被按下()
		保存()
	结束 方法

	//保存
	方法 保存()
		//置入
		信息.置入("name", ID)
		信息.置入("json2", JSON内容)
		信息.置入("first_person", 文本框10.内容)
		信息.置入("third_person", 文本框12.内容)
		置返回数据(4001, 信息)
		关闭窗口()
	结束 方法
	
	方法 人称选择列表(文本框名称 : 文本框,位置 : 整数,类型 : 文本)
		//转换为数组
		变量 json : JSON对象 = JSON内容
		变量 animations : JSON对象 = json["animations"]
		变量 animations_list : 对象[] = animations.键名
		变量 动画列表 : 文本[] = animations_list
		//加载对话框
		变量 选择框 : AlertDialog
		选择框.初始化 = 本对象
		选择框.标题 = "选择人称"
		选择框.按钮1 = "关闭"
		选择框.按钮颜色 = 0XFF3EA9D6
		选择框.置单选列表项(动画列表,位置)
		选择框.显示()
		事件 选择框:项目被单击(索引 : 整数)
			如果 类型 == "f" 则
				first_person_int = 索引
				否则
					third_person_int = 索引
			结束 如果
			文本框名称.内容 = 数组到集合(animations.键名).取成员(索引)
			选择框.关闭()
		结束 事件
	结束 方法


	//设置功能按钮颜色
	方法 设置夜间模式()
		本对象.状态栏颜色 = 0XFF333333
		本对象.状态栏字体黑色 = 假
		线性布局2.背景颜色 = 0XFF333333
		线性布局3.背景颜色 = 0XFF222222
		卡片布局1.卡片背景颜色 = 0XFF222222
		文本框2.字体颜色 = 0XFFFFFFFF
		文本框3.字体颜色 = 0XFFFFFFFF
		图片框1.图片资源 = 其他_资源.白色返回图标
		线性布局4.背景颜色 = 0XFF222222
		相对布局1.背景颜色 = 0XFF333333
		相对布局4.背景颜色 = 0XFF333333
		相对布局2.背景颜色 = 0XFF333333
		相对布局5.背景颜色 = 0XFF333333
		文本框1.字体颜色 = 0XFFFFFFFF
		文本框4.字体颜色 = 0XFFF3F3F3
		文本框11.字体颜色 = 0XFFFFFFFF
		文本框8.字体颜色 = 0XFFFFFFFF
		文本框9.字体颜色 = 0XFFFFFFFF
		文本框7.字体颜色 = 0XFFF3F3F3
		文本框10.字体颜色 = 0XFFF3F3F3
		文本框12.字体颜色 = 0XFFF3F3F3
	结束 方法

结束 类