类 开发者主页 : 窗口

	@布局配置([[根布局=真,宽度=-1,高度=-1]])
	变量 相对布局1 : 相对布局
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1,@上外边距DP=50,背景颜色=-1]])
	变量 滚动布局1 : 滚动布局
	@布局配置([[父布局=滚动布局1,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局3,宽度=-1,高度=-2,纵向布局=真]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-2,对齐方式=8388627]])
	变量 线性布局5 : 线性布局
	@布局配置([[父布局=线性布局5,字体大小=16,@左外边距DP=20,@上外边距DP=15,@下外边距DP=10,字体颜色=-16677377,内容="签名"]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局4,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局6 : 线性布局
	@布局配置([[父布局=线性布局6,@左外边距DP=20,字体大小=18,内容="软件签名",字体颜色=-16777216]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局4,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局7 : 线性布局
	@布局配置([[父布局=线性布局7,@左外边距DP=20,字体大小=18,内容="软件签名文件",字体颜色=-16777216]])
	变量 文本框4 : 文本框
	@布局配置([[父布局=线性布局3,宽度=-1,高度=-2,纵向布局=真]])
	变量 线性布局8 : 线性布局
	@布局配置([[父布局=线性布局8,宽度=-1,高度=-2,对齐方式=8388627]])
	变量 线性布局9 : 线性布局
	@布局配置([[父布局=线性布局9,字体大小=16,@左外边距DP=20,@上外边距DP=15,@下外边距DP=10,字体颜色=-16677377,内容="目录"]])
	变量 文本框9 : 文本框
	@布局配置([[父布局=线性布局8,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局10 : 线性布局
	@布局配置([[父布局=线性布局10,@左外边距DP=20,字体大小=18,内容="私有目录访问",字体颜色=-16777216]])
	变量 文本框10 : 文本框
	@布局配置([[父布局=线性布局8,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局11 : 线性布局
	@布局配置([[父布局=线性布局11,@左外边距DP=20,字体大小=18,内容="数据目录访问",字体颜色=-16777216]])
	变量 文本框11 : 文本框
	@布局配置([[父布局=线性布局3,宽度=-1,高度=-2,纵向布局=真]])
	变量 线性布局12 : 线性布局
	@布局配置([[父布局=线性布局12,宽度=-1,高度=-2,对齐方式=8388627]])
	变量 线性布局15 : 线性布局
	@布局配置([[父布局=线性布局15,字体大小=16,@左外边距DP=20,@上外边距DP=15,@下外边距DP=10,字体颜色=-16677377,内容="编辑"]])
	变量 文本框12 : 文本框
	@布局配置([[父布局=线性布局12,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局18 : 线性布局
	@布局配置([[父布局=线性布局18,@左外边距DP=20,字体大小=18,内容="数据库编辑",字体颜色=-16777216]])
	变量 文本框15 : 文本框
	@布局配置([[父布局=线性布局3,宽度=-1,高度=-2,纵向布局=真]])
	变量 线性布局13 : 线性布局
	@布局配置([[父布局=线性布局13,宽度=-1,高度=-2,对齐方式=8388627]])
	变量 线性布局16 : 线性布局
	@布局配置([[父布局=线性布局16,字体大小=16,@左外边距DP=20,@上外边距DP=15,@下外边距DP=10,字体颜色=-16677377,内容="工具"]])
	变量 文本框13 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局19 : 线性布局
	@布局配置([[父布局=线性布局19,@左外边距DP=20,字体大小=18,内容="编译g4(语法分析)文件",字体颜色=-16777216]])
	变量 文本框16 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局21 : 线性布局
	@布局配置([[父布局=线性布局21,@左外边距DP=20,字体大小=18,内容="MCBID转JSON",字体颜色=-16777216]])
	变量 文本框18 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局22 : 线性布局
	@布局配置([[父布局=线性布局22,@左外边距DP=20,字体大小=18,内容="生成绳包",字体颜色=-16777216]])
	变量 文本框19 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局23 : 线性布局
	@布局配置([[父布局=线性布局23,@左外边距DP=20,字体大小=18,内容="自动遍历(穷举)生成文本",字体颜色=-16777216]])
	变量 文本框20 : 文本框
	@布局配置([[父布局=线性布局13,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局24 : 线性布局
	@布局配置([[父布局=线性布局24,@左外边距DP=20,字体大小=18,内容="敬请期待",字体颜色=-16777216]])
	变量 文本框21 : 文本框
	@布局配置([[父布局=线性布局3,宽度=-1,高度=-2,纵向布局=真,可视=假]])
	变量 线性布局14 : 线性布局
	@布局配置([[父布局=线性布局14,宽度=-1,高度=-2,对齐方式=8388627]])
	变量 线性布局17 : 线性布局
	@布局配置([[父布局=线性布局17,字体大小=16,@左外边距DP=20,@上外边距DP=15,@下外边距DP=10,字体颜色=-16677377,内容="目录"]])
	变量 文本框14 : 文本框
	@布局配置([[父布局=线性布局14,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局20 : 线性布局
	@布局配置([[父布局=线性布局20,@左外边距DP=20,字体大小=18,内容="数据目录访问"]])
	变量 文本框17 : 文本框
	@布局配置([[父布局=相对布局1,宽度=-1,高度=-1]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=50,背景颜色=-592138,对齐方式=8388627]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,@左外边距DP=15,字体大小=18,内容="开发者模式",字体颜色=-16777216]])
	变量 文本框1 : 文本框


	事件 开发者主页:创建完毕()
		//设置主题
		本对象.显示标题栏 = 假
		本对象.状态栏颜色 = 0XFFF6F6F6
		本对象.状态栏字体黑色 = 真
		//窗口切换动画
		播放默认切换动画(2)
		//订阅事件
		订阅事件()
	结束 事件

结束 类