类 编辑器_代码编辑器_布局_新建文件 : 组件容器

	@布局配置([[根布局=真,宽度=-1,高度=-1,纵向布局=真,对齐方式=81]])
	变量 线性布局0 : 线性布局
	@布局配置([[父布局=线性布局0,宽度=-1,高度=-2,纵向布局=真,对齐方式=17,背景颜色=-1]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=45,对齐方式=17]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,字体大小=20,内容="标题",字体颜色=-16777216]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=线性布局1,宽度=-1,高度=-2,纵向布局=真]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局3,@左外边距DP=20,@右外边距DP=20,粗体=真,内容="名称",字体大小=15]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局3,@左外边距DP=20,@右外边距DP=20,宽度=-1,高度=-1,@上外边距DP=5,@下外边距DP=20,右内边距DP=8,左内边距DP=8,提示文本="请输入"]])
	变量 编辑框1 : 编辑框
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=60,上内边距DP=8,下内边距DP=8]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-1,圆角=70,@左外边距DP=20,@右外边距DP=20,卡片阴影=0]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,背景颜色=-769225,对齐方式=17,水波纹效果=真]])
	变量 线性布局5 : 线性布局
	@布局配置([[父布局=线性布局5,字体颜色=-1,字体大小=16,粗体=真,内容="确 定"]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=44,上内边距DP=0,下内边距DP=0,@下外边距DP=10]])
	变量 线性布局6 : 线性布局
	@布局配置([[父布局=线性布局6,宽度=-1,高度=-1,圆角=70,@左外边距DP=20,@右外边距DP=20,卡片阴影=0,@下外边距DP=0]])
	变量 卡片布局2 : 卡片布局
	@布局配置([[父布局=卡片布局2,宽度=-1,高度=-1,背景颜色=-986897,对齐方式=17,水波纹效果=真]])
	变量 线性布局7 : 线性布局
	@布局配置([[父布局=线性布局7,字体颜色=-12532257,字体大小=16,粗体=真,内容="取 消"]])
	变量 文本框4 : 文本框

结束 类

类 编辑器_代码编辑器_布局_重命名文件 : 组件容器

	@布局配置([[根布局=真,宽度=-1,高度=-1,纵向布局=真,对齐方式=81]])
	变量 线性布局0 : 线性布局
	@布局配置([[父布局=线性布局0,宽度=-1,高度=-2,纵向布局=真,对齐方式=17,背景颜色=-1]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=45,对齐方式=17]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,字体大小=20,内容="重命名",字体颜色=-16777216]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=线性布局1,宽度=-1,高度=-2,纵向布局=真]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局3,@左外边距DP=20,@右外边距DP=20,粗体=真,内容="新名称名称",字体大小=15]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局3,@左外边距DP=20,@右外边距DP=20,宽度=-1,高度=-1,@上外边距DP=5,@下外边距DP=20,右内边距DP=8,左内边距DP=8,提示文本="请输入"]])
	变量 编辑框1 : 编辑框
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=60,上内边距DP=8,下内边距DP=8]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,宽度=-1,高度=-1,圆角=70,@左外边距DP=20,@右外边距DP=20,卡片阴影=0]])
	变量 卡片布局1 : 卡片布局
	@布局配置([[父布局=卡片布局1,宽度=-1,高度=-1,背景颜色=-769225,对齐方式=17,水波纹效果=真]])
	变量 线性布局5 : 线性布局
	@布局配置([[父布局=线性布局5,字体颜色=-1,字体大小=16,粗体=真,内容="确 定"]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局1,宽度=-1,高度DP=44,上内边距DP=0,下内边距DP=0,@下外边距DP=10]])
	变量 线性布局6 : 线性布局
	@布局配置([[父布局=线性布局6,宽度=-1,高度=-1,圆角=70,@左外边距DP=20,@右外边距DP=20,卡片阴影=0,@下外边距DP=0]])
	变量 卡片布局2 : 卡片布局
	@布局配置([[父布局=卡片布局2,宽度=-1,高度=-1,背景颜色=-986897,对齐方式=17,水波纹效果=真]])
	变量 线性布局7 : 线性布局
	@布局配置([[父布局=线性布局7,字体颜色=-12532257,字体大小=16,粗体=真,内容="取 消"]])
	变量 文本框4 : 文本框

结束 类

类 编辑器_代码编辑器_菜单布局 : 组件容器

	@布局配置([[根布局=真,宽度=-1,高度=-2]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度=-1,背景颜色=-1]])
	变量 滚动布局1 : 滚动布局
	@布局配置([[父布局=滚动布局1,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局3,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/menu/save.xml"]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局3,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="保存"]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/menu/find.xml"]])
	变量 图片框2 : 图片框
	@布局配置([[父布局=线性布局4,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="查找"]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局5 : 线性布局
	@布局配置([[父布局=线性布局5,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/menu/substitution.xml"]])
	变量 图片框3 : 图片框
	@布局配置([[父布局=线性布局5,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="替换"]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局6 : 线性布局
	@布局配置([[父布局=线性布局6,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/menu/editor.xml"]])
	变量 图片框4 : 图片框
	@布局配置([[父布局=线性布局6,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="编辑"]])
	变量 文本框4 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局7 : 线性布局
	@布局配置([[父布局=线性布局7,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/menu/tool.xml"]])
	变量 图片框5 : 图片框
	@布局配置([[父布局=线性布局7,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="工具"]])
	变量 文本框5 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局8 : 线性布局
	@布局配置([[父布局=线性布局8,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/menu/symbol.xml"]])
	变量 图片框6 : 图片框
	@布局配置([[父布局=线性布局8,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="重新载入符号栏"]])
	变量 文本框6 : 文本框

结束 类

类 编辑器_代码编辑器_菜单编辑布局 : 组件容器

	@布局配置([[根布局=真,宽度=-1,高度=-2]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度=-1,背景颜色=-1]])
	变量 滚动布局1 : 滚动布局
	@布局配置([[父布局=滚动布局1,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局3,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/edit_menu/copy_line.xml"]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局3,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="复制行"]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/edit_menu/cut_line.xml"]])
	变量 图片框2 : 图片框
	@布局配置([[父布局=线性布局4,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="剪切行"]])
	变量 文本框2 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局5 : 线性布局
	@布局配置([[父布局=线性布局5,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/edit_menu/delete_line.xml"]])
	变量 图片框3 : 图片框
	@布局配置([[父布局=线性布局5,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="删除行"]])
	变量 文本框3 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局6 : 线性布局
	@布局配置([[父布局=线性布局6,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/edit_menu/empty_line.xml"]])
	变量 图片框4 : 图片框
	@布局配置([[父布局=线性布局6,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="清空行"]])
	变量 文本框4 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局7 : 线性布局
	@布局配置([[父布局=线性布局7,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/edit_menu/replace_line.xml"]])
	变量 图片框5 : 图片框
	@布局配置([[父布局=线性布局7,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="替换行"]])
	变量 文本框5 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局8 : 线性布局
	@布局配置([[父布局=线性布局8,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/edit_menu/repeat_line.xml"]])
	变量 图片框6 : 图片框
	@布局配置([[父布局=线性布局8,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="重复行"]])
	变量 文本框6 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局9 : 线性布局
	@布局配置([[父布局=线性布局9,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/edit_menu/to_uppercase.xml"]])
	变量 图片框7 : 图片框
	@布局配置([[父布局=线性布局9,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="转为大写"]])
	变量 文本框7 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局10 : 线性布局
	@布局配置([[父布局=线性布局10,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/edit_menu/to_lowercase.xml"]])
	变量 图片框8 : 图片框
	@布局配置([[父布局=线性布局10,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="转为小写"]])
	变量 文本框8 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局11 : 线性布局
	@布局配置([[父布局=线性布局11,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/edit_menu/paste.xml"]])
	变量 图片框9 : 图片框
	@布局配置([[父布局=线性布局11,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="粘贴"]])
	变量 文本框9 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局12 : 线性布局
	@布局配置([[父布局=线性布局12,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/edit_menu/format.xml"]])
	变量 图片框10 : 图片框
	@布局配置([[父布局=线性布局12,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="格式化"]])
	变量 文本框10 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真,可视=假]])
	变量 线性布局13 : 线性布局
	@布局配置([[父布局=线性布局13,宽度DP=25,高度DP=25,@左外边距DP=10]])
	变量 图片框11 : 图片框
	@布局配置([[父布局=线性布局13,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="标题"]])
	变量 文本框11 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真,可视=假]])
	变量 线性布局14 : 线性布局
	@布局配置([[父布局=线性布局14,宽度DP=25,高度DP=25,@左外边距DP=10]])
	变量 图片框12 : 图片框
	@布局配置([[父布局=线性布局14,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="标题"]])
	变量 文本框12 : 文本框

结束 类

类 编辑器_代码编辑器_菜单工具布局 : 组件容器

	@布局配置([[根布局=真,宽度=-1,高度=-2]])
	变量 线性布局1 : 线性布局
	@布局配置([[父布局=线性布局1,宽度=-1,高度=-1,背景颜色=-1]])
	变量 滚动布局1 : 滚动布局
	@布局配置([[父布局=滚动布局1,宽度=-1,高度=-1,纵向布局=真]])
	变量 线性布局2 : 线性布局
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局3 : 线性布局
	@布局配置([[父布局=线性布局3,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/tools/palette.xml"]])
	变量 图片框1 : 图片框
	@布局配置([[父布局=线性布局3,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="颜色选择"]])
	变量 文本框1 : 文本框
	@布局配置([[父布局=线性布局2,宽度=-1,高度DP=45,对齐方式=8388627,水波纹效果=真]])
	变量 线性布局4 : 线性布局
	@布局配置([[父布局=线性布局4,宽度DP=25,高度DP=25,@左外边距DP=10,图片资源="../../../../资源库/图标/editor/code_editor/tools/jump_lines.xml"]])
	变量 图片框2 : 图片框
	@布局配置([[父布局=线性布局4,@左外边距DP=10,字体大小=15,字体颜色=-16777216,内容="跳转行数"]])
	变量 文本框2 : 文本框

结束 类